{
    "jobsdb": [
        {
            "link": "https://sg.jobsdb.com/job/Senior-Software-Engineer-71b6aeadffb25902d05c06581cef0750?from_url=https%3A%2F%2Fsg.jobsdb.com%2Fj%3Fjt%3D3%26l%3DSingapore%26q%3Dsenior%2Bfront%2Bend%2Bdeveloper%26sp%3Dfacet_job_type%26p%3D1&sfjt=3&sl=Singapore&sol_srt=a383f7c4-6a4d-4e48-a9ec-7d107fe601d5&sp=serp&sponsored=false&sq=senior+front+end+developer&sr=1&tk=126J_PL5Iu7nx2Ls9QuX-5sdm8cMIldBpEjjbXoH2",
            "title": "Senior Software Engineer – Singapore",
            "location": "Outram",
            "company": "FARALLON CAPITAL ASIA PTE. LTD.",
            "salary": "$6,500 - $6,500 per month",
            "description": "Farallon Capital Management, L.L.C.® is a global institutional asset management firm. Founded in 1986 and headquartered in San Francisco, Farallon has offices in London, Singapore, Hong Kong, Tokyo, and São Paulo and employs approximately 210 employees. The firm’s investments include public and private debt and equity securities, direct investments in private companies, and real estate. Position Overview Who we are Farallon employs a small team of experienced software developers to improve the firm efficiency and support its day-to-day operations. Responsibilities What you will do • Develop end-user solutions/applications for Asia based offices (Singapore, Tokyo, Hong Kong) • Coordinate development efforts with US based development team • Work directly with end users to support critical business processes for front and middle office Qualifications What we look for • Passion for the craft of software • 5+ years of development experience, preferably with C# and .NET • Experience with SQL Server including database design and query optimization • Excellent English skills, both verbal and written. Additional language skills are desirable. • Knowledge of hedge funds/financial terminology desired. Compensation is competitive and commensurate with experience and expertise. The firm offers an attractive benefits package including medical, dental, and vision insurance plans and a retirement savings plan.",
            "infoSource": "GrabJobs",
            "postDate": "About 4 hours ago",
            "crawlerCreateDate": "1609951840285",
            "keyword": [
                "Farallon Capital Management, L.L.C.® is a global institutional asset management firm.",
                "Additional language skills are desirable.",
                "• Knowledge of hedge funds/financial terminology desired.",
                "Compensation is competitive and commensurate with experience and expertise."
            ]
        },
        {
            "link": "https://sg.jobsdb.com/job/Senior-Software-Developer-e27b3470ee8039be8d6a34ad60bfe8f9?from_url=https%3A%2F%2Fsg.jobsdb.com%2Fj%3Fjt%3D3%26l%3DSingapore%26q%3Dsenior%2Bfront%2Bend%2Bdeveloper%26sp%3Dfacet_job_type%26p%3D1&sfjt=3&sl=Singapore&sol_srt=a383f7c4-6a4d-4e48-a9ec-7d107fe601d5&sp=serp&sponsored=false&sq=senior+front+end+developer&sr=2&tk=126J_PL5Iu7nx2Ls9QuX-5sdm8cMIldBpEjjbXoH2",
            "title": "Senior Software Developer",
            "location": "River Valley",
            "company": "MAVERICKS CONSULTING PTE. LTD.",
            "salary": "$10,000 - $10,000 per month",
            "description": "Do you believe your designs and code could change the world? If YES, read on! Mavericks Consulting is a powerhouse of skilled IT professionals who love their craft. We solve complex business problems with simple working solutions by applying Agile software development practices. Mavericks collaborates closely with clients to achieve their business goals. We provide consultancy advice, develop prototypes for experimentation and validate ideas quickly. We develop robust and reliable operational systems within weeks, not months. We love to write code and build systems that put smiles on our delighted users. We believe in sharing our knowledge, upskilling and growing with the developer community. We organise tech related workshops and bootcamps to learn from each other. We share and have fun together on our continuous learning journey. We are looking for like-minded Mavericks to join us and multiply the fun and awesomeness of our workplace. Your Role and Responsibilities   Writing quality code alongside your development team using best development practices such as Test Driven Development (TDD), Continuous  Integration/ Continuous Delivery (CI/CD), Domain Driven Modelling, OOP  Use scalable design patterns to develop software that is easily extensible   Creating and maintaining a dynamic and collaborative environment   Learning something new everyday, working and pairing with amazing people  Be flexible and open to receiving feedback  Demonstrate technical leadership and proactively suggest the appropriate  technology based on the business needs   Understand the business needs and be empathetic of stakeholders in developing the right technical solution   Collaborate with other functional roles in helping our clients solve challenging  and complex problems   Championing Agile development practices to create meaningful technical solutions   Actively contributing to the company with your ideas  Genuinely wanting to help to change the world  The Qualifications To Be a Maverick 1. Professional Experience   Delivered at least one large-scale project to production  Worked in high performance cross-functional Agile software engineering teams  Know and have practised basic Agile practices such as  Kanban/Scrum/Lean/XP etc, Test Driven Development (TDD), Continuous  Integration/ Continuous Delivery (CI/CD)  Experience with cross-functional roles  2. Technical Experience   Deep understanding of at least one programming language and having  worked with other multiple languages (e.g. Java, Ruby, Python, Scala, GoLang, etc.)  Good understanding of at least one programming paradigm (OOP, FP)  Experience in using clean code practices, and writing readable,  maintainable code  Experience with backend development, frontend development and DevOps practices  Good understanding of end-to-end application architecture   Experience with delivering and deploying large scale applications using practices such as 12 factor apps  If you think you have what it takes to be a Mavericks, call us and have a chat!",
            "infoSource": "GrabJobs",
            "postDate": "About 18 hours ago",
            "crawlerCreateDate": "1609951840684",
            "keyword": [
                "Do you believe your designs and code could change the world?",
                "If YES, read on!",
                "Mavericks Consulting is a powerhouse of skilled IT professionals who love their craft.",
                "We love to write code and build systems that put smiles on our delighted users.",
                "We share and have fun together on our continuous learning journey."
            ]
        },
        {
            "link": "https://sg.jobsdb.com/job/Senior-Developer-0bdfedb14d7fff7e696a3cc7b6656983?from_url=https%3A%2F%2Fsg.jobsdb.com%2Fj%3Fjt%3D3%26l%3DSingapore%26q%3Dsenior%2Bfront%2Bend%2Bdeveloper%26sp%3Dfacet_job_type%26p%3D1&sfjt=3&sl=Singapore&sol_srt=a383f7c4-6a4d-4e48-a9ec-7d107fe601d5&sp=serp&sponsored=false&sq=senior+front+end+developer&sr=3&tk=126J_PL5Iu7nx2Ls9QuX-5sdm8cMIldBpEjjbXoH2",
            "title": "Senior Developer ",
            "location": "Central Singapore",
            "company": "GLOBAL BLUE SERVICE COMPANY SINGAPORE PTE. LTD.",
            "salary": "$6,000 - $8,000 per month",
            "description": "Roles & ResponsibilitiesMain duties and responsibilities   Work in concert with a team of software developers.  Experience in designing software solution architectures using software design patterns.  Participate in full software development lifecycle: analyzing requirements, developing designs, implementing and testing client and server-side applications / microservices in C#.  Writing and maintaining frontend Angular applications.  Write code, assist in developing technical solutions adhering to best practices.  Propose solutions; write, modify, and maintain software documentation and specifications.  Perform some integration testing and performance testing.  Maintain code quality thru unit tests, static code analysis and other code quality metrics tools.  Troubleshooting production issues as and when necessary.  May perform other duties as assigned.  Key competencies   Minimum 5 years’ experience with .NET C# development.  C#, .NET Core .Net Framework 4.6 or higher, ASP.NET, Visual Studio 2015 or higher.  Experience with Angular 7.0 or higher is a plus.  Microsoft ASP.Net MVC 3.0 Framework or higher.  Knowledge of XML, HTML, CSS, JQuery, JavaScript, is a must.  Solid experience in designing and implementing RESTful APIs.  Good understanding of Entity Framework or NHibernate ORM is an advantage.  Solid Understanding of relational databases and SQL for implementing database-driven, web-based applications using T-SQL/PL-SQL and Stored Procedures.  Solid understanding with T-SQL and working in Microsoft SQL Management Studio.  Good understanding of SQL Performance tuning techniques.  Solid understanding of object-oriented design principles.  Solid understanding of SOLID principles.  Strong debugging, troubleshooting and analytical skills.  Basic understanding of SSL and secured communication concepts.  Basic understanding of PCI Compliance is a bonus.  Consistently writing Unit Tests, solid understanding of software code quality is a must.  Awareness of software anti-patterns and consistent implementation of software best practices.  Thinking out of the box.  Maintain a positive attitude and be able to work independently and in a team environment.  Experience of managing a team is an added advantage.  Strong time management and organizational skills to enable productivity quickly.  Strong technical documentation ability.  Strong verbal communication skills and a demonstrated ability to work effectively in team-based development projects.  Strong, abstract critical thinking ability.  Understanding or Experience working in Agile/SCRUM environment.  Education and qualifications   University graduate or equivalent experience  Technical education  Requirements",
            "infoSource": "Mycareersfuture SG",
            "postDate": "About 4 hours ago",
            "crawlerCreateDate": "1609951841093",
            "keyword": [
                "NET C# development.",
                "Net Framework 4.6 or higher, ASP",
                "NET, Visual Studio 2015 or higher.",
                "Experience with Angular 7.0 or higher is a plus.",
                "Net MVC 3.0 Framework or higher.",
                "Basic understanding of PCI Compliance is a bonus.",
                "Strong technical documentation ability."
            ]
        },
        {
            "link": "https://sg.jobsdb.com/job/Senior-Software-Engineer-29d2e765a22a534c9b767123b255c5b7?from_url=https%3A%2F%2Fsg.jobsdb.com%2Fj%3Fjt%3D3%26l%3DSingapore%26q%3Dsenior%2Bfront%2Bend%2Bdeveloper%26sp%3Dfacet_job_type%26p%3D1&sfjt=3&sl=Singapore&sol_srt=a383f7c4-6a4d-4e48-a9ec-7d107fe601d5&sp=serp&sponsored=false&sq=senior+front+end+developer&sr=4&tk=126J_PL5Iu7nx2Ls9QuX-5sdm8cMIldBpEjjbXoH2",
            "title": "Senior Software Engineer",
            "location": "Paya Lebar",
            "company": "PROPERTYGURU PTE. LTD.",
            "salary": "$7,000 - $11,000 per month",
            "description": "Roles & ResponsibilitiesMake A Real Difference At PropertyGuru. Real Aspirations. Real People. Real impact. At PropertyGuru Group, we believe that every person – no matter what their circumstance – should have a place to call home. That’s why we’ve been on a mission to transform how people find, finance and own home across Southeast Asia over the last 13 years. Voted by property seekers as “Asia’s Most Influential Brand for Online Property Search”, PropertyGuru enables real-world aspirations through digital transformation and constant innovation. Every day, the work that we do has a real and positive impact on thousands of lives. As an employee, you’ll be empowered by our community work culture, where everyone has the autonomy, support and resources to do the best work of their careers. As we evolve our journey to help people make confident property decisions, we stay true to our core values to guide the way we work and the decisions we make every step of the way: we own it and deliver it, we have fun and celebrate success, we respect and care for each other, we push beyond good, and we create what’s next. This Is What We Have Done Already   We have developed 5 property portals with dominant presence in 4 countries  Our traffic has passed 100 million monthly page views and is increasing fast  We win prestigious awards for property online portals every year and our web portals always occupy top most visited sites in all 4 countries  What are typical challenges we face at PropertyGuru?   We’re dealing with massive amount of incoming data everyday  We’re dealing with massive traffic (130+M users)  Requirements   6+ years of web development experience using LAMP stack or Node.js or similar web technologies  Well-versed with front-end code in HTML5, CSS3, Javascript, React.js with familiarity in various frameworks and template languages  Possess strong understanding of Object-Oriented Programming, especially in PHP  Proficient with database design, optimization and tuning in MySQL or MongoDB  Experience in design patterns, unit testing, automation techniques (Selenium WebDriver)  Exposure to Amazon Web Services (EC2, S3, EBS, RDS, SQS, Redshift, etc.)  Exposure to Docker and Kubernetes  Exposure to collaborating tools like GitHub, JIRA, Confluence  Experience in frameworks such as Symfony 2, Express.js, or proven ability to learn on the job  Experience in Microservices and REST architecture  Exposure to Scrum methodology and XP technical practices such as unit testing, pair programming, test-driven development, continuous integration or continuous delivery  Self-motivated, fast learner, detail-oriented, team player and a sense of humor  PropertyGuru Group is an equal opportunity employer committed to fostering an inclusive, innovative and learning environment with the best employees. Therefore, we provide employment opportunities without regard to gender, identity, race, religion, nationality, age, marital status, disability, or any other protected status, per applicable law. If there is anything we can do to help ensure you have a comfortable and positive interview experience, please let us know. For a full listing of our jobs, visit https://careers.propertygurugroup.com Requirements",
            "infoSource": "Mycareersfuture SG",
            "postDate": "1 day ago",
            "crawlerCreateDate": "1609951841684",
            "keyword": [
                "Real Aspirations.",
                "Real People.",
                "Real impact.",
                "At PropertyGuru Group, we believe that every person – no matter what their circumstance – should have a place to call home.",
                "Every day, the work that we do has a real and positive impact on thousands of lives."
            ]
        },
        {
            "link": "https://sg.jobsdb.com/job/Senior-Software-Developer-bc9979f2d425152a571d4c7b587cd241?from_url=https%3A%2F%2Fsg.jobsdb.com%2Fj%3Fjt%3D3%26l%3DSingapore%26q%3Dsenior%2Bfront%2Bend%2Bdeveloper%26sp%3Dfacet_job_type%26p%3D1&sfjt=3&sl=Singapore&sol_srt=a383f7c4-6a4d-4e48-a9ec-7d107fe601d5&sp=serp&sponsored=false&sq=senior+front+end+developer&sr=5&tk=126J_PL5Iu7nx2Ls9QuX-5sdm8cMIldBpEjjbXoH2",
            "title": "Senior Software Developer",
            "location": "Singapore",
            "company": "Reebelo",
            "salary": "",
            "description": "About us Reebelo.com is one of APAC’s fastest growing startups. Seven-digit monthly sales, strong growth & funded by top VC investors. Our vision is to reduce e-waste by saving electronics from a premature death - while doing so, we enable customers to save up 70% on their favorite brands and flexibly rent devices instead of buying them. Join us if you want to be part of a high-growth, disruptive startup with a positive social impact! About the role As an early developer at Reebelo you will be an important contributor to the creation of a full fledged, scalable, high quality marketplace from scratch. Moreover you will work hands-on with our Head of Software Development, you will quickly gain skills and responsibilities as the team and the technical requirements grow. Currently, we are using Shopify and several backend & CRM tools with our own software built on top of that. Our goal is to progressively migrate towards a hybrid/self-built marketplace. Your responsibilities will be to: Integrate the platform with third parties APIs (payment gateways, logistics providers…) Create AWS complex infrastructure according to the business requirements Bootstrap the marketplace with an existing third party-technology Expand the marketplace to several countries (backend will serve several frontend) Build fast web rendering and optimize SEO Build and deploy RESTful microservices Your background At least 3 years of backend/fullstack experience At least 2 years of experience with AWS serverless architecture Experience in an e-commerce company Background + Degree in Computer Science Startup mindset Strong ability to learn Jump on board! Come have a chat with the team, it would be great to get to know you - send us your CV, some of your previous projects and more details of what you are looking for to ****@reebelo.com. We are looking forward to hearing from you!",
            "infoSource": "Glints",
            "postDate": "1 day ago",
            "crawlerCreateDate": "1609951842126",
            "keyword": [
                "About us Reebelo.com is one of APAC’s fastest growing startups.",
                "Seven-digit monthly sales, strong growth & funded by top VC investors.",
                "Join us if you want to be part of a high-growth, disruptive startup with a positive social impact!",
                "@reebelo.com."
            ]
        },
        {
            "link": "https://sg.jobsdb.com/job/Web-Developer-053800a5fb2f2490b48271bbad6d58da?from_url=https%3A%2F%2Fsg.jobsdb.com%2Fj%3Fjt%3D3%26l%3DSingapore%26q%3Dsenior%2Bfront%2Bend%2Bdeveloper%26sp%3Dfacet_job_type%26p%3D1&sfjt=3&sl=Singapore&sol_srt=a383f7c4-6a4d-4e48-a9ec-7d107fe601d5&sp=serp&sponsored=false&sq=senior+front+end+developer&sr=6&tk=126J_PL5Iu7nx2Ls9QuX-5sdm8cMIldBpEjjbXoH2",
            "title": "Web Developer",
            "location": "Outram",
            "company": "GSK CREATIVE PTE. LTD.",
            "salary": "$4,000 - $4,000 per month",
            "description": "GSK Creative is seeking a Creative Web Developer with strong knowledge of content management platforms, including WordPress. The Web Developer will be responsible for developing client websites, webinar, maintenance of website and more.. Scope   Together with project manager and senior designers, deliver creative and well functioning websites  Responsible for frontend/backend website development coding from layout to function, plugin/application development & troubleshooting  Able to create visually appealing sites that feature user-friendly design ,clear navigation and mobile friendly responsive websites/applications  Good command of English language, good communication skills as the position requires constant communication with colleagues  Working Environment / Perks   Working from home 4 out of 5 days per week (WFH)  21 days annual leave  13th month bonus  Requirements   Proficient in PHP, Wordpress, Woocommerce, customised web application development etc.  Expertise and hands on experience with Web Applications and programming languages such as HTML, CSS, JavaScript, PHP, API integration.  Strong understanding of UI, mobile responsive, cross-browser compatibility, general web functions and standards  Knowledge of Apache server hosting environment using Cpanel, WHM, AWS will be advantage  Min 1 year related working experience ",
            "infoSource": "GrabJobs",
            "postDate": "6 days ago",
            "crawlerCreateDate": "1609951842480",
            "keyword": [
                "GSK Creative is seeking a Creative Web Developer with strong knowledge of content management platforms, including WordPress.",
                "The Web Developer will be responsible for developing client websites, webinar, maintenance of website and more..",
                "Strong understanding of UI, mobile responsive, cross-browser compatibility, general web functions and standards Knowledge of Apache server hosting environment using Cpanel, WHM, AWS will be advantage Min 1 year related working experience"
            ]
        },
        {
            "link": "https://sg.jobsdb.com/job/Senior-Java-Developer-add02b707f9e928b459aec0d447e014a?from_url=https%3A%2F%2Fsg.jobsdb.com%2Fj%3Fjt%3D3%26l%3DSingapore%26q%3Dsenior%2Bfront%2Bend%2Bdeveloper%26sp%3Dfacet_job_type%26p%3D1&sfjt=3&sl=Singapore&sol_srt=a383f7c4-6a4d-4e48-a9ec-7d107fe601d5&sp=serp&sponsored=false&sq=senior+front+end+developer&sr=7&tk=126J_PL5Iu7nx2Ls9QuX-5sdm8cMIldBpEjjbXoH2",
            "title": "Senior Java Developer, Associate",
            "location": "Singapore",
            "company": "",
            "salary": "",
            "description": "    Senior Java Developer, Associate    ﻿As an experienced member of our Software Engineering Group, we look first and foremost for people who are passionate around solving business problems through innovation and engineering practices. You'll be required to apply your depth of knowledge and expertise to all aspects of the software development lifecycle, as well as partner continuously with your many stakeholders on a daily basis to stay focused on common goals. We embrace a culture of experimentation and constantly strive for improvement and learning. You'll work in a collaborative, trusting, thought-provoking environment-one that encourages diversity of thought and creative solutions that are in the best interests of our customers globally. The Wealth Management Client and Party reference data platform technology team in APAC is specifically seeking a senior development team member for building party and account platform. As a technologist, you will be responsible for developing functionality for key projects that are owned and driven by APAC, but delivering for the business globally. You will be part of a dynamic team that will work closely with product owners as well as interact globally with business stakeholders, product owners and other application developers at all levels of the organization. As a full-stack technologist, the role requires you to have sound technical skills and experience building applications with expertise on modern development practices. If you have a passion for bleeding edge technology and a drive for excellence in delivery, you will feel right at home in this organization.  Key Responsibilities:   Turning epics and stories provided by business, product owners or business analysts into technical designs and development Individual development contribution across some or all of the various components of the system, including web front-end, back-end services. Responsible for executing clean code for complex designs that are in line with the architectural direction Follow and promote Agile practices like Scrum and TDD/BDD Ensure consistency with and synergy across the global platform by collaborating regularly with peers across the global technology team. Active involvement in supporting the Client and Party reference data platform across all environments, including production in a devops model Have a keen focus on development modernization by embracing latest technologies and practices and taking initiative to research and learn. Lead the development team for Client and Party reference data platform and able to work with business stakeholders.  This role requires a wide variety of strengths and capabilities, including:  BS/BA degree or equivalent experience Experience with full-stack application development, including REST Web services , SpringBoot, and modern Javascript technologies such as ReactJS and/or Angular Micro service design patterns and exposure to Cloud based application development. Exposure to AWS and/or Pivotal Cloud Foundry would be an added advantage. Experience with SQL databases such as Sybase or Oracle and with NoSQL databases such as Cassandra and/or MongoDB Experience with middleware/messaging technologies such as MQ, JMS, Kafka, etc. and exposure to event-driven design patterns. Experience with distributed caches such as GemFire, ehCache, Hazelcast, etc. Experience developing with testing frameworks such as Junit, Mockito, Selenium and Cucumber Knowledge and experience of SCM and CI tools such Bitbucket, Jenkins and Maven. Knowledge of industry-wide technology trends and best practices Keen understanding of financial control and budget management Ability to work in large, collaborative teams to achieve organizational goals Passionate about building an innovative culture   ",
            "infoSource": "eFinancialCareers",
            "postDate": "About 3 hours ago",
            "crawlerCreateDate": "1609951842873",
            "keyword": [
                "We embrace a culture of experimentation and constantly strive for improvement and learning.",
                "The Wealth Management Client and Party reference data platform technology team in APAC is specifically seeking a senior development team member for building party and account platform.",
                "If you have a passion for bleeding edge technology and a drive for excellence in delivery, you will feel right at home in this organization.",
                "Lead the development team for Client and Party reference data platform and able to work with business stakeholders.",
                "Exposure to AWS and/or Pivotal Cloud Foundry would be an added advantage."
            ]
        },
        {
            "link": "https://sg.jobsdb.com/job/IWM-Senior-Interfaces-34e42f2c6601124f6d4a049b3de7d3b8?from_url=https%3A%2F%2Fsg.jobsdb.com%2Fj%3Fjt%3D3%26l%3DSingapore%26q%3Dsenior%2Bfront%2Bend%2Bdeveloper%26sp%3Dfacet_job_type%26p%3D1&sfjt=3&sl=Singapore&sol_srt=a383f7c4-6a4d-4e48-a9ec-7d107fe601d5&sp=serp&sponsored=false&sq=senior+front+end+developer&sr=8&tk=126J_PL5Iu7nx2Ls9QuX-5sdm8cMIldBpEjjbXoH2",
            "title": "IWM Senior Interfaces Lead",
            "location": "Singapore",
            "company": "Credit Suisse",
            "salary": "",
            "description": " Credit Suisse is a leading global wealth manager with strong investment banking capabilities. Headquartered in Zurich, Switzerland, we have a global reach with operations in about 50 countries and employ more than 45,000 people from over 150 different nations. Embodying entrepreneurial spirit, Credit Suisse delivers holistic financial solutions to our clients, including innovative products and specially tailored advice. Striving for quality and excellence in our work, we recognize and reward extraordinary performance among our employees, provide wide-ranging training and development opportunities, and benefit from a diverse range of perspectives to create value for our clients, shareholders and communities. We are Credit Suisse. We Offer     A significant role as a Core Banking Interface delivery lead in the APAC technology area   The opportunity to participate and shape the Wealth technology platform   In this role we provide Interface application development services for \"Core banking\" systems, in APAC Wealth Management Core Technology division   We are the Core Banking IT platform owner in APAC wealth management and application & Delivery owners of TEMENOS T24 system & related interface applications in Credit Suisse for APAC and IWM divisions.   The system is extensively used by APAC Private Banking business users & International Wealth Management Division to perform critical business functions (covering Front Office, Traders, Operations, Treasury, Financial accounting etc.).   We define the domain architecture strategy, solution engineering standards for TEMENOS T24 Application Development and handle complex platform delivery for CS   We provide 2nd and 3rd level Application Support for Core banking platform to our end users   A dynamic environment driving towards \"lean\" processes   A welcoming team of experienced software developers to work and collaborate with as well as a management with a focus on agility and lean processes   Being part of a forward-thinking team that takes ownership for the end-to-end delivery of value to multiple partners in a local and global business   Room to build, test new insights and make an impact    Role Responsibilities   Lead Engineer in Singapore for 'Core Platform Integration Suite' - Interface Lead for Core Banking product.   Expertise on Temenos T24 technology stack and the integration patterns supported by Temenos   Build assets (micro-services) and drive the simplification of the integration around T24 (core booking platform)   Responsible for incubation and/or continuous improvement of DevSecOps, Continuous Integration/Continuous Development for all applications within the core platform team covering, both T24 and Non-T24 applications.   Responsible and accountable for Core Banking Integration Suite (APIs & Apps produced within Core Banking space) that cut across both APAC and IWM   Be a tech-mentor for the engineers within Core Platform engineering   Drive the technical design/implementation topics to ensure that the requirements are transformed into effective solutions adhering to the firms standards, guidelines and policies   Conduct workshops, prepare and deliver presentations to demonstrate the capabilities of the Core Platform Integration Suite.   Seek to identify and validate any gaps together with proposals for their resolution (e.g. workarounds or changes in processes) and ensure any solutions proposed are realistic and within the agreed scope of the project.   Provide support to project teams to make sure any tactical solutions are lean and will be able to be replaced with preferred strategic architecture in the future   You Offer  Graduate with 10+ yrs of strong delivery and functional experience in Private Banking / Technology domain Accountable of delivering effective, creative and scalable solution for IWM Business. Operating within our Conduct & Ethic standards, being aware of operational risk, raising when any identified with a focus on striving for operational excellence and committed towards working with the wider team on constant improvement. Proficient in core banking system in Wealth Management / Private Banking. Knowledge and experience on T24 would be a plus Expertise in modern full-stack web frameworks, API design & development, and significant engineering experience on large scale programs and commercial software development using Java or any JVM-based languages Experience in the Banking and Financial Services domain. Exposure to Private Banking/Wealth Management domain will be an advantage Bachelor or Master degree in Computer Science, Mathematics, Computer Engineering or related technology disciplines is preferred Should be well versed in working in an agile environment Good communication skills, Interpersonal skills and management reporting along with strong trouble-shooting and problem solving abilities and can manage communication with business and technology partners to drive outcomes. Proficient in design within Core Banking systems Wide experience of driving and delivering complex IT Core Banking projects Outstanding Project management and delivery management skills Good knowledge on the private banking business process and functions will be a plus Coordinate with teams, onsite and offshore, in delivering the solution Deep understanding on delivering software using various IT solution delivery methodology and specifically on \"agile\" delivery approach Good Knowledge over engineering practices like 'Test Driven Development' / 'Behavioral Driven Development' and other 'agile' engineering practices. Good influential skill in order to bring creative ideas into reality Vendor coordination (handling the vendor contracts and work closely with them in the delivery of projects) Track the delivery plan of vendor and raise to onshore, wherever appropriate. Experience in managing large development and delivery teams. Possess sound delivery and project management skills Possess a \"Can do\" attitude and a good collaborator and strong delivery capabilities Experience with various project management methodologies including SCRUM or a similar agile methodologies Result oriented, dedicated, hardworking and can work on own initiative whilst also working collaboratively and deliver on time with integrity, sense of urgency, attention to detail and quality standards What we value Collaboration. Social activity is key to building software so you will play well with others. Figuring out the right thing for the team to do is not about winning a debate at all costs. Curiosity. Like to learn - continually, and deliberately. Passion. Passionate about software - Live and breathe software. It is not just a job; it is a way of life. Pragmatism. Thorough understanding of, and are highly informed by the purist approaches and has an understanding of what it takes to deliver working software. Completion. Delivery. Shipping working software with high usability to our customers is what matters most. The biggest thrill from a big new insight comes when you see it working in the real world. Diversity. Value everyone's ideas, background, thoughts, and culture.  Credit Suisse is an equal opportunity employer. Welcoming diversity gives us a competitive advantage in the global marketplace and drives our success.  ",
            "infoSource": "CAIA",
            "postDate": "2 days ago",
            "crawlerCreateDate": "1609951843313",
            "keyword": [
                "We are Credit Suisse.",
                "Proficient in core banking system in Wealth Management / Private Banking.",
                "Social activity is key to building software so you will play well with others.",
                "Passionate about software - Live and breathe software.",
                "Delivery.",
                "Shipping working software with high usability to our customers is what matters most.",
                "The biggest thrill from a big new insight comes when you see it working in the real world."
            ]
        },
        {
            "link": "https://sg.jobsdb.com/job/Senior-Software-Engineer-28ac76f2b317c7d886e0bc08f113d309?from_url=https%3A%2F%2Fsg.jobsdb.com%2Fj%3Fjt%3D3%26l%3DSingapore%26q%3Dsenior%2Bfront%2Bend%2Bdeveloper%26sp%3Dfacet_job_type%26p%3D1&sfjt=3&sl=Singapore&sol_srt=a383f7c4-6a4d-4e48-a9ec-7d107fe601d5&sp=serp&sponsored=false&sq=senior+front+end+developer&sr=9&tk=126J_PL5Iu7nx2Ls9QuX-5sdm8cMIldBpEjjbXoH2",
            "title": "Senior Software Engineer",
            "location": "Bugis",
            "company": "ZALORA SOUTH EAST ASIA PTE. LTD.",
            "salary": "$10,000 - $10,000 per month",
            "description": "Responsibilities: ● Design, and maintain corporate development techniques and procedures, including a method to audit. ● Design and maintain custom data integration solutions to meet operational and strategic corporate objectives, with a specific focus on EDI mappings and interfaces ● Support the SAP functional team for development and translate requirements with your expertise in designing Interface solution based on functional specifications, and also reviewing technical specifications. ● Adhere to corporate standards for development techniques and procedures. ● Create and maintain technical procedures and documentation for all custom data integration solutions including operations and user guides. ● Troubleshoot technical issues, identify and test needed modifications in existing custom data integration solutions to evolving business needs. ● Provide support and advice to users in the effective use of custom data integration solutions. ● Maintain a high level of knowledge in the field of data integration solutions development and new technologies and tools available. ● Prepare and maintain test data and test cases and perform various tests using design documents. ● Maintain system documentation for all SAP PI/PO instances and interfaces. ● Proficient hands-on experience in implementing A2A and B2B solutions using IDOC, RFC, JDBC, File, ABAP Proxy, SOAP, HTTP, REST, SFTP, and JMS adapters, including UDFs coding, development of PI adapter modules & ECC/CRM ABAP enhancements. JAVA skills are a plus. Requirements: ● Minimum 6 years experience in SAP PI/PO ● Strong verbal and written English Language skills ● Very good analytical skills and business process understanding is required ● Knowledge of integration technologies and specific SAP PI/PO architecture required ● Proficient hands-on experience in implementing A2A and B2B solutions using IDOC, RFC,JDBC, File, ABAP Proxy, SOAP, HTTP, REST, SFTP, and JMS adapters, including UDFs coding, development of PI adapter modules & ECC/CRM ABAP enhancements. JAVA skills are a plus ● Complete of a minimum of 2 full project lifecycle implementations and rollouts ● Experience with waterfall/agile project methodology Preferred: ● Experience with EDI implementation ● Exposure within SAP PO 7.5 (single stack)",
            "infoSource": "GrabJobs",
            "postDate": "About 3 hours ago",
            "crawlerCreateDate": "1609951844492",
            "keyword": [
                "● Adhere to corporate standards for development techniques and procedures.",
                "● Create and maintain technical procedures and documentation for all custom data integration solutions including operations and user guides.",
                "● Provide support and advice to users in the effective use of custom data integration solutions.",
                "● Prepare and maintain test data and test cases and perform various tests using design documents.",
                "JAVA skills are a plus."
            ]
        },
        {
            "link": "https://sg.jobsdb.com/job/Senior-Application-Developer-4af8216580d183eb7b979eb369a9632c?from_url=https%3A%2F%2Fsg.jobsdb.com%2Fj%3Fjt%3D3%26l%3DSingapore%26q%3Dsenior%2Bfront%2Bend%2Bdeveloper%26sp%3Dfacet_job_type%26p%3D1&sfjt=3&sl=Singapore&sol_srt=a383f7c4-6a4d-4e48-a9ec-7d107fe601d5&sp=serp&sponsored=false&sq=senior+front+end+developer&sr=10&tk=126J_PL5Iu7nx2Ls9QuX-5sdm8cMIldBpEjjbXoH2",
            "title": "Senior Application Developer (.Net)",
            "location": "Paya Lebar",
            "company": "ASCENTIS PTE. LTD.",
            "salary": "$5,000 - $5,000 per month",
            "description": "Senior Application Developer Ascentis is the leader in powering CRM & Loyalty programs for leading brands in Singapore and the region. Our clients benefit from our suite of cutting edge solutions in CRM, Omni-channel Loyalty, Integrated Retail eCommerce, Business Intelligence, Mobile Engagement, and Digital Marketing Services. Voted by senior industry marketers as one of Singapore's award-winning loyalty marketing agency, Ascentis is proud to be leading the customer engagement innovation in the retail, food & beverage, entertainment, and hospitality industries. We are a young spirited company with a culture of innovation. Our teams are driven by experience and passion. We are agile and passionate in what we do. We believe in our people. We believe in ourselves. Our clients believe in us. As we continue to scale, we are interested to seek dynamic individual and self-starter to join us on an amazing journey by building great products for clients who believe in us. Responsibilities · Mentor team member’s skills that improve team efficiency and proficiency. · Manage and communicate project tasks and priority to ensure high team productivity. · Work with other highly skilled developers to build rich and responsive interfaces applications for web and mobile. · Optimize existing applications, services and components · Provide input for project milestones, schedules, QA testing in an agile development environment. · Design, document and implement reusable frameworks and libraries. Programming Skillsets · Minimum 5 Years’ experience in web development · Strong in ASP .NET 4+, Asp.NET MVC, .NETCore, OOP, EF Core · Strong knowledge in EntityFramework Core, understand UnitOfWork · API Webservices: REST, SOAP, WCF with Authentication (Keys, JWT) and understand standard request model format in XML, JSON · Frontend development: JavaScript, HTML 5, offline storage, CSS 3, npm, Gulp, Grunt · Extensive experience in Front-end Technologies and Progressive Web Applications, e.g. webpack, reactjs/ ionic/ angular, knockout, etc. · Understand Dependencies Injection, IoC, Test Driven Development · Understand Domain-Driven Design · Familiar with Git version control Database · MS, SQL 2008 R2+, SP, trigger, view and basic DBA skill · Postgres & MongoDb knowledge will be advantage Relevant Experience and Other Requirements · AWS solutioning and architecting · Preferably Senior Full Stack Engineer specializing in IT/Computer - Software or equivalent. · Best to have: LinQ, TFS 2010, Git, Web Security · Basic understanding of Agile and Kanban methodologies · Understanding and implementation of security and privacy data protection · Strong understanding of web app security, e.g. Cross Site Scripting and Forgery (XSS and CSRF) · Knowledge of SCSS, LESS and BEM would be highly advantageous · Familiarity and appreciation of JIRA and Confluence and other productivity tools · Understand CICD pipeline · Docker containerize deployment approach · Basic Linux OS Knowledge Leadership · Experience with leading a team would be an advantage",
            "infoSource": "GrabJobs",
            "postDate": "About 3 hours ago",
            "crawlerCreateDate": "1609951844921",
            "keyword": [
                "Our teams are driven by experience and passion.",
                "Our clients believe in us.",
                "Programming Skillsets · Minimum 5 Years’ experience in web development · Strong in ASP",
                "NET 4+, Asp",
                "NET MVC"
            ]
        }
    ]
}