{
    "jobsdb": [
        {
            "link": "https://sg.jobsdb.com/job/rd/af0c8544f23ebf5aeba3544893b1628c?sp=sserp_top&sponsored=true&sr=1&tk=p4XgvtO8PwGxzOJnOu8c-l_NnrCeWxsaelyp3fHDd",
            "title": "",
            "location": "",
            "company": "",
            "salary": "",
            "description": "",
            "infoSource": "",
            "postDate": "",
            "crawlerCreateDate": "1616683868953"
        },
        {
            "link": "https://sg.jobsdb.com/job/rd/5d1bfa9af6584a6c1570c976ddf8881c?sp=sserp_top&sponsored=true&sr=2&tk=p4XgvtO8PwGxzOJnOu8c-l_NnrCeWxsaelyp3fHDd",
            "title": "",
            "location": "",
            "company": "",
            "salary": "",
            "description": "",
            "infoSource": "",
            "postDate": "",
            "crawlerCreateDate": "1616683871218"
        },
        {
            "link": "https://sg.jobsdb.com/job/Front-End-Developer-d7a84ee2ce887ec8d5db858f424c1c2a?from_url=https%3A%2F%2Fsg.jobsdb.com%2Fj%3Fa%3D24h%26jt%3D3%26l%3DSingapore%26q%3Dfront%2Bend%2Bdeveloper%26sp%3Dfacet_listed_date%26p%3D1&sfjt=3&sl=Singapore&sol_srt=0c743553-d47e-42e8-b2b5-b420002da7c4&sp=serp&sponsored=false&sq=front+end+developer&sr=1&tk=p4XgvtO8PwGxzOJnOu8c-l_NnrCeWxsaelyp3fHDd",
            "title": "FRONT END DEVELOPER",
            "location": "Central Singapore",
            "company": "APRIL SINGAPORE PTE. LTD.",
            "salary": "$6,000 - $8,000 per month",
            "description": "Roles & ResponsibilitiesYour duties will revolve around building software by writing code, modifying software to fix errors and, adapting it to new hardware. You will also be involved in directing system testing and validating procedures. You will be working with other departments to answer all their needs for developing products. Managing skills are appreciated as you will lead the E2E testing department. To be successful in this role, you will need extensive knowledge of programming languages and the software development life cycle. Qualifications / Specific Requirements:   Bachelor’s degree or 4+ years of work experience  Strong programming knowledge in HTML/CSS/SCSS, responsive design, Bootstrap, Angular 10  Experience with angular-ngrx and nx cloud  Experience in responsive web design, and cross-browser compatibility  Experience with REST Api  Experience in unit testing / E2E using Cypress  Experience in source control systems such as Git  Having worked within a SCRUM development team  Additional skills:   Development experience in building and deploying web and mobile-based applications, software design, and development in a cloud environment.  Proficiency in working with CI/CD methodologies.  Familiarity with technical requirements of Internet marketing and search engine optimisation, information security vulnerabilities and risk management  Soft skills:   Eager to learn, creative and proactive  Autonomous  Open-minded, able to operate in an international context  Passion to win, can-do attitude, enthusiastic with a strong motivation to contribute and succeed  Goal-oriented, empathetic and customer-centric  Requirements",
            "infoSource": "Mycareersfuture SG",
            "postDate": "About 5 hours ago",
            "crawlerCreateDate": "1616683871902"
        },
        {
            "link": "https://sg.jobsdb.com/job/Software-Developer-b46e068d3e24be0fbcca71b9b64a2355?from_url=https%3A%2F%2Fsg.jobsdb.com%2Fj%3Fa%3D24h%26jt%3D3%26l%3DSingapore%26q%3Dfront%2Bend%2Bdeveloper%26sp%3Dfacet_listed_date%26p%3D1&sfjt=3&sl=Singapore&sol_srt=0c743553-d47e-42e8-b2b5-b420002da7c4&sp=serp&sponsored=false&sq=front+end+developer&sr=2&tk=p4XgvtO8PwGxzOJnOu8c-l_NnrCeWxsaelyp3fHDd",
            "title": "Software Developer",
            "location": "Central Singapore",
            "company": "Jobster Pte Ltd (EA 06C5060)",
            "salary": "",
            "description": " Responsibilities:● Work within an agile development team to deliver high-quality software applications according to requirements.This may include:o Web application front-endso Mobile app front-endso Web application/API back-endso Automation scripts● Adopt proven software engineering practices like pair programming, code reviews, test-driven development. Requirements:● Experience in modern web application technologies such as ReactJS, Typescript, RoR (Ruby on Rails).Experience in the following would be advantageous:o Agile processes/practices (e.g. Scrum, Extreme Programming)o Continuous integration/continuous deploymento Cloud/PaaS platforms, such as AWS/Heroku/OpenShift o Serverless Frameworko Docker/container technologyo Mobile app development (for iOS and Android)o Relevant Microsoft technologies (e.g. C#, .NET, IIS, SQL Server, Windows Server)● A minimum of 2 years’ relevant working experience is preferred.",
            "infoSource": "Jobstreet SG",
            "postDate": "About 17 hours ago",
            "crawlerCreateDate": "1616683872316"
        },
        {
            "link": "https://sg.jobsdb.com/job/Front-end-Developer-17f0bdd58e857e22a9bb410df31aaa03?from_url=https%3A%2F%2Fsg.jobsdb.com%2Fj%3Fa%3D24h%26jt%3D3%26l%3DSingapore%26q%3Dfront%2Bend%2Bdeveloper%26sp%3Dfacet_listed_date%26p%3D1&sfjt=3&sl=Singapore&sol_srt=0c743553-d47e-42e8-b2b5-b420002da7c4&sp=serp&sponsored=false&sq=front+end+developer&sr=3&tk=p4XgvtO8PwGxzOJnOu8c-l_NnrCeWxsaelyp3fHDd",
            "title": "Front-end Developer ( Financial Institution )",
            "location": "Central Singapore",
            "company": "Cornerstone Global Partners",
            "salary": "",
            "description": " OUR CLIENT PROFILE OUR CLIENT won multiple awards and is a global innovator of technology that focuses on helping world-class clients in the financial sector to deliver market leading digital financial service experiences to their customers.  JOB OVERVIEW :As a Front-End Developer, you will have a passion for building and developing and customising software components for the client servicing team. Working within an agile environment you will lead the frontend development process partnering with product owners and other internal stakeholders with a deep focus on quality. Now you can grow your career with a leading financial services technology innovator with merit driven values and international culture.Drive your professional growth through rising to these challenges:  PROVIDE inputs to frontend development strategy, framework selection and emerging technologyPRODUCE frontend code based on wireframes, visual designs and UX specificationsCONTRIBUTE to the development of internal tools and reusable architecturePARTICIPATE in front-end web-development project lifecycle from pitch/prototype, through definition, build, integration, QA and deliveryFOLLOW sound development practises and contribute to the quality delivery of enterprise mobile solutionsCOLLABORATE with Scrum Master, onsite coordinators and UX teamsCUSTOMER centric focus and assist to manage internal customers and stakeholders THE PERSON WE NEED  Great skills and even greater personal qualities:  EDUCATION  Degree in relevant technology-based subject from a recognised university INDUSTRY EXPERIENCE  At least five years of experience developing client technologies     TECHNICAL SKILLS  Advanced knowledge of JavaScript, Angular ( Priority skillset ) and Typescript. HTML (Semantics, accessibility and cross-browser compatibility)CSS including scaling on large projects; Automation (JSLint, ESLInt, JSHint); JS Unit testing approaches (Mocha, Jasmine) and Source Control (Git, SVN). Experience in Jira and Bitbucket. COMMITMENT Demonstrate strong commitment to reach commonly agreed objectives  FAST LEARNER with strong capabilities to comprehend complex software applications  LANGUAGE strong English communication skills in written and spoken English  PERSONALITY Independent with strong problem-solving skills and positive attitude while being able to establish harmonious working relationships with team members   HOW TO APPLY: If you are a team player and would like to embark on this exciting challenge and most importantly, believe thatYOU CAN MAKE A DIFFERENCE, we would like to hear from you. Kindly submit your application by emailing a detailed copy of your updated Resume in MS Word Format toJonathan Ng (Reg. No.: R1332294) Email: ***********@cornerstoneglobalpartners.com Please indicate the below information in your resume: • Current & Expected Salary• Reason(s) for leaving• Notice Period / Availability to commence work We regret only short-listed candidate will be notified. All applications will be treated with the strictest confidence.By submitting any application or resume to us, you will be deemed to have read & agreed to the terms of ourPrivacy Policy, and consented to us collecting, using, retaining and disclosing your personal information toprospective employers for their consideration, and for our marketing EDMs which you may opt out byunsubscribing in the mailer. ",
            "infoSource": "Jobstreet SG",
            "postDate": "About 17 hours ago",
            "crawlerCreateDate": "1616683872714"
        },
        {
            "link": "https://sg.jobsdb.com/job/Developer-c033867d4f5df0f5220b869ea3d83998?from_url=https%3A%2F%2Fsg.jobsdb.com%2Fj%3Fa%3D24h%26jt%3D3%26l%3DSingapore%26q%3Dfront%2Bend%2Bdeveloper%26sp%3Dfacet_listed_date%26p%3D1&sfjt=3&sl=Singapore&sol_srt=0c743553-d47e-42e8-b2b5-b420002da7c4&sp=serp&sponsored=false&sq=front+end+developer&sr=4&tk=p4XgvtO8PwGxzOJnOu8c-l_NnrCeWxsaelyp3fHDd",
            "title": "Full Stack Developer ",
            "location": "Kent Ridge",
            "company": "NATIONAL UNIVERSITY OF SINGAPORE",
            "salary": "$3,500 - $5,000 per month",
            "description": "Roles & ResponsibilitiesTo plan, analyze, develop and maintain business applications based on business users’ IT requirements and to provide support services to business users over issues encountered upon using the applications. Duties & Responsibilities   Design and implement high quality complex applications and solutions that will meet users’ requirements.  Provide post-implementation maintenance support encountered with the existing applications.  Conduct technical feasibility study, analyse requirement specifications and collaborate with teams to design and architect solutions including developing proof of concepts.  Document and update the technical design specifications.  Prepare effort estimation, develop technical activities, schedule and work breakdown structures to ensure compliance to project scope, deliverables, resources and budget.  Ensure compliance with security, development and quality standards.  Identify and keep abreast of latest application development and technology trends on new initiative and emerging technologies.  Conduct or facilitate knowledge sharing of emerging technologies.  Qualifications   A degree in Computer Science, Computer Engineering, Information Technology or equivalent.  Relevant experience in application development and support, and has completed at least 2 rounds of SDLC in web development.  Strong programming skill in C#, ASP.NET, ASP.NET MVC, ASP.NET Core, Entity Framework, LINQ, jQuery, Angular and Bootstrap.  Having working experience in ASP.NET Core & Angular would be an advantage.  Deep knowledge in Relational Database Management System (RDBMS) such as Oracle and SQL.  Strong business process and analytical skills with the ability to assimilate information quickly, and communicate complex requirements and issues clearly and concisely. The ability to understand the business questions that users are trying to get answered is essential.  Strong oral, written and interpersonal communication skills with the ability to interact and communicate effectively with all levels of management, users and vendors.  Must be a self-starter and able to work independently with minimum supervision.  Must be a good team player, proactive in nature, fast learner, highly organized and positive attitude.  Entry level graduate with the relevant experience is welcomed to apply.  Experience in Higher Education industry is a bonus.  Interested applicants are invited to apply directly at our NUS Career Portal. We regret that only shortlisted candidates will be notified. Requirements",
            "infoSource": "Mycareersfuture SG",
            "postDate": "About 5 hours ago",
            "crawlerCreateDate": "1616683873056"
        },
        {
            "link": "https://sg.jobsdb.com/job/Analyst-5cf72bd670054dd6b6197ab4e9a9b74b?from_url=https%3A%2F%2Fsg.jobsdb.com%2Fj%3Fa%3D24h%26jt%3D3%26l%3DSingapore%26q%3Dfront%2Bend%2Bdeveloper%26sp%3Dfacet_listed_date%26p%3D1&sfjt=3&sl=Singapore&sol_srt=0c743553-d47e-42e8-b2b5-b420002da7c4&sp=serp&sponsored=false&sq=front+end+developer&sr=5&tk=p4XgvtO8PwGxzOJnOu8c-l_NnrCeWxsaelyp3fHDd",
            "title": "Analyst / Associate - Full Stack Developer, Technology & Operations - (WD20367)",
            "location": "Singapore",
            "company": "DBS Bank Ltd",
            "salary": "",
            "description": "Business Function  Group Technology and Operations (T&O) enables and empowers the bank with an efficient, nimble and resilient infrastructure through a strategic focus on productivity, quality & control, technology, people capability and innovation. In Group T&O, we manage the majority of the Bank's operational processes and inspire to delight our business partners through our multiple banking delivery channels.  Responsibilities  Full stack development as part of Agile DevOps team to create Microservices, Data model and API needed for IT operation automation tools. Collaborate with endpoint support teams to create tools to improve user experience Products under development: Onestop portal, End user experience improvement and IT operations dashboard (Patch tracking dashboard)  Requirements  Degree in a quantitative subject (e.g. Computer Science, Engineering, Mathematics, or related field). Minimum 5 years of working experience developing web applications. Strong proficiency in Python, JavaScript, web frameworks (Django, Flask, React, Angular) and SQL / No-SQL DB tools. Knowledge on API integration - REST, Active Directory LDAP and create interactive analytics Experience using Docker and Kubernetes or similar frameworks to deploy web applications at scale is preferred. Singaporean / PR preferred  Apply Now We offer a competitive salary and benefits package and the professional advantages of a dynamic environment that supports your development and recognises your achievements.",
            "infoSource": "Jobstreet SG",
            "postDate": "About 17 hours ago",
            "crawlerCreateDate": "1616683873446"
        },
        {
            "link": "https://sg.jobsdb.com/job/AVP-Front-End-74f7cf7efc3040f575c761884b52aa12?from_url=https%3A%2F%2Fsg.jobsdb.com%2Fj%3Fa%3D24h%26jt%3D3%26l%3DSingapore%26q%3Dfront%2Bend%2Bdeveloper%26sp%3Dfacet_listed_date%26p%3D1&sfjt=3&sl=Singapore&sol_srt=0c743553-d47e-42e8-b2b5-b420002da7c4&sp=serp&sponsored=false&sq=front+end+developer&sr=6&tk=p4XgvtO8PwGxzOJnOu8c-l_NnrCeWxsaelyp3fHDd",
            "title": "AVP, Front End UI Development Lead, Investment & Trading Technology, Technology & Operations (WD14930)",
            "location": "Singapore",
            "company": "DBS BANK LTD.",
            "salary": "$6,500 - $11,700 per month",
            "description": "Roles & ResponsibilitiesBusiness Function Group Technology and Operations (T&O) enables and empowers the bank with an efficient, nimble and resilient infrastructure through a strategic focus on productivity, quality & control, technology, people capability and innovation. In Group T&O, we manage the majority of the Bank's operational processes and inspire to delight our business partners through our multiple banking delivery channels. Job Description As a member of our Investment & Trading Technology Software Engineering Group we look first and foremost for people who are passionate around solving business problems through innovation & engineering practices. You will be required to apply your depth of knowledge and expertise to all aspects of the software development lifecycle, as well as partner continuously with your many stakeholders daily to stay focused on common goals. Responsibilities   Contribute core front-end functionality to digital platform applications  Architect rich front-end applications applying the latest native web platform technologies (web components, HTML5, CSS3, ES6)  Define best development practices and apply them in a large distributed development team  Drive the technical roadmap for an in-house widgets’ framework built on micro-frontend principles  Drive the design and delivery of an in-house web components library  Mentor front-end engineers spread across distributed teams across  Taking the ownership of design and development of T&M applications.  Taking the ownership of driving the discussion with business users  Deliver project in time, a single point of contact and responsible for the delivery.  Design, analyse, develop, unit testing (TDD) and regression automation (BDD) to deliver product backlog for large and complex projects.  Adopting and practicing Agile methodologies including, but not limited to, story grooming, sprint planning, complexity analysis, stand-up calls, and sprint retrospectives.  Adhere to firm-wide architecture standards, risk management and security policies.  Team player and ability to work in Global Team setup, product owners and business team to develop, build & support application.  Communicate and collaborate on development items with global team, as well as raise/work to resolve issues impacting development.  Postproduction application support  Participate in quality assurance, peer reviews and code reviews Qualifications  Requirements Web Technologies & Framework Web Components Angular 2 to 8, Ionic React, React Native AngularJS/Vue.js/Knockout.js JavaScript, TypeScript, ES6 HTML5, CSS3, SASS/LESS/Stylus Redux, NgRx Bootstrap/Material/Vaadin Web Sockets, STOMP, XMPP Web Services, REST/SOAP/GraphQL Apache Cordova / PhoneGap D3.js/Chart.js Automation & Version Controlling Jenkins, Gitlab-CI/CD GitHub, GitLab Subversion Testing Mocha/Jasmine/Jest/ Karma Puppeteer/Protractor GUI Testing Cloud Computing & Microservices AWS/Azure Tomcat, Nginix, Apache Tools Gulp, Grunt, Web pack Sonar, SonarQube Logstash, Kibana, Dynatrace VSC, XCode, Dreamweaver Visual VM, JMeter Postman, Swagger Zeplin/Invision Others OAuth 2, Open ID, Auth0 JWT IntelliJ Idea, WebStorm Linux, Ubuntu, Windows SCRUM, Agile Design Thinking Apply Now We offer a competitive salary and benefits package and the professional advantages of a dynamic environment that supports your development and recognises your achievements. Requirements",
            "infoSource": "Mycareersfuture SG",
            "postDate": "About 5 hours ago",
            "crawlerCreateDate": "1616683874416"
        },
        {
            "link": "https://sg.jobsdb.com/job/Software-Developer-43c0d40d2b4342f0ef85e441e5bc56f1?from_url=https%3A%2F%2Fsg.jobsdb.com%2Fj%3Fa%3D24h%26jt%3D3%26l%3DSingapore%26q%3Dfront%2Bend%2Bdeveloper%26sp%3Dfacet_listed_date%26p%3D1&sfjt=3&sl=Singapore&sol_srt=0c743553-d47e-42e8-b2b5-b420002da7c4&sp=serp&sponsored=false&sq=front+end+developer&sr=7&tk=p4XgvtO8PwGxzOJnOu8c-l_NnrCeWxsaelyp3fHDd",
            "title": "Software Developer (Web / Mobile App)",
            "location": "Central Singapore",
            "company": "TRUST RECRUIT PTE. LTD.",
            "salary": "",
            "description": " Responsibilities Develop web and mobile applications following development best practices, ensuring solution performance and user adoption Develop integrations with external systems according to the defined architecture guidelines Finish all assigned tasks with quality within the defined timebox Conducts unit testing and integration testing, executing the necessary bug fixing  Requirements Proficient in .NET or Java, and database modeling and SQL Proficient in front-end web technologies like JavaScript, CSS Experience developing apps on OutSystems will be an advantage Willing to pick up new technologies quickly and independently Possess at least a Diploma in IT, or a related field  HOW TO APPLY:Interested applicants, kindly send your resume in MS WORD format to ****@trustrecruit.com.sg or please click on “Apply Now” and provide the below details in your resume.  We regret only shortlisted candidates will be notified.Important Note: Trust Recruit Pte Ltd is committed to safeguarding your personal data in accordance with the Personal Data Protection Act (PDPA).Please read our privacy statement on our corporate website www.trustrecruit.com.sg. Trust Recruit Pte LtdEA License No: 19C9950EA Personnel: Tiew Hong WeiEA Personnel Reg No: R1981870 ",
            "infoSource": "Jobstreet SG",
            "postDate": "About 17 hours ago",
            "crawlerCreateDate": "1616683874814"
        },
        {
            "link": "https://sg.jobsdb.com/job/Software-Developer-Web-b1a85169bb28b67d42ca7fc261d102d3?from_url=https%3A%2F%2Fsg.jobsdb.com%2Fj%3Fa%3D24h%26jt%3D3%26l%3DSingapore%26q%3Dfront%2Bend%2Bdeveloper%26sp%3Dfacet_listed_date%26p%3D1&sfjt=3&sl=Singapore&sol_srt=0c743553-d47e-42e8-b2b5-b420002da7c4&sp=serp&sponsored=false&sq=front+end+developer&sr=8&tk=p4XgvtO8PwGxzOJnOu8c-l_NnrCeWxsaelyp3fHDd",
            "title": "Software Developer【Web Platform || C# || UI】",
            "location": "Central Singapore",
            "company": "The Supreme HR Advisory Pte. Ltd.",
            "salary": "",
            "description": "  Redhill– Singapore 5 days || 9am-6pm || $3,000-$4,500 Software Developer, C#, Web & Mobile Career Progression Opportunities!   Interested applicants can also send your resume to ✉ ***************@gmail.com and allow our Consultant to match you with our Clients. No Charges will be incurred by Candidates for any service rendered.Responsibilities: Participate in the analysis, design, development and execution of the solution. Main focus will be on the development of Windows UI, Web UI & mobile(android). Handle technical integration with the use of various APIs and/or frameworks. Support testing and documenting tests as necessary, including creating test plans Work closely with the project team on development and testing. Serve as a critical member of the development team, actively contributing new ideas and solutions. Requirements: At least 2 years’ experience in developing on both mobile(android) and web platforms. Highly competent in C#. Languages such as C++/Java/Python is advantageous. Self-motivated, self-discipline and learning attitude Good analytical logically and willingness to try out new technologies. Able to work independently with multi-disciplinary team, which are dynamic, collaborative and non-hierarchical.  Please include the following in your Resume Document *(*.DOC/PDF - Files should not exceed 2MB)   • Name   • Contact No.   • Nationality/PR Status   • Location/Address   • Recent Photo   • Expected Salary ",
            "infoSource": "Jobstreet SG",
            "postDate": "About 17 hours ago",
            "crawlerCreateDate": "1616683875215"
        },
        {
            "link": "https://sg.jobsdb.com/job/Senior-Developer-120812d196b7eea8e86856d5c79fa500?from_url=https%3A%2F%2Fsg.jobsdb.com%2Fj%3Fa%3D24h%26jt%3D3%26l%3DSingapore%26q%3Dfront%2Bend%2Bdeveloper%26sp%3Dfacet_listed_date%26p%3D1&sfjt=3&sl=Singapore&sol_srt=0c743553-d47e-42e8-b2b5-b420002da7c4&sp=serp&sponsored=false&sq=front+end+developer&sr=9&tk=p4XgvtO8PwGxzOJnOu8c-l_NnrCeWxsaelyp3fHDd",
            "title": "Senior Developer",
            "location": "Outram",
            "company": "Quantum Xtreme Pte.Ltd",
            "salary": "",
            "description": "We are a Digital Asset/Cryptocurrency Exchange based in Singapore and we are looking for a Senior Developer to join our team and help lead and grow our company further. We are looking for a full-stack (focusing more on front-end development) engineer who can also manage a team and advise senior management on company direction moving forward.   Some of the responsibilities include (but are not limited to):  Design and develop web & mobile applications for the exchange platform. Develop or enhance the existing web and mobile architecture and maintain and improve existing codebase. Work closely with the UI/UX designer and bridge the gap between graphical design and technical implementation. Develop new user-facing features, build reusable code and libraries for future use and optimize application for maximum speed and scalability. Assure that all user input is validated before submitting to back-end Find new and better solutions and see how the company can evolve in the long run. Build high-quality mockups and design different prototypes. Research, design, develop, and test blockchain technologies. Brainstorm and help evaluate applications for new tools and technologies as they continually evolve. Maintain and extend current client- and server-side applications responsible for integration and business logic.  Requirements:  Skills: React.JS, React Native/Flutter, Java Script, CSS 3, HTML5, C++, Python ( Depending on projects). Thorough understanding of React.JS and its core principle (e.g. Redux). Familiar with API integration & WebSocket. Familiar with version control tools such as Git. Experience working with large codebases and with open-source projects. Strong knowledge of common algorithms and data structures. Familiarity with basic cryptography and P2P networks. Strong knowledge of bitcoin-like blockchains.   The Profile We are looking for:  Strong software development background. Ability to work as a team and has good communication skills in English. Able to develop an app from scratch. Good interpersonal and communication skills. Blockchain developer with startup experience preferred Possess at least a degree in Computer Science or any related field (optional) At least 3 years of working experience is required for this position.   Working Schedule:  Monday to Friday: 9.30 a.m – 6.30 p.m Working Location at Cecil Street.  Apply Today: This position comes with an attractive salary package, competitive benefits and a golden experience to learn and grow. You will be joining a fast-growing team in the cutting-edge industry of Financial Technology. By submitting your application and resume to us, you will be deemed to have agreed and consented to us collecting, using, retaining and disclosing your personal information for consideration. All resumes will be treated with the strictest confidentiality. Only shortlisted candidates will be contacted.",
            "infoSource": "Jobstreet SG",
            "postDate": "About 17 hours ago",
            "crawlerCreateDate": "1616683875578"
        },
        {
            "link": "https://sg.jobsdb.com/job/Senior-Associate-7f7937c110e9e39ce1b4a416d7beb955?from_url=https%3A%2F%2Fsg.jobsdb.com%2Fj%3Fa%3D24h%26jt%3D3%26l%3DSingapore%26q%3Dfront%2Bend%2Bdeveloper%26sp%3Dfacet_listed_date%26p%3D1&sfjt=3&sl=Singapore&sol_srt=0c743553-d47e-42e8-b2b5-b420002da7c4&sp=serp&sponsored=false&sq=front+end+developer&sr=10&tk=p4XgvtO8PwGxzOJnOu8c-l_NnrCeWxsaelyp3fHDd",
            "title": "Senior Associate, Front End UI Development Lead, Investment & Trading Technology, Technology & Operations (WD14930)",
            "location": "Singapore",
            "company": "DBS BANK LTD.",
            "salary": "$5,000 - $9,000 per month",
            "description": "Roles & ResponsibilitiesBusiness Function Group Technology and Operations (T&O) enables and empowers the bank with an efficient, nimble and resilient infrastructure through a strategic focus on productivity, quality & control, technology, people capability and innovation. In Group T&O, we manage the majority of the Bank's operational processes and inspire to delight our business partners through our multiple banking delivery channels. Job Description As a member of our Investment & Trading Technology Software Engineering Group we look first and foremost for people who are passionate around solving business problems through innovation & engineering practices. You will be required to apply your depth of knowledge and expertise to all aspects of the software development lifecycle, as well as partner continuously with your many stakeholders daily to stay focused on common goals. Responsibilities   Contribute core front-end functionality to digital platform applications  Architect rich front-end applications applying the latest native web platform technologies (web components, HTML5, CSS3, ES6)  Define best development practices and apply them in a large distributed development team  Drive the technical roadmap for an in-house widgets’ framework built on micro-frontend principles  Drive the design and delivery of an in-house web components library  Mentor front-end engineers spread across distributed teams across  Taking the ownership of design and development of T&M applications.  Taking the ownership of driving the discussion with business users  Deliver project in time, a single point of contact and responsible for the delivery.  Design, analyse, develop, unit testing (TDD) and regression automation (BDD) to deliver product backlog for large and complex projects.  Adopting and practicing Agile methodologies including, but not limited to, story grooming, sprint planning, complexity analysis, stand-up calls, and sprint retrospectives.  Adhere to firm-wide architecture standards, risk management and security policies.  Team player and ability to work in Global Team setup, product owners and business team to develop, build & support application.  Communicate and collaborate on development items with global team, as well as raise/work to resolve issues impacting development.  Postproduction application support  Participate in quality assurance, peer reviews and code reviews Qualifications  Requirements Web Technologies & Framework Web Components Angular 2 to 8, Ionic React, React Native AngularJS/Vue.js/Knockout.js JavaScript, TypeScript, ES6 HTML5, CSS3, SASS/LESS/Stylus Redux, NgRx Bootstrap/Material/Vaadin Web Sockets, STOMP, XMPP Web Services, REST/SOAP/GraphQL Apache Cordova / PhoneGap D3.js/Chart.js Automation & Version Controlling Jenkins, Gitlab-CI/CD GitHub, GitLab Subversion Testing Mocha/Jasmine/Jest/ Karma Puppeteer/Protractor GUI Testing Cloud Computing & Microservices AWS/Azure Tomcat, Nginix, Apache Tools Gulp, Grunt, Web pack Sonar, SonarQube Logstash, Kibana, Dynatrace VSC, XCode, Dreamweaver Visual VM, JMeter Postman, Swagger Zeplin/Invision Others OAuth 2, Open ID, Auth0 JWT IntelliJ Idea, WebStorm Linux, Ubuntu, Windows SCRUM, Agile Design Thinking Apply Now We offer a competitive salary and benefits package and the professional advantages of a dynamic environment that supports your development and recognises your achievements. Requirements",
            "infoSource": "Mycareersfuture SG",
            "postDate": "About 5 hours ago",
            "crawlerCreateDate": "1616683875987"
        },
        {
            "link": "https://sg.jobsdb.com/job/rd/80bcd394ab7be8b9d833c7ca0b4cbe7c?sp=sserp_bottom&sponsored=true&sr=3&tk=p4XgvtO8PwGxzOJnOu8c-l_NnrCeWxsaelyp3fHDd",
            "title": "",
            "location": "",
            "company": "",
            "salary": "",
            "description": "",
            "infoSource": "",
            "postDate": "",
            "crawlerCreateDate": "1616683876952"
        },
        {
            "link": "https://sg.jobsdb.com/job/rd/17f0bdd58e857e22a9bb410df31aaa03?sp=sserp_bottom&sponsored=true&sr=4&tk=p4XgvtO8PwGxzOJnOu8c-l_NnrCeWxsaelyp3fHDd",
            "title": "",
            "location": "",
            "company": "",
            "salary": "",
            "description": "",
            "infoSource": "",
            "postDate": "",
            "crawlerCreateDate": "1616683878118"
        },
        {
            "link": "https://sg.jobsdb.com/job/rd/53bcd833ab2adf13cc3bd279851d6f14?sp=sserp_bottom&sponsored=true&sr=5&tk=p4XgvtO8PwGxzOJnOu8c-l_NnrCeWxsaelyp3fHDd",
            "title": "",
            "location": "",
            "company": "",
            "salary": "",
            "description": "",
            "infoSource": "",
            "postDate": "",
            "crawlerCreateDate": "1616683879578"
        },
        {
            "link": "https://sg.jobsdb.com/job/rd/2ad1f3e0a09ce48f415277ad301ece61?sp=sserp_top&sponsored=true&sr=11&tk=i3TsKp8edP0sc960bUBp-crXvhUkylKMdgHcTXXHy",
            "title": "",
            "location": "",
            "company": "",
            "salary": "",
            "description": "",
            "infoSource": "",
            "postDate": "",
            "crawlerCreateDate": "1616683880656"
        },
        {
            "link": "https://sg.jobsdb.com/job/rd/e8a0bd78aea3a3d19688d47b136691bf?sp=sserp_top&sponsored=true&sr=12&tk=i3TsKp8edP0sc960bUBp-crXvhUkylKMdgHcTXXHy",
            "title": "",
            "location": "",
            "company": "",
            "salary": "",
            "description": "",
            "infoSource": "",
            "postDate": "",
            "crawlerCreateDate": "1616683881645"
        },
        {
            "link": "https://sg.jobsdb.com/job/Fullstack-Developer-2cec32a11da49ef9a7026feb43bc54e6?from_url=https%3A%2F%2Fsg.jobsdb.com%2Fj%3Fa%3D24h%26jt%3D3%26l%3DSingapore%26q%3Dfront%2Bend%2Bdeveloper%26sp%3Dfacet_listed_date%26p%3D2&sfjt=3&sl=Singapore&sol_srt=5e889712-4037-4e2c-8360-cb73bac41bdc&sp=serp&sponsored=false&sq=front+end+developer&sr=11&tk=i3TsKp8edP0sc960bUBp-crXvhUkylKMdgHcTXXHy",
            "title": "Fullstack Developer (Blockchain)",
            "location": "Singapore",
            "company": "GovTech Singapore",
            "salary": "",
            "description": "Assurity Trusted Solutions (ATS) is a wholly-owned subsidiary of the Government Technology Agency (GovTech), incorporated to operate the National Authentication Framework (NAF) and National Certification Authority (NCA). We aim to be the Source of Trust in the use of digital services, and committed to enhance Trust and High Assurance of digital services by providing secure and convenient identity management solutions. Are you ready to be part of the only National Certification Authority (NCA) in Singapore which provides high assurance solutions that enable consumers and businesses to enjoy more seamless and safe digital transactions in their everyday lives? We are looking for a Fullstack Developer to join us in our mission to enhance Singapore’s competitiveness as a trusted ICT hub for citizens and businesses, and to expand our product offerings into new regional markets A brief summary of your job responsibility:  Develop new capabilities focusing on strategic systems of engagement where ICT provides a differentiating factor to our users.  Working in a cross-functional team with engineers, product manager, and product designer to understand needs and build the product Deploying applications on AWS Lead conversations on solutioning and system designs, establishing best practices, and mentor other engineers in the team  To succeed in this role, you will ideally have:  3 years of Full Stack Development experience with a modern JS frontend framework in React.JS (using Typescript) and Backend Development experience with Node.js, Kotlin or Rust Good understanding of how a web application works and basic cryptography Experience with Blockchain Distributed Applications (DApp) development is a plus ",
            "infoSource": "GovTech Singapore",
            "postDate": "About 9 hours ago",
            "crawlerCreateDate": "1616683882047"
        },
        {
            "link": "https://sg.jobsdb.com/job/Native-Mobile-Developer-9e5d64c7ad4ce445fe0fae68e4007699?from_url=https%3A%2F%2Fsg.jobsdb.com%2Fj%3Fa%3D24h%26jt%3D3%26l%3DSingapore%26q%3Dfront%2Bend%2Bdeveloper%26sp%3Dfacet_listed_date%26p%3D2&sfjt=3&sl=Singapore&sol_srt=5e889712-4037-4e2c-8360-cb73bac41bdc&sp=serp&sponsored=false&sq=front+end+developer&sr=12&tk=i3TsKp8edP0sc960bUBp-crXvhUkylKMdgHcTXXHy",
            "title": "React Native Mobile Developer",
            "location": "Ayer Raja New Town",
            "company": "FINDJOBS PTE. LTD.",
            "salary": "$2,500 - $3,500 per month",
            "description": "Roles & Responsibilities• Work as part of a small team to build React Native iOS / Android applications.   Architect, build and maintain React Native applications with clean code. Implement UI's that match designs. Integrate third-party API's.  • Release applications to the Apple and Google Play stores. • 1 year of experience working with React Native. • Ability to take ownership over your work. • A positive mindset and can-do attitude. • Attention to detail. Requirements",
            "infoSource": "Mycareersfuture SG",
            "postDate": "About 5 hours ago",
            "crawlerCreateDate": "1616683883044"
        },
        {
            "link": "https://sg.jobsdb.com/job/Software-Engineer-18ad730cb110ddd56362c93363e576b7?from_url=https%3A%2F%2Fsg.jobsdb.com%2Fj%3Fa%3D24h%26jt%3D3%26l%3DSingapore%26q%3Dfront%2Bend%2Bdeveloper%26sp%3Dfacet_listed_date%26p%3D2&sfjt=3&sl=Singapore&sol_srt=5e889712-4037-4e2c-8360-cb73bac41bdc&sp=serp&sponsored=false&sq=front+end+developer&sr=13&tk=i3TsKp8edP0sc960bUBp-crXvhUkylKMdgHcTXXHy",
            "title": "Software Engineer",
            "location": "Singapore",
            "company": "Bluente",
            "salary": "",
            "description": "Company Description We are an early stage EdTech firm. Our goal is to build a mobile app to provide better learning experiences for adults in language learning. We're looking for people who are enthusiastic about our product but also fast and independent learners. As a full-stack engineer at an early-stage company, you'll be an essential part of the product team and will be shipping code daily to a rapidly growing user base. Why this role? Get your hands dirty: As one of our initial founding members, you'll play a role in shaping the product and learn every aspect of app development. Fast-paced: You'll be involved with product development in every angle, from front-end to back-end, to infrastructure. Lead and grow a team: You’ll have the opportunity to direct development of the application! Build a product that counts: We believe we can change the language learning space. We hope you are interested too! Join at an exciting time: We're at the start of our journey and have just completed a prototype, preparing for launch. You'll be an essential part of that launch. We're also starting to search for seed funding so we will be expanding quickly. Role: Write code that is reusable, scalable and testable while ensuring that products are delivered on time and with high quality Lead development for the front end interface, own and implement the product from start to end Work closely with the founding team to develop product Drive and participate in technical discussions with other engineering team members Continuously help the team grow and improve either by mentoring new or junior members or by introducing and adopting process improvements Be responsible and responsive during on-call duty, with strong ability to debug and troubleshoot production issues, monitor the performance of the live apps and continuously improve them on both code and experience level Requirements: 4+ years of experience in mobile development (Dart, React Native, Android, iOS, or other mobile stack) Bachelors’ degree in Computer Science, Software Engineering or equivalent from a reputable university Strong CS fundamentals (with competencies in algorithms and data structures) Experience in building apps in Flutter and ReactNative preferred Experience in using Firebase preferred Demonstrable ability of having led development teams Strong analytical capabilities and ability to simplify code Excellent understanding of software engineering concepts, design patterns, and algorithms Experience in writing maintainable and testable code, including API design, unit testing and UI testing techniques Comfortable working up and down the technology stack Curiosity to explore creative solutions and try new things",
            "infoSource": "Innovix",
            "postDate": "About 1 hour ago",
            "crawlerCreateDate": "1616683883411"
        },
        {
            "link": "https://sg.jobsdb.com/job/Mobile-Developer-a3ad232168d2b275fcca18d6bda4735c?from_url=https%3A%2F%2Fsg.jobsdb.com%2Fj%3Fa%3D24h%26jt%3D3%26l%3DSingapore%26q%3Dfront%2Bend%2Bdeveloper%26sp%3Dfacet_listed_date%26p%3D2&sfjt=3&sl=Singapore&sol_srt=5e889712-4037-4e2c-8360-cb73bac41bdc&sp=serp&sponsored=false&sq=front+end+developer&sr=14&tk=i3TsKp8edP0sc960bUBp-crXvhUkylKMdgHcTXXHy",
            "title": "Full stack Mobile Developer ( Financial Institution  )",
            "location": "Central Singapore",
            "company": "Cornerstone Global Partners",
            "salary": "",
            "description": " OUR CLIENT PROFILE OUR CLIENT is one of the top financial institution based in Hong Kong. JOB OVERVIEW :This role is part of the regional innovation center which leverages the latest advances in tech and start-up ecosystem to deliver on digital strategy pillars to build products, apps, clients, and managed services to drive business KPIs and customer experience. The team builds new apps, services and features to drive business value. KEY ACCOUNTAIBILITIES • Become a domain area expert in consumer mobile apps for our client• Manage cross functional stakeholders across Countries and Group C-Suite Executives• Influence decision making while building the products, apps, and solutions, lead external development, operations, and product teams, and ensure effective project execution across-our client functions in Group and Countries• Knowledge transfer on product development and architectural design guidance to local development and application teams and provide guidance across teams• Architect design of complex multi-system solutions and services• Design, develop, test, and deploy next-generation mobile native apps, clients and services• Mobile, web and server-side development• Plan and document technical specifications for features or system design• Work closely with product owner and UX/UI designer to build features that delight our customers• Make data driven decisions• Manage cross-regional project priorities, deadlines, and deliverables• Deliver solutions that will be used across multiple platforms and languages NEED TO DOKEY PERFORMANCE INDICATORS • Products developed on time, quality, and in scalable approach.• Products architecture is of high quality and clear to the markets.• Increase in consistency between markets• Reduction in Vendor Dependency EXTERNAL & INTERNAL CONTACTS • Influence decision making while building the products, apps, and solutions, lead external development, operations, and product teams, and ensure effective project execution across functions in Group and Countries• Cross-team collaboration and project leadership through product/apps full lifecycle• Collaborate with start-ups, tech giants, and other ecosystem organizations to ensure differentiation, speed and customer experience  DECISION MAKING • Review and approve design architecture proposed by development team• Manage cross-regional project priorities, deadlines, and deliverables• Deliver solutions that will be used across multiple platforms and languages NEED TO KNOWQUALIFICATIONS / EXPERIENCE • Degree in engineering or equivalent practical experience• Software development experience in one or more general purpose programming languages• Startup experience preferred• Proven knowledge of industry leading frontend frameworks like React, Vue or Ember• Experience in building mobile apps using iOS OR Android, preferably Native application experience• Expertise in building secure, scalable RESTFul web services• Experience with agile development methodologies, Test Driven Development (TDD) and CI/CD• Experience leading product development teams• Experience with cloud technologies• Experience delivering multi-lingual/internationalized solutions KNOWLEDGE & TECHNICAL SKILLS • 7 years + of full stack software development experience• Familiarity with modern programming languages• Passionate about developing fast and reliable APIs• Interested in learning new coding languages• Experience in Node.JS, React JS, CSS, CSS3, JavaScript, HTML5, Ajax, JQuery required• Java, Python, AWS or GCP experiences are preferred• Objective C/Swift iOS targeted application frameworks are preferred NEED TO BE COMPETENCIES • Stay abreast on disruptive trends and new/emerging technology enablers• Self-starter   HOW TO APPLY: If you are a team player and would like to embark on this exciting challenge and most importantly, believe thatYOU CAN MAKE A DIFFERENCE, we would like to hear from you. Kindly submit your application by emailing a detailed copy of your updated Resume in MS Word Format toJonathan Ng (Reg. No.: R1332294) Email: ***********@cornerstoneglobalpartners.com Please indicate the below information in your resume: • Current & Expected Salary• Reason(s) for leaving• Notice Period / Availability to commence work We regret only short-listed candidate will be notified. All applications will be treated with the strictest confidence.By submitting any application or resume to us, you will be deemed to have read & agreed to the terms of ourPrivacy Policy, and consented to us collecting, using, retaining and disclosing your personal information toprospective employers for their consideration, and for our marketing EDMs which you may opt out byunsubscribing in the mailer. ",
            "infoSource": "Jobstreet SG",
            "postDate": "About 17 hours ago",
            "crawlerCreateDate": "1616683883798"
        },
        {
            "link": "https://sg.jobsdb.com/job/Application-Developer-7fdcd85eec925a9c58a3dfcee2d1b22a?from_url=https%3A%2F%2Fsg.jobsdb.com%2Fj%3Fa%3D24h%26jt%3D3%26l%3DSingapore%26q%3Dfront%2Bend%2Bdeveloper%26sp%3Dfacet_listed_date%26p%3D2&sfjt=3&sl=Singapore&sol_srt=5e889712-4037-4e2c-8360-cb73bac41bdc&sp=serp&sponsored=false&sq=front+end+developer&sr=15&tk=i3TsKp8edP0sc960bUBp-crXvhUkylKMdgHcTXXHy",
            "title": "Application Developer – MES (Camstar/Camline)",
            "location": "Paya Lebar",
            "company": "PERCEPT SOLUTIONS PTE. LTD.",
            "salary": "$4,500 - $6,000 per month",
            "description": "Roles & Responsibilities  Responsible for .Net / Java development to support MES applications  Evaluate and response to user Service Request for businees need either driven from Customer, Quality and Productivity. Define the catogories and urgency.  Provide system solution for business requirments and get sign-off from business owners  Translate business needs into system design and technical specifications  Prepare test cases and conduct Unit Test, SIT and UAT  Ensure project tasks are completed within defined timeline  Provide project base development & support  Provide daily system support activities for 24x7 operation, do Issue tracking, escalation and resolution  Develop and support MES Shipping Application  Develop and support interfaces with other applications such as CIM, B2B, SAP  To champion and/or lead on project in finding and implement resolution for system issues and improvements  Strong .Net, visual studio skills or Java with minimum 6 years experience  Strong in SQL, PL/SQL skills  Knowledgeable in WCF/WPF and MVC  To apply please click the Apply button or send us your updated profile to *******@percept-solutions.com EA Licence No.:18S9405 / EA Reg. No.:R1330864 Requirements",
            "infoSource": "Mycareersfuture SG",
            "postDate": "About 5 hours ago",
            "crawlerCreateDate": "1616683884174"
        },
        {
            "link": "https://sg.jobsdb.com/job/Specialist-de3eeb7440954d2628dafb4781cc1a2b?from_url=https%3A%2F%2Fsg.jobsdb.com%2Fj%3Fa%3D24h%26jt%3D3%26l%3DSingapore%26q%3Dfront%2Bend%2Bdeveloper%26sp%3Dfacet_listed_date%26p%3D2&sfjt=3&sl=Singapore&sol_srt=5e889712-4037-4e2c-8360-cb73bac41bdc&sp=serp&sponsored=false&sq=front+end+developer&sr=16&tk=i3TsKp8edP0sc960bUBp-crXvhUkylKMdgHcTXXHy",
            "title": "Specialist, Application Developer, Group Consumer Banking and Big Data Analytics Technology, Technology and Operations - (WD20207)",
            "location": "Singapore",
            "company": "DBS Bank Ltd",
            "salary": "",
            "description": "Business Function Group Technology and Operations (T&O) enables and empowers the bank with an efficient, nimble and resilient infrastructure through a strategic focus on productivity, quality & control, technology, people capability and innovation. In Group T&O, we manage the majority of the Bank's operational processes and inspire to delight our business partners through our multiple banking delivery channels. DBS Consumer Banking and Group Technology is looking for passionate Development Engineers to work on our in-house customer facing channels' applications for crafting and assembling our next generation consumer experiences. If you are the kind of engineer who is passionate about bringing great experiences to life and love working in a collaborative environment with your product and experiences, then we want to talk to you. Responsibilities  Develop high-volume, low-latency applications for mission-critical systems and delivering high-availability and performance Develop well designed, efficient, testable and high-quality code Provide expertise to identify and translate system requirements into software design artefacts. Prepare and produce releases of software components Responsible for the change in delivery and deployment strategy for all applications to a total replacement for applications at the end of their technology or functionality lifecycle Provide technical input during the business development life cycle. Participate in experimentation to assess new solution/application paths. Identify challenges to help the development of formalized solution methodologies. Interface and coordinate tasks with internal and external technical resources. Collaborate to provision estimates, develop overall implementation solution/application plan, and serve as a lead as required, to implement the installation, customization, and integration efforts. Actively contribute to the quality assurance for services within the solution/application area. Responsible for the application stability  Requirements  Bachelor's degree with min. 10 years of experience in developing and supporting enterprise applications Good knowledge in banking Finance platform Experience in DevOps and agile development methodologies Hands-on experience in developing microservices using Java8, Springboot, Spring Cloud Hands-on experience in developing frontend applications using Angular and Reactjs Hands-on experience in MySQL and Mariadb Experience in CI-CD tools like Bitbucket Jenkins, Nexus, JIRA, confluence Experience in TWS and shell scripting Able to manage business and provide timely updates on issues and resolutions Able to do capacity management and suggest on the capacity requirements Self-starter with the ability to develop resilient application A team player with excellent communication and interpersonal skills  Apply Now  We offer a competitive salary and benefits package and the professional advantages of a dynamic environment that supports your development and recognises your achievements.  ",
            "infoSource": "Jobstreet SG",
            "postDate": "About 17 hours ago",
            "crawlerCreateDate": "1616683884553"
        },
        {
            "link": "https://sg.jobsdb.com/job/Front-Office-Java-Developer-1bdf2bb466321d4d600f0037efc91aa6?from_url=https%3A%2F%2Fsg.jobsdb.com%2Fj%3Fa%3D24h%26jt%3D3%26l%3DSingapore%26q%3Dfront%2Bend%2Bdeveloper%26sp%3Dfacet_listed_date%26p%3D2&sfjt=3&sl=Singapore&sol_srt=5e889712-4037-4e2c-8360-cb73bac41bdc&sp=serp&sponsored=false&sq=front+end+developer&sr=17&tk=i3TsKp8edP0sc960bUBp-crXvhUkylKMdgHcTXXHy",
            "title": "Front Office Java Developer",
            "location": "Singapore",
            "company": "Beath Chapman",
            "salary": "",
            "description": "Front office Java developer (Trading Systems)   We have clients in financial industry are looking for experience core java developers with experience in multithreading, concurrency, garbage collection to work on front office platforms which including e-trading platform, pricing system, trading booking system, market connectivity and etc. The team runs in agile, and you will be the suitable person if you are keen to be a technical hands-on individual contributor to drive the end to end processes in the development life cycle. My clients are more than welcome to meet technical candidates in all industries who contain the skillset in the matching tech stacks.  Key Accountabilities & Responsibilities: - Ensure a robust high-performance pricing/ trading/ booking systems that follows best practice in terms of architecture, configuration and capacity planning. - Identify areas of improvement and performance tuning to eliminate any bottlenecks - Experience in programming using lock free and no object creation kind of design paradigms - Full testing of new versions of software (including Unit, Regression and SI), conducting test plans, analysing results and drawing conclusions with the quant representatives. - To work with Financial Engineers, Business representatives and Business Analysts to understand the business needs and design potential solutions. - Provide 3rd Line support to existing systems to resolve problems, educate 1st/2nd Line RTB and continually improve the functionality and service levels to the business.  Requirements:  - Ability to multi-task and work under pressure - Analytical / Logical mindset - Comp Science degree - Take ownership, help specify and deliver large scale projects and work under own initiative. - Detailed knowledge of Core Java and implementations using low latency related design approaches - Minimum 5 years of experience developing multi-threaded / concurrency applications, including code analysis and performance tuning / profiling of real-time, high-volume, low-latency systems - Knowledge in MDP, aggregators, Algorithmic Trading etc - Capacity to take complex issues and explain them clearly and concisely to a wide audience. - Excellent communicator, able to work effectively with senior traders and other developers. - Understanding of eTrading generically - Understanding of workflows, key controls and related operational risk exposure. - Agile Development Practices ( TDD, BDD, Automated Builds, Continuous Integration) / Scrum Methodologies.EA Personnel No. R1872651BeathChapman Pte LtdEA Licence: 16S8112",
            "infoSource": "Jobstreet SG",
            "postDate": "About 17 hours ago",
            "crawlerCreateDate": "1616683884903"
        },
        {
            "link": "https://sg.jobsdb.com/job/Junior-IT-Software-Developer-f4d4e6c986422ddc166997557b8289ed?from_url=https%3A%2F%2Fsg.jobsdb.com%2Fj%3Fa%3D24h%26jt%3D3%26l%3DSingapore%26q%3Dfront%2Bend%2Bdeveloper%26sp%3Dfacet_listed_date%26p%3D2&sfjt=3&sl=Singapore&sol_srt=5e889712-4037-4e2c-8360-cb73bac41bdc&sp=serp&sponsored=false&sq=front+end+developer&sr=18&tk=i3TsKp8edP0sc960bUBp-crXvhUkylKMdgHcTXXHy",
            "title": "Graduate Trainee - Junior IT Software Developer (up to $3.3k)",
            "location": "Changi",
            "company": "OPTIMUM SOLUTIONS (SINGAPORE) PTE LTD",
            "salary": "$2,800 - $3,300 per month",
            "description": "Roles & ResponsibilitiesOptimum Solutions (Company Registration Number: 199700895N) Employer : Optimum Solutions Pte. Singapore Exp : 0-3 years Requirement : IT Application Analyst/Software Engineer (Freshers can apply) Qualifications and Profile : Applicants from ITs Graduates -Universities/diploma/Poly/Fresh Graduates applicants. Role as below : IT Application Analyst/Software Engineer Freshers, streams like Any ITs, Computer Science, mathematics are welcome as long as interested to be a Developer/Software Engineer role. 1. Any IT disciplines like - Core Java, HTML, CSS, JAVA,J2ee, Javascript, UI (Javacripts, Reactjs, AngularJS), PHP, C++, C#, .NET, dotnet,Python...etc Candidates ideally should know some knowledge/experience in programming languages. Any IT course and have done some programming on C#,++,Java,JavaScript,Python,perl,SQL,j2ee,HTML,CSS,Dotnet, .net etc.... Job Scope & Benefits:   Full time Training will be provided at Optimum office, Changi Business Park (3 months)- FREE  Medical coverage & benefits  Exciting training (live use cases, gaming and more....  Full time employment with Optimum solutions, SG  Full time salary from day one (from Training)  What happens after the On Job Training?   After completion of training, you will get a chance to work with our banking team. You will have the opportunity to work on the full software development cycle from interpreting requirements through to design, implementation, testing and release.  Requirements",
            "infoSource": "Mycareersfuture SG",
            "postDate": "About 5 hours ago",
            "crawlerCreateDate": "1616683885432"
        },
        {
            "link": "https://sg.jobsdb.com/job/Software-Developer-7bbae0296fe99b0a5ff638cda2b0fd7d?from_url=https%3A%2F%2Fsg.jobsdb.com%2Fj%3Fa%3D24h%26jt%3D3%26l%3DSingapore%26q%3Dfront%2Bend%2Bdeveloper%26sp%3Dfacet_listed_date%26p%3D2&sfjt=3&sl=Singapore&sol_srt=5e889712-4037-4e2c-8360-cb73bac41bdc&sp=serp&sponsored=false&sq=front+end+developer&sr=19&tk=i3TsKp8edP0sc960bUBp-crXvhUkylKMdgHcTXXHy",
            "title": "Software Developer (Java/.Net/ Central)",
            "location": "Singapore",
            "company": "TRUST RECRUIT PTE. LTD.",
            "salary": "",
            "description": "Responsibilities  Develop web and mobile applications following development best practices, ensuring solution performance and user adoption Develop integrations with external systems according to the defined architecture guidelines Finish all assigned tasks with quality within the defined timebox Conducts unit testing and integration testing, executing the necessary bug fixing  Requirements  Proficient in .NET or Java, and database modeling and SQL Proficient in front-end web technologies like JavaScript, CSS Experience developing apps on OutSystems will be an advantage Willing to pick up new technologies quickly and independently Possess at least a Diploma in IT, or a related field  HOW TO APPLY:Interested applicants, kindly send your resume in MS WORD format to ****@trustrecruit.com.sg or please click on “Apply Now” and provide the below details in your resume.1. Reasons for leaving ALL your employment2. Current and/or last drawn monthly salary (please provide breakdown)3. Expected monthly salary4. AvailabilityWe regret only shortlisted candidates will be notified.Important Note: Trust Recruit Pte Ltd is committed to safeguarding your personal data in accordance with the Personal Data Protection Act (PDPA).Please read our privacy statement on our corporate website www.trustrecruit.com.sg.Trust Recruit Pte LtdEA License No: 19C9950EA Personnel: Wang Chun JinEA Personnel Reg No: R1871708",
            "infoSource": "Jobstreet SG",
            "postDate": "About 17 hours ago",
            "crawlerCreateDate": "1616683885953"
        },
        {
            "link": "https://sg.jobsdb.com/job/Backend-Developer-cafc2e9a6c27e000b3a68baec72f0be8?from_url=https%3A%2F%2Fsg.jobsdb.com%2Fj%3Fa%3D24h%26jt%3D3%26l%3DSingapore%26q%3Dfront%2Bend%2Bdeveloper%26sp%3Dfacet_listed_date%26p%3D2&sfjt=3&sl=Singapore&sol_srt=5e889712-4037-4e2c-8360-cb73bac41bdc&sp=serp&sponsored=false&sq=front+end+developer&sr=20&tk=i3TsKp8edP0sc960bUBp-crXvhUkylKMdgHcTXXHy",
            "title": "Backend Developer ( Financial Institution )",
            "location": "Central Singapore",
            "company": "Cornerstone Global Partners",
            "salary": "",
            "description": " OUR CLIENT PROFILE OUR CLIENT won multiple awards and is a global innovator of technology that focuses on helping world-class clients in the financial sector to deliver market leading digital financial service experiences to their customers.  JOB OVERVIEW : THE JOB : BACKEND DEVELOPER Drive your professional growth through rising to these challenges:• DESIGN the module architecture and system philosophy for the product development• MAPPING clear and concise development workflows with the end goal of quick setup and reducing human error• CONSTANTLY review and asses design plan to ensure it evolves with the product needs as they change over time• CREATES well designed and reusable software artefacts• SUPPORT development managers throughout the development lifecycle and manage technical risks within projects• ENSURE that best practices are used across the product range• TECHNICAL ownership on design, development and system integration work for product teams• COMMUNICATES and enforces coding standards and reviews work of frontend development teams• ACTIVELY contributes to the internal knowledge base and suggests areas and solutions for internal process improvementTHE PERSON WE NEED Great skills and even greater personal qualities: • EDUCATION Degree in relevant technology-based subject from a recognized university• INDUSTRY EXPERIENCE relevant experience as Java developer, ideally within banking or software companies• TECHNICAL SKILLS 1 Java Enterprise application development experience ( Jave EE / J2EE ), with system integration experience, SOAP, REST Web Services, JPA, JMS, JAXB, JAX-RS, Knowledge of enterprise Web Application security.• TECHNICAL SKILLS 2, Relational database development (preferably on Oracle, DB/2, PostgreSQL), ORM framework and Source Control tools (Git). ETL experience is a definite advantage   HOW TO APPLY: If you are a team player and would like to embark on this exciting challenge and most importantly, believe thatYOU CAN MAKE A DIFFERENCE, we would like to hear from you. Kindly submit your application by emailing a detailed copy of your updated Resume in MS Word Format toJonathan Ng (Reg. No.: R1332294) Email: ***********@cornerstoneglobalpartners.com Please indicate the below information in your resume: • Current & Expected Salary• Reason(s) for leaving• Notice Period / Availability to commence work We regret only short-listed candidate will be notified. All applications will be treated with the strictest confidence.By submitting any application or resume to us, you will be deemed to have read & agreed to the terms of ourPrivacy Policy, and consented to us collecting, using, retaining and disclosing your personal information toprospective employers for their consideration, and for our marketing EDMs which you may opt out byunsubscribing in the mailer. ",
            "infoSource": "Jobstreet SG",
            "postDate": "About 17 hours ago",
            "crawlerCreateDate": "1616683886472"
        },
        {
            "link": "https://sg.jobsdb.com/job/rd/c89ffea725bcebb6b3f7c75297f8f5bd?sp=sserp_bottom&sponsored=true&sr=13&tk=i3TsKp8edP0sc960bUBp-crXvhUkylKMdgHcTXXHy",
            "title": "",
            "location": "",
            "company": "",
            "salary": "",
            "description": "",
            "infoSource": "",
            "postDate": "",
            "crawlerCreateDate": "1616683887223"
        },
        {
            "link": "https://sg.jobsdb.com/job/rd/f91e3e2fa678b50f6f9d48f3c7b66f05?sp=sserp_bottom&sponsored=true&sr=14&tk=i3TsKp8edP0sc960bUBp-crXvhUkylKMdgHcTXXHy",
            "title": "",
            "location": "",
            "company": "",
            "salary": "",
            "description": "",
            "infoSource": "",
            "postDate": "",
            "crawlerCreateDate": "1616683888011"
        },
        {
            "link": "https://sg.jobsdb.com/job/rd/a29ede69be984877ff3d8f92251e0fa4?sp=sserp_bottom&sponsored=true&sr=15&tk=i3TsKp8edP0sc960bUBp-crXvhUkylKMdgHcTXXHy",
            "title": "",
            "location": "",
            "company": "",
            "salary": "",
            "description": "",
            "infoSource": "",
            "postDate": "",
            "crawlerCreateDate": "1616683889200"
        },
        {
            "link": "https://sg.jobsdb.com/job/rd/c36d2ba305eba53de10b4f819dcd0cb0?sp=sserp_top&sponsored=true&sr=21&tk=2uQlA2YcPhyCUqnp9pHc-kWumC_wK2JzflqIKydor",
            "title": "",
            "location": "",
            "company": "",
            "salary": "",
            "description": "",
            "infoSource": "",
            "postDate": "",
            "crawlerCreateDate": "1616683890452"
        },
        {
            "link": "https://sg.jobsdb.com/job/rd/1a89777d67c55a48d324774662d7476c?sp=sserp_top&sponsored=true&sr=22&tk=2uQlA2YcPhyCUqnp9pHc-kWumC_wK2JzflqIKydor",
            "title": "",
            "location": "",
            "company": "",
            "salary": "",
            "description": "",
            "infoSource": "",
            "postDate": "",
            "crawlerCreateDate": "1616683891284"
        },
        {
            "link": "https://sg.jobsdb.com/job/.net-Developer-cd8dedbe9536afbd78e0283e9d828a70?from_url=https%3A%2F%2Fsg.jobsdb.com%2Fj%3Fa%3D24h%26jt%3D3%26l%3DSingapore%26q%3Dfront%2Bend%2Bdeveloper%26sp%3Dfacet_listed_date%26p%3D3&sfjt=3&sl=Singapore&sol_srt=14e89da9-4bcd-44e3-aa44-927af7103ec6&sp=serp&sponsored=false&sq=front+end+developer&sr=21&tk=2uQlA2YcPhyCUqnp9pHc-kWumC_wK2JzflqIKydor",
            "title": ".Net Developer | Yearly Contract |",
            "location": "Central Singapore",
            "company": "Capita Pte Ltd - Technology Outsourcing",
            "salary": "",
            "description": " Responsibilities Understands technical and functional design requirements Implement applications using Microsoft and development tools in N-Tier environment. Provide supports to development projects throughout the SDLC. Assists in physical and logical database design. Design and create prototypes for client engagements. Design and develop browser-based front-end applications. Coordinate and conduct unit testing, System Integration Test and User Acceptance Test. Identifies system deficiencies and recommends solutions.   Requirements At least a Bachelor's Degree in Engineering (Computer/Telecommunication), Computer Science / Information Technology or equivalent. Candidates with a relevant IT diploma may also apply. Minimum 2-3 years of relevant experience in designing, testing and implementing .NET applications, and have completed at least 1 to 2 project life cycle(s). Knowledge and strong hands on working experience in C#, .NET and MS SQL is a must. Good foundation in OO related concepts is required.   Interested candidates who wish to apply for the advertised position, please click on “Apply Now”. Alternatively, you may email us an updated copy of your resume (Attn: EMILY), We regret that only shortlisted candidates will be notified.Job Code: EMINEmail Address: ****@capitasingapore.com OR ********@capitasingapore.comCAPITA PTE LTD | EA License No : 08C2893Emily Ng Kim Yin | REG No : R1988730 ",
            "infoSource": "Jobstreet SG",
            "postDate": "About 17 hours ago",
            "crawlerCreateDate": "1616683891667"
        },
        {
            "link": "https://sg.jobsdb.com/job/Senior-App-Developer-a2404b2536d5222775ad087dab305c09?from_url=https%3A%2F%2Fsg.jobsdb.com%2Fj%3Fa%3D24h%26jt%3D3%26l%3DSingapore%26q%3Dfront%2Bend%2Bdeveloper%26sp%3Dfacet_listed_date%26p%3D3&sfjt=3&sl=Singapore&sol_srt=14e89da9-4bcd-44e3-aa44-927af7103ec6&sp=serp&sponsored=false&sq=front+end+developer&sr=22&tk=2uQlA2YcPhyCUqnp9pHc-kWumC_wK2JzflqIKydor",
            "title": "Senior App Developer (PHP,HTML/JS)",
            "location": "North East Singapore",
            "company": "Mason & Co Pte Ltd",
            "salary": "",
            "description": "Our Client is regional robo-advisor headquartered in Singapore. It is one of the earliest robo-advisors to be licensed by MAS to provide full digital investment advisory and management services to retail and corporate investors. Our client is now entrusted with hundreds of millions in asset value by thousands of retail investors and Fortune 500 MNCs. Job Description :  You will work closely with association in other business functions, including growth, Marketing, Strategy & Planning, Investment Management and other developers to; Design and create web-based application and functions Design and create efficient back-end support function for seamless investment and funding related matter Create detailed statistic report for clients Implement application front-end designs Perform upgrade and ensure security and efficiency of the system Provide back-end support for implementation of trade algorithms  What we are looking for :  Diploma (or higher) in Computer Science, Computer Engineering, Software Engineering, Mathematics/Statistics or equivalent in a recognised university Hands-on/strong experience in PHP coding Strong knowledge in SQL Ability to program in object-oriented languages: Python, web design languages: HTML, JS Someone who is passionate about technology and innovation Attention to detail and analytical mind  Interested in applying? If you have experience in SharePoint and if this resonates with you, Let’s Chat! Please email your CV to: ***************@masonac.com (including your Current and Expected salary)EA License: 19C9622/ EA Personnel: R2090991/ EA Personnel Name: Phanpaphorn Inthawong",
            "infoSource": "Jobstreet SG",
            "postDate": "About 17 hours ago",
            "crawlerCreateDate": "1616683892033"
        },
        {
            "link": "https://sg.jobsdb.com/job/URGENT-Backend-Developer-4557a79111368e3773865dc23b18326f?from_url=https%3A%2F%2Fsg.jobsdb.com%2Fj%3Fa%3D24h%26jt%3D3%26l%3DSingapore%26q%3Dfront%2Bend%2Bdeveloper%26sp%3Dfacet_listed_date%26p%3D3&sfjt=3&sl=Singapore&sol_srt=14e89da9-4bcd-44e3-aa44-927af7103ec6&sp=serp&sponsored=false&sq=front+end+developer&sr=23&tk=2uQlA2YcPhyCUqnp9pHc-kWumC_wK2JzflqIKydor",
            "title": "URGENT Backend Developer (Web) - Java Up to $5K",
            "location": "North East Singapore",
            "company": "Mason & Co Pte Ltd",
            "salary": "",
            "description": "Our Client is a globally trusted leader in data security and automation, working in partnership with international banks, businesses and governments to advance the future of a secure world. Key Responsibilities  Work on Java Project in an Agile environment and TDD practice. (The Projects involve building mini Java Processes deployed in a BPMN process engine that acts as a Gateway) Build POC prototypes individually and quickly at tech scoping stage of projects Work with other developers during implementation period to meet customer requirement specifications Create and maintain a robust framework to support the apps/web Build front-end interface with focus on usability features, as well as back-end platform Optimization of the apps/web Manage to work on more than one project concurrently Work closely with pre-sales team to translate requirements ideas into products and solutions Deliver across the entire app life cycle (concept, design, build, deploy, test, release to app stores and support)  Job Requirements  Diploma or Degree in IT or Relevant Disciplines 2-3 years of experience in Java (J2EE) Spring Boot development for web service Knowledge of FinTech technologies (such as OCR, Biometrics Authentication) is a plus  Interested in applying? If you have experience in SharePoint and if this resonates with you, Let’s Chat!Please email your CV to: ***************@masonac.comEA License: 19C9622/ EA Personnel: R2090991/ EA Personnel Name: Phanpaphorn Inthawong",
            "infoSource": "Jobstreet SG",
            "postDate": "About 17 hours ago",
            "crawlerCreateDate": "1616683892419"
        },
        {
            "link": "https://sg.jobsdb.com/job/Software-Engineer-96cbc13284b96f9fdae7a3632d98a919?from_url=https%3A%2F%2Fsg.jobsdb.com%2Fj%3Fa%3D24h%26jt%3D3%26l%3DSingapore%26q%3Dfront%2Bend%2Bdeveloper%26sp%3Dfacet_listed_date%26p%3D3&sfjt=3&sl=Singapore&sol_srt=14e89da9-4bcd-44e3-aa44-927af7103ec6&sp=serp&sponsored=false&sq=front+end+developer&sr=24&tk=2uQlA2YcPhyCUqnp9pHc-kWumC_wK2JzflqIKydor",
            "title": "Software Engineer",
            "location": "Central Singapore",
            "company": "Cognixus Technologies Sdn Bhd",
            "salary": "",
            "description": "Responsibilities:  Lead designs of major software components, systems, and features. Design, develop, test, deploy, maintain and improve software. Manage individual projects priorities, deadlines and deliverables with your technical expertise. Mentor and train other team members on design techniques, software best practices and cultivate innovation.  Requirements:   Degrees (BS, Master’s, PhD) in Computer Science, similar technical field of study or equivalent practical experience.  Software development experience in one or more general purpose programming languages, including but not limited to: Java, C/C++, C#, Objective C, Python, JavaScript.  Experience working with two or more from the following: web application development, Unix/Linux environments, mobile application development, distributed and parallel systems, machine learning, information retrieval, networking, developing large software systems, and/or security software development. 3 - 5 years of experience in end to end large scale system development, from design, implementation, testing to deployment. Prefer experiences in both system backend and frontend. Working proficiency and communication skills in verbal and written English.  ",
            "infoSource": "Jobstreet SG",
            "postDate": "About 18 hours ago",
            "crawlerCreateDate": "1616683892774"
        },
        {
            "link": "https://sg.jobsdb.com/job/Software-Application-Specialist-a4157db38e1b073210541d5a36cc6197?from_url=https%3A%2F%2Fsg.jobsdb.com%2Fj%3Fa%3D24h%26jt%3D3%26l%3DSingapore%26q%3Dfront%2Bend%2Bdeveloper%26sp%3Dfacet_listed_date%26p%3D3&sfjt=3&sl=Singapore&sol_srt=14e89da9-4bcd-44e3-aa44-927af7103ec6&sp=serp&sponsored=false&sq=front+end+developer&sr=25&tk=2uQlA2YcPhyCUqnp9pHc-kWumC_wK2JzflqIKydor",
            "title": "Software Application Specialist (Web applications) - Central, Banking",
            "location": "Central Singapore",
            "company": "GMP Technologies - IT",
            "salary": "",
            "description": " Responsibilities: Web and API development Ensure all the tasks given are completed within timeline with quality Ensure proper code-based documentation in place  Requirements: Diploma / Degree in Computer Science or related fields. Experience in PHP, JavaScript, RESTer development. Open to consider candidate (s) experienced with other web development technologies. In-depth knowledge of core technologies like CodeIgniter and Oracle SQL Able to complete assigned tasks with minimal supervision. Strong interest in development.  Additional info: This role is on 12 months contract, convertiable to perm based on individual performances. Working location is in CBD area Working hours, Mondays to Fridays 8.45am to 6pm. To apply, please visit www.gmprecruit.com and search for Job Reference: 17813To learn more about this opportunity, please contact Yingying at ************@gmprecruit.com We regret that only shortlisted candidates will be notified.GMP Technologies (S) Pte Ltd   |   EA Licence: 11C3793   |   EA Personnel: Lai Yingying   |   Registration No: R1110239",
            "infoSource": "Jobstreet SG",
            "postDate": "About 17 hours ago",
            "crawlerCreateDate": "1616683893195"
        },
        {
            "link": "https://sg.jobsdb.com/job/Jave-Developer-ce786fe6ab4fb330303f24aad483c045?from_url=https%3A%2F%2Fsg.jobsdb.com%2Fj%3Fa%3D24h%26jt%3D3%26l%3DSingapore%26q%3Dfront%2Bend%2Bdeveloper%26sp%3Dfacet_listed_date%26p%3D3&sfjt=3&sl=Singapore&sol_srt=14e89da9-4bcd-44e3-aa44-927af7103ec6&sp=serp&sponsored=false&sq=front+end+developer&sr=26&tk=2uQlA2YcPhyCUqnp9pHc-kWumC_wK2JzflqIKydor",
            "title": "Jave Developer",
            "location": "East Singapore",
            "company": "Avensys Consulting Pte Ltd",
            "salary": "",
            "description": "Java DeveloperAvensys is a reputed global IT professional services company headquartered in Singapore. Our service spectrum includes enterprise solution consulting, business intelligence, business process automation and managed services. Given our decade of success we have evolved to become one of the top trusted providers in Singapore and service a client base across banking and financial services, insurance, information technology, healthcare, retail and supply chain.We are currently looking to hire Java Developer who has proven track record in IT Industry. This is an exciting opportunity to expand your skill set, achieve job satisfaction and work-life balance. More details as below. Java Developer Roles and Responsibilities:• Lead and manage a small team of developers to deliver the modules to develop web-based application systems.• Able to lead and drive the requirements gathering process.• Participate in the design and development of web applications based on Ecquaria’s product (J2EE-based).• Lead and manage the user acceptance testing process.• Implement, customize, test, document and maintain software applications.• Ensure that the modules delivered are according to the specifications and are of high quality.Job requirements: • Java programming experience at the working level is a MUST. (Core Java, J2EE, etc.)• Must have functional/business experience. (i.e. gather requirements directly with users)• Must have hands-on experience in completing at least 1 Full SDLC.• Must have SI environment experience. (e.g. NCS, Crimson Logic, Accenture, etc.)• A Degree/Diploma in Computer Science with at least 3 years' software development experience in Internet technology in Win NT, UNIX or LINUX platform• Technical skills include proven object-oriented programming experience with Java and C++ together with extensive RDBMS through JDBC• Experience in J2EE, Web Services and XML will be advantageous• Experience in Elixir reporting solutions will be advantageous• Very strong in SQL• Data analysis skill will be a plus WHAT’S ON OFFER: You will be remunerated with an excellent base salary and entitled to attractive company benefits. Additionally, you will get the opportunity to enjoy a fun and collaborative work environment, alongside a strong career progression To submit your application, please apply online or email your UPDATED CV in Microsoft Word format to *****@aven-sys.com Your interest will be treated with strict confidentiality.  CONSULTANT DETAILS:Consultant Name   : Seema Verma  Avensys Consulting Pte Ltd EA Licence 12C5759  Privacy Statement: Data collected will be used for recruitment purposes only. Personal data provided will be used strictly in accordance with the relevant data protection law and Avensys' privacy policy.   ",
            "infoSource": "Jobstreet SG",
            "postDate": "About 18 hours ago",
            "crawlerCreateDate": "1616683893589"
        },
        {
            "link": "https://sg.jobsdb.com/job/Application-Developer-b19f70908dc47cd711fce5b0926b4fbc?from_url=https%3A%2F%2Fsg.jobsdb.com%2Fj%3Fa%3D24h%26jt%3D3%26l%3DSingapore%26q%3Dfront%2Bend%2Bdeveloper%26sp%3Dfacet_listed_date%26p%3D3&sfjt=3&sl=Singapore&sol_srt=14e89da9-4bcd-44e3-aa44-927af7103ec6&sp=serp&sponsored=false&sq=front+end+developer&sr=27&tk=2uQlA2YcPhyCUqnp9pHc-kWumC_wK2JzflqIKydor",
            "title": "Application Developer (Magento)",
            "location": "Singapore",
            "company": "HKBN JOS (Singapore) Pte Ltd",
            "salary": "",
            "description": "Responsibilities  Review source code developed by team members, provide comments / suggestions for correction & improvement where necessary. Develop new applications based on given requirements and specifications. Quick pick-up & apply languages and tools to keep pace with the Agile and technological trend that makes the development cycle efficient and productive. Maintain and enhance existing applications. Apply updates to Magento installation. Install security patches. Implement changes and develop new functionality. Support live website activities. Design and provide detailed write-up on solutions to meet functional requirements. Create test plans, scenarios, and scripts in accordance to use cases. Perform unit testing for applications. Any other duties as and when assigned.  Competencies / Technologies  Strong OOP and MVC knowledge Well Versed in PHP and JavaScript Extensive LESS or CSS knowledge Magento certification is a plus  Requirements  Candidate must possess at least a Diploma or Degree in Computer Science/Information Technology or equivalent. At least one (1) to three (3) years of working experience in development using Technologies above. Need to know how to write code and what good quality code looks like. Good problem-solving skills. Able to work independently and with a team. Able to identify and recommend best practices. Strong time management skills with regular reporting.  Strong command of English language for spoken and written communications. ",
            "infoSource": "Jobstreet SG",
            "postDate": "About 17 hours ago",
            "crawlerCreateDate": "1616683893978"
        },
        {
            "link": "https://sg.jobsdb.com/job/IT-Programmer-d54479c2b83c712ec1ccd8608075e6e7?from_url=https%3A%2F%2Fsg.jobsdb.com%2Fj%3Fa%3D24h%26jt%3D3%26l%3DSingapore%26q%3Dfront%2Bend%2Bdeveloper%26sp%3Dfacet_listed_date%26p%3D3&sfjt=3&sl=Singapore&sol_srt=14e89da9-4bcd-44e3-aa44-927af7103ec6&sp=serp&sponsored=false&sq=front+end+developer&sr=28&tk=2uQlA2YcPhyCUqnp9pHc-kWumC_wK2JzflqIKydor",
            "title": "IT Programmer (MNC / 5 days) / $5K-$6K + Good Bonus",
            "location": "West Singapore",
            "company": "HKM HR Management Pte. Ltd.",
            "salary": "$5,000 - $6,000 per month",
            "description": "  ☑ MNC - Manufacturing Firm☑ Basic Salary : $5000- $6000 + AWS + VB ☑ 5 days work week Responsibilities:  Develop and maintain the company database systems. Develop and maintain intranet web pages and e-Systems of the company. Develop and maintain applications for the business operations. Involved in user requirement study, system design, system development and user acceptance test for in-house application development life cycle. Involved in user requirement study, application customization and user acceptance test for off-the-shelf software implementation. Plan the projects timeline and monitor the progress closely. Provide application support and diagnostics. Research & explore new technologies. Assist in / conduct training to co-workers and end users. Prepare and maintain all necessary documentations. Assist in IT procurement process. Prepare cost comparison analysis and justification. Coordinate with software vendors / suppliers to ensure the delivery lead time and verify the quality of work. Review and propose enhancement for existing applications. Manage all IT application projects and be proactive in IT related matters Manage and maintain the company ERP system (Microsoft Dynamics Navision). Review, propose and manage enhancements for ERP system (Microsoft Dynamics Navision).  Requirements:  Degree in Computer Science / Computer Engineering or any related field. Min 3-5 years of relevant working experience Experience in Desktop  application programming (e.g. using C#) Experience in Web application development (front end and back end) Experience in SQL server database table design Experience in SQL server query language and stored procedures Able to managed projects on his own, worked with / liaise with users on the  requirements   HOW TO APPLY : Interested candidates, please submit your resume by clicking on “Apply Now” or directly send to ****@hkmsvs.com / contact 6566 5498 for more details. Please provide following information in the resume for immediate processing 1) Reasons for leaving current and/or last employment2) Last drawn and/or current salary3) Expected salary4) Date of availability and/or Notice Period All applications will be treated in strictest confidence and only shortlisted candidates will be notified JoniEA License No : 03C5391EA Reg No : R1106641 ",
            "infoSource": "Jobstreet SG",
            "postDate": "About 17 hours ago",
            "crawlerCreateDate": "1616683894485"
        },
        {
            "link": "https://sg.jobsdb.com/job/Contract-Software-Engineer-d6bf62ac3ae307827a24e0188710e062?from_url=https%3A%2F%2Fsg.jobsdb.com%2Fj%3Fa%3D24h%26jt%3D3%26l%3DSingapore%26q%3Dfront%2Bend%2Bdeveloper%26sp%3Dfacet_listed_date%26p%3D3&sfjt=3&sl=Singapore&sol_srt=14e89da9-4bcd-44e3-aa44-927af7103ec6&sp=serp&sponsored=false&sq=front+end+developer&sr=29&tk=2uQlA2YcPhyCUqnp9pHc-kWumC_wK2JzflqIKydor",
            "title": "Contract Software Engineer",
            "location": "East Singapore",
            "company": "Certis Group",
            "salary": "",
            "description": "Responsibilities: • Engage in the development, application support testing and implementation of new systems, change request and solutions;• Work with software architect to understand the overall technical architecture and how each feature is implemented. To design, develop, and implement secure, reliable and efficient enterprise web applications• Perform design, implementation and maintenance of single product modules/sub-systems or on lower level issues of multiple products;• Responsible for executing defined processes and solutions, such as compliance to escalation procedures and customer support processes;• Retrofit code fixes for base issues into customer environment;• Utilize creative problem-solving skills to assist in technical troubleshooting and analysis for customer reported issues;• Work effectively in an Agile environment;• Establishes technical proficiency in design, implementation and unit testing. Requirements: • Bachelor’s degree in computer science or relevant field. • Having knowledge of .Net Core technologies, SQL server, tracing and understanding of the logs;• A strong understanding of web fundamentals, including HTML/CCS• Experience with web programming and scripting languages, including JavaScript, ReactJS, Java etc• Must have hands-on experience and enjoys programming• Solid experience with DevOps skills such as CI/CD, Docker, Kubernetes etc• Good to have experience in IOS/ Android Kotlin Mobile Development• A broad technical curiosity and proven technical understanding;• Database/datastore experience: RDBMS (e,g., SQL Server, MySQL, Postgresql), cache store (e.g., redis, memcached)• Microservice Architecture• Experience working on the Cloud• AWS stack: rds, sns/sqs, redis/memcached, ec2, codebuild• Familiar with performance tuning of Web Server, Massive concurrency handling and caching mechanism• Knowledge of H264/H265 & MPEG4 video standards;• Ability to work independently and as a team member;• Must have experience with .NET, C# programming, Angular 4+, ASP.Net Core, MVC, Web API, Entity Framework, JQuery, CSS/CSS3, GIT. ",
            "infoSource": "Jobstreet SG",
            "postDate": "About 17 hours ago",
            "crawlerCreateDate": "1616683894842"
        },
        {
            "link": "https://sg.jobsdb.com/job/Frontend-Engineer-850be06da6ef4c2d9f9a76cf99dcd49f?from_url=https%3A%2F%2Fsg.jobsdb.com%2Fj%3Fa%3D24h%26jt%3D3%26l%3DSingapore%26q%3Dfront%2Bend%2Bdeveloper%26sp%3Dfacet_listed_date%26p%3D3&sfjt=3&sl=Singapore&sol_srt=14e89da9-4bcd-44e3-aa44-927af7103ec6&sp=serp&sponsored=false&sq=front+end+developer&sr=30&tk=2uQlA2YcPhyCUqnp9pHc-kWumC_wK2JzflqIKydor",
            "title": "Frontend Engineer",
            "location": "Central Singapore",
            "company": "TAIGER SINGAPORE PTE. LTD.",
            "salary": "$3,900 - $5,300 per month",
            "description": "Roles & ResponsibilitiesABOUT TAIGER Headquartered in Singapore, TAIGER is a visionary AI company with a mission to free the human intellect. They automate mission-critical and cognitive work using Semantic and Natural Language Technologies to empower enterprises to optimise operational inefficiencies, drive business value and unlock better ROI. TAIGER’s technology is accredited by Singapore’s Infocomm Media Development Authority (IMDA) and has won numerous industry awards and recognition including Gartner’s Hype Cycle for Natural Language Technology and Ontology in 2020 and IDC innovator in AI in 2019. TAIGER is recognized as a Gartner Cool Vendor. Find out more about us at www.taiger.com and www.linkedin.com/company/taiger FRONTEND ENGINEER We are building a team passionate about cutting-edge AI technology and the potential of TAIGER. You should be genuinely excited by the prospect of building new functions and leading a passionate team of high performers as TAIGER expands in scale; and be motivated by the proposition of your contributions having a real impact on TAIGER’s growth. RESPONSIBILITIES   Use industry web standards to build solutions using semantic mark-up, templates (Handlebars) and SASS.  Develop front-end pages demonstrating expertise in fundamental visual and interactive design disciplines.  Dynamically create, modify and style page elements and interplay between JavaScript and HTML & CSS.  Accomplish innovative interactions using JavaScript programming.  Create consistent projects using strong understanding of all major browsers.  Design frameworks for user apps creations and assist in development of applications for both clients and internal functions.  REQUIREMENTS   MSc/BSc in Computer Science, Engineering, or other related disciplines.  1-2 years of relevant experience in front-end development  Background experience in professional software development with front end web development and experience in building user interfaces (JavaScript, HTML5, CSS3, AJAX). Proficiency in AngularJS 1.x with deep understanding and experience in designing and utilising RESTful APIs.  Strong knowledge of web development tools and programming languages.  Proactivity in suggesting solutions and improvements.  Work comfortably with source version control software and package managers, and build-tools (Git, NPM, Gulp, Grunt, Webpack).  Experience in any of the following - Vue.js, Angular, or React.  Experience in building web applications with ECMAScript 6+ and working with backend built in Java EE and Spring Framework.  Required to be on-site/ on-premise at times.  *TAIGER does not engage any recruitment agencies for recruitment of talents into our company. All job applications should be submitted directly to TAIGER. Requirements",
            "infoSource": "Mycareersfuture SG",
            "postDate": "About 5 hours ago",
            "crawlerCreateDate": "1616683895228"
        },
        {
            "link": "https://sg.jobsdb.com/job/rd/45eb3b80714703d1fe816e9c62743da8?sp=sserp_bottom&sponsored=true&sr=23&tk=2uQlA2YcPhyCUqnp9pHc-kWumC_wK2JzflqIKydor",
            "title": "",
            "location": "",
            "company": "",
            "salary": "",
            "description": "",
            "infoSource": "",
            "postDate": "",
            "crawlerCreateDate": "1616683895963"
        },
        {
            "link": "https://sg.jobsdb.com/job/rd/b56ca8325e1b71790de3b9a4b85430f6?sp=sserp_bottom&sponsored=true&sr=24&tk=2uQlA2YcPhyCUqnp9pHc-kWumC_wK2JzflqIKydor",
            "title": "",
            "location": "",
            "company": "",
            "salary": "",
            "description": "",
            "infoSource": "",
            "postDate": "",
            "crawlerCreateDate": "1616683896826"
        },
        {
            "link": "https://sg.jobsdb.com/job/rd/5d31af996eabc27c823819a51a785478?sp=sserp_bottom&sponsored=true&sr=25&tk=2uQlA2YcPhyCUqnp9pHc-kWumC_wK2JzflqIKydor",
            "title": "",
            "location": "",
            "company": "",
            "salary": "",
            "description": "",
            "infoSource": "",
            "postDate": "",
            "crawlerCreateDate": "1616683897376"
        },
        {
            "link": "https://sg.jobsdb.com/job/rd/10e0ddbcfb2e5cf60459487856433d86?sp=sserp_top&sponsored=true&sr=31&tk=xNMrYXv9FREVS8jUdxcC-EEjORNfrgmu_06sMt9O7",
            "title": "",
            "location": "",
            "company": "",
            "salary": "",
            "description": "",
            "infoSource": "",
            "postDate": "",
            "crawlerCreateDate": "1616683898081"
        },
        {
            "link": "https://sg.jobsdb.com/job/rd/03d260ff772e3179dd850d5abd4d3c24?sp=sserp_top&sponsored=true&sr=32&tk=xNMrYXv9FREVS8jUdxcC-EEjORNfrgmu_06sMt9O7",
            "title": "",
            "location": "",
            "company": "",
            "salary": "",
            "description": "",
            "infoSource": "",
            "postDate": "",
            "crawlerCreateDate": "1616683898642"
        },
        {
            "link": "https://sg.jobsdb.com/job/Software-Developer-91f010389bb4c2f6d82fb3f18c4ea0d2?from_url=https%3A%2F%2Fsg.jobsdb.com%2Fj%3Fa%3D24h%26jt%3D3%26l%3DSingapore%26q%3Dfront%2Bend%2Bdeveloper%26sp%3Dfacet_listed_date%26p%3D4&sfjt=3&sl=Singapore&sol_srt=9fd85255-1372-41ff-8b7e-623af77fbfa8&sp=serp&sponsored=false&sq=front+end+developer&sr=31&tk=xNMrYXv9FREVS8jUdxcC-EEjORNfrgmu_06sMt9O7",
            "title": "Software Developer",
            "location": "Toa Payoh",
            "company": "Fleischhacker LLP",
            "salary": "",
            "description": "Job Responsibilities:  Participate in requirements analysis; Collaborate with development teams to produce Windows-based applications; Write clean, scalable codes using .NET programming languages; Test and deploy applications and systems.  Requirements:  Degree in Computer Science/Information Technology or related discipline; Familiar with SQL Server and design/architectural patterns; Knowledge of at least one of the .NET languages (e.g. C#, Visual Basic .NET); Understanding of Agile methodologies; Knowledge of the healthcare industry will be an added advantage;  Interested candidates may send in your resume to with 1) Date Available 2) Reason to Leave current job. We regret to inform that only shortlisted candidates will be notified.",
            "infoSource": "Jobstreet SG",
            "postDate": "About 17 hours ago",
            "crawlerCreateDate": "1616683899018"
        },
        {
            "link": "https://sg.jobsdb.com/job/Java-Backend-Consultant-63054fa694a692c1728656d00df57389?from_url=https%3A%2F%2Fsg.jobsdb.com%2Fj%3Fa%3D24h%26jt%3D3%26l%3DSingapore%26q%3Dfront%2Bend%2Bdeveloper%26sp%3Dfacet_listed_date%26p%3D4&sfjt=3&sl=Singapore&sol_srt=9fd85255-1372-41ff-8b7e-623af77fbfa8&sp=serp&sponsored=false&sq=front+end+developer&sr=32&tk=xNMrYXv9FREVS8jUdxcC-EEjORNfrgmu_06sMt9O7",
            "title": "Java Backend Consultant",
            "location": "Singapore",
            "company": "ARISTON SERVICES PTE. LTD.",
            "salary": "$5,000 - $8,000 per month",
            "description": "Roles & ResponsibilitiesScope: · Design and implement backend applications which interact with various surrounding systems and seamlessly integrate with a client facing frontend · Deploy the new applications into test environments and assure high quality software deliveries · Be part of a strong team and contribute to team success · Translate business requirements (functional and non-functional) into technical designs · Drive excellence in: software design & analysis, development methodologies, oral/written communication, requirements analysis and effort estimations · Challenge the status quo and come up with new ideas and solutions Requirements: · Deep knowledge in Software Engineering with Java (OpenJDK), SQL, SOAP or REST APIs, various Spring technologies (e.g Boot, MVC, Security, Integration), Hibernate, Git / GitHub · Fundamental experience in designing and implementing banking APIs (e.g. via Apigee, JSON interfaces, Microservices) • Fundamental experience in implementing robust and scalable backend applications · Experienced with containerized applications (e.g. Kubernetes, Docker) in a decentral environment (Linux, Oracle, cloud infrastructure) · Experience with search engines (Elastic Search or Azure Search) would be a great addition · A strong understanding of the software development lifecycle and Agile methodologies · Highly committed with a positive attitude and a great interest in shaping the future of technology in banking · Experienced in a global environment, a good team player, analytically skilled person who manages to cope with complex challenges in software engineering · Self-reliant, strong communicator verbally and in writing and a reliable partner who's known for delivering in time · Experience with financial instruments and market data would be a plus Should you be interested with this opportunity, please share your updated resume in word format to ***@aristonconsult.com. Thank you! Joy Ariston Services CEI Reg No: R2090931 www.aristonconsult.com Requirements",
            "infoSource": "Mycareersfuture SG",
            "postDate": "About 5 hours ago",
            "crawlerCreateDate": "1616683899389"
        },
        {
            "link": "https://sg.jobsdb.com/job/Senior-Technical-Consultant-7d66c296ee898a1a95e555cc91a33cf6?from_url=https%3A%2F%2Fsg.jobsdb.com%2Fj%3Fa%3D24h%26jt%3D3%26l%3DSingapore%26q%3Dfront%2Bend%2Bdeveloper%26sp%3Dfacet_listed_date%26p%3D4&sfjt=3&sl=Singapore&sol_srt=9fd85255-1372-41ff-8b7e-623af77fbfa8&sp=serp&sponsored=false&sq=front+end+developer&sr=33&tk=xNMrYXv9FREVS8jUdxcC-EEjORNfrgmu_06sMt9O7",
            "title": "Senior Technical Consultant (.NET)",
            "location": "Central Singapore",
            "company": "COENS ENERGY PTE LTD",
            "salary": "",
            "description": "The specific responsibilities that relate to this role include but are not limited to:  Take the onsite project technical lead for software development & migration projects, using .NET technologies. Responsible for the overall system design, technical solution, supporting deployment of software packages to UAT, staging and Production environments. Proven experience with optimization, troubleshooting principles, methodologies and issue resolution techniques. Responsible for ensuring SLA availability and performance of the .NET Applications Work closely with clients to gather and understand the requirements. Work with offshore development team to come up with the proposed design/solution based on the system requirements. Conduct technical discussion with clients to present proposed design, and confirm detailed technical solution for the system. Develop and test key modules especially those related to interfaces between different systems. Review source code developed by team members, and provide comments / suggestions for correction & improvement where necessary. Review software packages released from the development team, and support deployment these packages to UAT/Staging/Prod environments. Troubleshoot and resolve issues occur during SIT, UAT, or on Production. Execute the performance test, penetration test. Execute data migration (if required) and verify. Have skills and knowhow about Algorithm and Data Structure Have capabilities to work with Search Algorithm and Technique  General Experience:  Minimum of 3+ years of overall software development experience. At least 3 years of VB.NET/C#. Excellent knowledge and experience with Microsoft technologies Experience with .NET frameworks and tools required. Experience with MVC and Entity Framework, Repository Design Pattern. Experience with Web Services (WCF) Development of custom web parts, workflows, event receivers in C#. Strong analytical problem solving skills. Front-end development experience – JavaScript, jQuery, CSS. Strong interpersonal with sense of initiative and communication skills required Problem solving, issue troubleshooting.  Please note that due to the volume of applications we are receiving, only shortlisted candidates will be notified.",
            "infoSource": "Jobstreet SG",
            "postDate": "About 17 hours ago",
            "crawlerCreateDate": "1616683899727"
        },
        {
            "link": "https://sg.jobsdb.com/job/Engineer-9aa000c2531ce407d8ffa15d2d3513b3?from_url=https%3A%2F%2Fsg.jobsdb.com%2Fj%3Fa%3D24h%26jt%3D3%26l%3DSingapore%26q%3Dfront%2Bend%2Bdeveloper%26sp%3Dfacet_listed_date%26p%3D4&sfjt=3&sl=Singapore&sol_srt=9fd85255-1372-41ff-8b7e-623af77fbfa8&sp=serp&sponsored=false&sq=front+end+developer&sr=34&tk=xNMrYXv9FREVS8jUdxcC-EEjORNfrgmu_06sMt9O7",
            "title": "Full Stack Engineer",
            "location": "Singapore",
            "company": "PLATO MEDICAL PTE. LTD.",
            "salary": "$7,000 - $8,000 per month",
            "description": "Roles & ResponsibilitiesPlato is a Southeast Asian clinic's operating system, helping clinics automate the work of one team member at their practice. Plato supports more than 1500 healthcare providers in automating the work of one person at each of their practices. Plato is Singapore's most popular web-based software and is growing fast in Malaysia, Hong Kong, and Brunei. As a Full-Stack developer at Plato, you'll be building features to help automate admin work for doctors and other healthcare workers. These features include cutting edge machine learning projects that help doctors with record keeping, to key integrations linking critical systems together. Be part of the future of healthcare by supporting doctors to better help patients. As a high-availability SaaS software for enterprise, the Plato team is looking for software developers with a proven track record building out solid and reliable features. You'll be working directly with an experienced CTO and proven team. Ideally we're looking for someone who's independent, motivated, and thoughtful about how they build out features. Plato will invest in helping you build your skill set and will work with you to ensure you're building out challenging and exciting projects work within the company. Key Skills: We'd like you to have deep expertise in the following technologies.   Laravel  Javascript (React and AngularJS)  Past Experience:   3-4 years experience working as a software developer  Strong portfolio of projects  Track record working independently  Requirements",
            "infoSource": "Mycareersfuture SG",
            "postDate": "About 5 hours ago",
            "crawlerCreateDate": "1616683900127"
        },
        {
            "link": "https://sg.jobsdb.com/job/Developer-Analyst-Programmer-92a7b97d53ce8f13fe1261f6e76f2d9c?from_url=https%3A%2F%2Fsg.jobsdb.com%2Fj%3Fa%3D24h%26jt%3D3%26l%3DSingapore%26q%3Dfront%2Bend%2Bdeveloper%26sp%3Dfacet_listed_date%26p%3D4&sfjt=3&sl=Singapore&sol_srt=9fd85255-1372-41ff-8b7e-623af77fbfa8&sp=serp&sponsored=false&sq=front+end+developer&sr=35&tk=xNMrYXv9FREVS8jUdxcC-EEjORNfrgmu_06sMt9O7",
            "title": "Developer Analyst Programmer",
            "location": "Central Singapore",
            "company": "Genie Genius Pte Ltd",
            "salary": "",
            "description": "Software Programmer• Have Bachelor's Degree in Information Technology and related fields.• Have at least 1+ years of working exp• Have development experience with Java script, HTML 5,JQuery, Python script,Knockout JS, Boot strap JS• Must have experience with Python • Have most of programming skills above and willing to learn new technology• Responsible for in-house development applications and support• Able to complete tasks on time• Have working experience with SQL a plus",
            "infoSource": "Jobstreet SG",
            "postDate": "About 17 hours ago",
            "crawlerCreateDate": "1616683900554"
        },
        {
            "link": "https://sg.jobsdb.com/job/Software-Programmer-c90b765d37a4096947e220d302cac8db?from_url=https%3A%2F%2Fsg.jobsdb.com%2Fj%3Fa%3D24h%26jt%3D3%26l%3DSingapore%26q%3Dfront%2Bend%2Bdeveloper%26sp%3Dfacet_listed_date%26p%3D4&sfjt=3&sl=Singapore&sol_srt=9fd85255-1372-41ff-8b7e-623af77fbfa8&sp=serp&sponsored=false&sq=front+end+developer&sr=36&tk=xNMrYXv9FREVS8jUdxcC-EEjORNfrgmu_06sMt9O7",
            "title": "Software Programmer (2 years contract)",
            "location": "Boon Lay",
            "company": "ST Engineering Land Systems Ltd.",
            "salary": "",
            "description": " Job Description:• Create and develop engaging eLearning, Augmented and Mixed Reality Content• Conceptualise UI / UX design• Support demonstrations or proof of concepts• Perform courseware testing before delivering to users• Conduct user training Requirements:• Diploma/Degree in Computer Science, Computer Engineering, Engineering or related qualifications• Strong computational thinking• Experience in designing and developing applications using programming language (C#, C++, Java, PHP, Python etc.) for engines such as Unity, Unreal, DirectX• Passion for learning, creativity and interest in new technologies• Excellent oral, written and visual communication skills• Meticulous, eye for detail and design, pride in delivering quality work• Positive attitude with strong initiative to work independently, as well as across teams and departments• Strong adaptability and resilient in fast-paced environment• Working Location at Boon Lay (very near to MRT station)• Singaporeans only• Staff who join us will start with 2 years contract, there will be possibilities to convert to perm if performance is good  ",
            "infoSource": "Jobstreet SG",
            "postDate": "About 17 hours ago",
            "crawlerCreateDate": "1616683900997"
        },
        {
            "link": "https://sg.jobsdb.com/job/UX-Designer-ec84855d8958234c5e84c15f9a370a54?from_url=https%3A%2F%2Fsg.jobsdb.com%2Fj%3Fa%3D24h%26jt%3D3%26l%3DSingapore%26q%3Dfront%2Bend%2Bdeveloper%26sp%3Dfacet_listed_date%26p%3D4&sfjt=3&sl=Singapore&sol_srt=9fd85255-1372-41ff-8b7e-623af77fbfa8&sp=serp&sponsored=false&sq=front+end+developer&sr=37&tk=xNMrYXv9FREVS8jUdxcC-EEjORNfrgmu_06sMt9O7",
            "title": "UI/UX Designer",
            "location": "East Singapore",
            "company": "HUSTLE & BUSTLE PTE. LTD.",
            "salary": "$3,000 - $3,500 per month",
            "description": "Roles & ResponsibilitiesWe are looking for a UI/UX Designer to turn our software into easy-to-use products for our own tech products and our clients. We are in the midst of creating a web app for an art exhibition which includes ticketing functions, interactive virtual tour capabilities, vendor system and payment gateway. UI/UX Designer responsibilities include gathering user requirements, designing graphic elements and building navigation components. To be successful in this role, you should have experience with design software and wireframe tools. If you also have a portfolio of professional design projects that includes work with web/mobile applications, we’d like to meet you. Responsibilities : · Gather and evaluate user requirements in collaboration with product managers and engineers · Illustrate design ideas using storyboards, process flows and sitemaps · Design graphic user interface elements, like menus, tabs and widgets · Build page navigation buttons and search fields · Develop UI mockups and prototypes that clearly illustrate how sites function and look like · Create original graphic designs (e.g. images, sketches and tables) · Prepare and present rough drafts to internal teams and key stakeholders · Identify and troubleshoot UX problems (e.g. responsiveness) · Conduct layout adjustments based on user feedback · Adhere to style standards on fonts, colors and images Requirements : · Proven work experience as a UI/UX Designer or similar role · Portfolio of design projects · Knowledge of wireframe tools (e.g. Wireframe.cc and InVision, Photoshop XD) · Up-to-date knowledge of design software like Adobe Illustrator and Photoshop · Team spirit; strong communication skills to collaborate with various stakeholders · Good time-management skills 1. Interested candidates with a minimum of 2 years experience are welcome to submit a comprehensive resume, together with portfolio references. 2. Please state your period of availability of commencement along with your expected salary in your application. 3. Remuneration and appointment will commensurate with qualifications and experience. 4. We regret that only shortlisted candidates will be notified. Requirements",
            "infoSource": "Mycareersfuture SG",
            "postDate": "About 5 hours ago",
            "crawlerCreateDate": "1616683901341"
        },
        {
            "link": "https://sg.jobsdb.com/job/Analyst-Programmer-fe651f4d649aad8263b115fa390e0a8f?from_url=https%3A%2F%2Fsg.jobsdb.com%2Fj%3Fa%3D24h%26jt%3D3%26l%3DSingapore%26q%3Dfront%2Bend%2Bdeveloper%26sp%3Dfacet_listed_date%26p%3D4&sfjt=3&sl=Singapore&sol_srt=9fd85255-1372-41ff-8b7e-623af77fbfa8&sp=serp&sponsored=false&sq=front+end+developer&sr=38&tk=xNMrYXv9FREVS8jUdxcC-EEjORNfrgmu_06sMt9O7",
            "title": "Analyst Programmer",
            "location": "Changi",
            "company": "",
            "salary": "$6,000 - $6,000 per month",
            "description": " Analyst Programmer Working days : Mon – Fri, occasional weekend for system upgrade Working Days :8.30 am – 6.00 pm Salary $4000- $6000 Location : Changi Whatapps: + (Angel) https://api.whatsapp.com/send?phone= ✅No: R2095111 ✅14C7279 ",
            "infoSource": "Gumtree Singapore",
            "postDate": "About 10 hours ago",
            "crawlerCreateDate": "1616683901680"
        },
        {
            "link": "https://sg.jobsdb.com/job/Technology-Lead-57dd77723d35b710dae75aa5b5818b37?from_url=https%3A%2F%2Fsg.jobsdb.com%2Fj%3Fa%3D24h%26jt%3D3%26l%3DSingapore%26q%3Dfront%2Bend%2Bdeveloper%26sp%3Dfacet_listed_date%26p%3D4&sfjt=3&sl=Singapore&sol_srt=9fd85255-1372-41ff-8b7e-623af77fbfa8&sp=serp&sponsored=false&sq=front+end+developer&sr=39&tk=xNMrYXv9FREVS8jUdxcC-EEjORNfrgmu_06sMt9O7",
            "title": "Technology Lead",
            "location": "Singapore",
            "company": "WeShine",
            "salary": "",
            "description": " SALARY  Negotiated  Equity  Profit Sharing   INDUSTRY  Full-stack Developer | Big Data    JOB TYPE  Full-Time    SKILLS  Software    JOB DESCRIPTION You will be part of the initial core team building WeShine from ground up. Please read about our mission and our values from weshine.com/careers.     JOB RESPONSIBILITY We require you to be entrepreneurial at heart, nimble, flexible and operate with a growth mindset. You need to be able to work in a startup environment (unstructured, ever-changing, uncertain etc). You are most likely a generalist that can pick up wide spectrum of new things independently.    JOB REQUIREMENT As the initial core team, its critical to believe and be energized by the vision. It is equally important to be aligned to our values. The vision and values do not change. How we execute can change.  As the technology lead in a small core team building the foundations of WeShine, you will be the subject matter expert of all things related to technology.     WEBSITE  https://weshine.com    INDUSTRY -   SOCIAL MEDIA  -    TOTAL EMPLOYEE  -  ",
            "infoSource": "Startup Jobs Asia",
            "postDate": "About 23 hours ago",
            "crawlerCreateDate": "1616683902130"
        },
        {
            "link": "https://sg.jobsdb.com/job/Software-Engineer-b4545eea9b04f11132ffe5a19e5080a4?from_url=https%3A%2F%2Fsg.jobsdb.com%2Fj%3Fa%3D24h%26jt%3D3%26l%3DSingapore%26q%3Dfront%2Bend%2Bdeveloper%26sp%3Dfacet_listed_date%26p%3D4&sfjt=3&sl=Singapore&sol_srt=9fd85255-1372-41ff-8b7e-623af77fbfa8&sp=serp&sponsored=false&sq=front+end+developer&sr=40&tk=xNMrYXv9FREVS8jUdxcC-EEjORNfrgmu_06sMt9O7",
            "title": "Software Engineer",
            "location": "Central Singapore",
            "company": "Jobster Pte Ltd (EA 06C5060)",
            "salary": "",
            "description": "Responsibilities:• Design and deliver working software applications, update necessarydocumentations, support production issues, etc• Part of an Agile Scrum team to develop software using Agile methodology,e.g. participating in ceremonies, refining product backlog items, etc.• Work closely with other members of the Scrum team (Business Analysts andQuality Engineers) for user stories elaboration, test automation, bug fixes,etc.• Work closely with UX team to implement application based on wireframesand design system• Work closely with DevOps team on setting up continuous integration, buildand release automation. Work with DevOps team to deploy applications tovarious environment.• Champion Agile technical practices such as unit testing, test drivendevelopment, pair programming and refactoring. Requirements:● Degree or Diploma in Computer Science, Computer or ElectronicsEngineering, Information Technology or related disciplines.● At least 2 years of professional experience in a software engineer orequivalent position (fresh graduates with provable technical skills may apply)● Hands-on working experience in building web application software usingeither Node.js, .NET (C#), Java or OutSystems● Working experience with automated testing frameworks● Working experience with large web-based Single-Page Application● Knowledge in HTML5/CSS3 and Javascript frameworks such as React.js orVue.js will be added advantage● Possess good communication skillsWorking knowledge in the any of the following will be an added advantage:● Oracle databases and SQL scripting● AWS or similar cloud deployments● Dockers and microservices● Agile software development and technical practices",
            "infoSource": "Jobstreet SG",
            "postDate": "About 17 hours ago",
            "crawlerCreateDate": "1616683902492"
        },
        {
            "link": "https://sg.jobsdb.com/job/rd/3eb66d31ef0328bceff150e4a1658b89?sp=sserp_bottom&sponsored=true&sr=33&tk=xNMrYXv9FREVS8jUdxcC-EEjORNfrgmu_06sMt9O7",
            "title": "",
            "location": "",
            "company": "",
            "salary": "",
            "description": "",
            "infoSource": "",
            "postDate": "",
            "crawlerCreateDate": "1616683903210"
        },
        {
            "link": "https://sg.jobsdb.com/job/rd/f5d1cf290b300acfaa630f84ceed4a3a?sp=sserp_bottom&sponsored=true&sr=34&tk=xNMrYXv9FREVS8jUdxcC-EEjORNfrgmu_06sMt9O7",
            "title": "",
            "location": "",
            "company": "",
            "salary": "",
            "description": "",
            "infoSource": "",
            "postDate": "",
            "crawlerCreateDate": "1616683903760"
        },
        {
            "link": "https://sg.jobsdb.com/job/rd/807a95eb83fdc2f70cf7046798f87fb7?sp=sserp_bottom&sponsored=true&sr=35&tk=xNMrYXv9FREVS8jUdxcC-EEjORNfrgmu_06sMt9O7",
            "title": "",
            "location": "",
            "company": "",
            "salary": "",
            "description": "",
            "infoSource": "",
            "postDate": "",
            "crawlerCreateDate": "1616683905073"
        },
        {
            "link": "https://sg.jobsdb.com/job/rd/e89e09018678a8678ce11c9928312ca9?sp=sserp_top&sponsored=true&sr=41&tk=iREBxpfxBa44CYGEhxc_-n_7gjYfOddPMSiA7PPZq",
            "title": "",
            "location": "",
            "company": "",
            "salary": "",
            "description": "",
            "infoSource": "",
            "postDate": "",
            "crawlerCreateDate": "1616683905826"
        },
        {
            "link": "https://sg.jobsdb.com/job/rd/e7ae87abcd53cf9a34cab15598b8ebf7?sp=sserp_top&sponsored=true&sr=42&tk=iREBxpfxBa44CYGEhxc_-n_7gjYfOddPMSiA7PPZq",
            "title": "",
            "location": "",
            "company": "",
            "salary": "",
            "description": "",
            "infoSource": "",
            "postDate": "",
            "crawlerCreateDate": "1616683906521"
        },
        {
            "link": "https://sg.jobsdb.com/job/Software-Developer-497c4427040d64635f137d685ec3ba7b?from_url=https%3A%2F%2Fsg.jobsdb.com%2Fj%3Fa%3D24h%26jt%3D3%26l%3DSingapore%26q%3Dfront%2Bend%2Bdeveloper%26sp%3Dfacet_listed_date%26p%3D5&sfjt=3&sl=Singapore&sol_srt=bfe0615f-7dce-49eb-b47b-3d365df877ea&sp=serp&sponsored=false&sq=front+end+developer&sr=41&tk=iREBxpfxBa44CYGEhxc_-n_7gjYfOddPMSiA7PPZq",
            "title": "Software Developer--",
            "location": "Singapore",
            "company": "Pactera EDGE Technologies Singapore Pte Ltd",
            "salary": "",
            "description": "Requirements:   Candidate must possess at least a Bachelor's Degree in Computer Science or related engineering discipline  At least 1+ years of experience in software development with shipping large, cross-functional projects in a global internet service environment.  Relevant industry experience developing in Java and its associated technology stacks such as Spring.  Experience building web services in the cloud, particularly with AWS solutions.  Proficient with algorithms and data structures, design patterns, SOA (service-oriented architecture), domain-driven design, multithreading, concurrency, caching and distributed systems  Experience in agile/scrum teams, and a track record of learning from your actions to make positive adjustments.  Working knowledge of SQL databases and other NoSQL solutions.  Experience with C++, Templates, and Boost libraries a bonus.  Verbal and written communication skills with the ability to present complex technical information in a clear and concise manner.  ",
            "infoSource": "Jobstreet SG",
            "postDate": "About 17 hours ago",
            "crawlerCreateDate": "1616683906914"
        },
        {
            "link": "https://sg.jobsdb.com/job/Tech-Lead-Full-02b46807d06299142f4f273124e504fa?from_url=https%3A%2F%2Fsg.jobsdb.com%2Fj%3Fa%3D24h%26jt%3D3%26l%3DSingapore%26q%3Dfront%2Bend%2Bdeveloper%26sp%3Dfacet_listed_date%26p%3D5&sfjt=3&sl=Singapore&sol_srt=bfe0615f-7dce-49eb-b47b-3d365df877ea&sp=serp&sponsored=false&sq=front+end+developer&sr=42&tk=iREBxpfxBa44CYGEhxc_-n_7gjYfOddPMSiA7PPZq",
            "title": "Tech Lead ( Full Stack / Devops / Cloud )",
            "location": "Central Singapore",
            "company": "Cornerstone Global Partners",
            "salary": "",
            "description": "OUR CLIENT PROFILE OUR CLIENT spearheads the bank’s innovation across the Group, which is one of the largest European bank. Our client’s mandate will be to invest in FinTech's and other start-up companies, promote rapid testing and implementation of new business models.JOB OVERVIEW : This Technology Lead role operates in Singapore, focused on developing innovative solutions, including new projects, co-creations, joint ventures and prototype development to find product-market fit and enable successful commercialization for ASEAN.Business • Working with digital business and project leads, team members in Singapore and remote offices, lead the technology build discussions, assess, recommend infrastructure required to support new business models through design, prototyping, minimum viable product (MVP), Alpha/Beta and go-live phases. • Technology Lead will discuss with partners, fintechs, co-creation clients, and business units focusing on Singapore and ASEAN markets. • Co-ordinate, question and interrogate technology infrastructure proposed by partners with a business. Keep a managerial mindset that seeks to optimise the business outcome at optimal cost while leveraging our client systems and processes. This role requires close coordination with our client CTO • Engage appropriate subject matter experts (SMEs) where solutions require the use of Artificial Intelligence (AI), Machine Learning (ML), Blockchain, IoT, APIs, cyber security, DevOps or any other such like tech applications. Technical Skills• Expert knowledge of at least one mainstream cloud provider such as AWS, Azure or GCP• Extensive experience with DevOps and full stack development• Experience with one or more programming languages such as Java, C# or Python• Familiar with one more popular front-end frameworks such as AngularJS or ReactJS• Experience with setting up CICD and Git based workflows• Experience with deploying systems in production and release management• Experience with restful based systems and micro-servicers• Experience with building systems either with SQL or NoSQL databases• Good grasp of DNS and HTTP• Ability to wear multiple hats such as individual contributor, team lead, solution architect, facilitator.Specific Responsibilities Overall • The Technology Lead will have oversight of technology infrastructure of Business Venture(s) and investments in the region and manage version control and the upgrades that will from time to time be proposed as part of quality control, feedback and continuous improvement processes.• Assess technical competence of partners engaged by our client Ventures and make recommendations of whether to proceed, upgrade capabilities or identify execution and infrastructure risk.• Have expertise and professional experience in software development and deep understanding of technology delivery.• Participate in assessing and hiring technical personnel required to be part of the business ventures, investments, joint ventures and partnerships.• Collaborating with different teams to identify and address technical problems.• Facilitate Ventures in their progression of incubation, acceleration, beta and go-live phase.• Be the primary contact to guide the Singapore team through technical issues and challenges.• Demonstrate the following behaviours (1) keep client needs and experience at the core (2) have bias for execution and speed and pivot based on outcomes and user experience.• Engage with relevant business units (RMs and Unit Head), Technology SMEs, Compliance as well as external regulatory agencies.Processes • Act in the role of an internal consultant for technology proposed for joint ventures, business models and investments until they are independently launched into standalone legal entities.• Ensure effective management of operational risks within the role remit and compliance with applicable internal policies, and external laws and regulation.• Organisational skills and tenacity as will be required to work on multiple projects across different countries and stake holders. This will also entail having project management skills. People and Talent • Lead by example and build the appropriate culture and values.• Create a motivational and challenging environment in the team which is conducive to creativity and delivery of the strategy.Risk Management• Act and escalate quickly when any risk and control weakness become apparent and ensure they are addressed within an appropriate timeframe and escalated through the relevant committees.• Work with colleagues to deliver expected business performance results within cost constraints and applicable risk / control framework to ensure that the Group's ability to remain within risk appetite is not materially threatened.Governance• Familiarise self with governance structures and mandatory bank processes.• Have an awareness and understanding of the regulatory framework in which the Group operates, and the regulatory requirements and expectations relevant to the role.Regulatory & Business Conduct• Display exemplary conduct and live by the Group's Values and Code of Conduct.• Take personal responsibility for embedding the highest standards of ethics, including regulatory and business conduct, across the Bank. This includes understanding and ensuring compliance with, in letter and spirit, all applicable laws, regulations, guidelines and the Group Code of Conduct.• Effectively and collaboratively identify, escalate, mitigate and resolve risk, conduct and compliance matters.Key Stakeholders• Chief Technology Officer• Technology Leads, other offices Knowledge & Skills Knowledge • Understanding and appreciation for the complexities of the Group's footprint• 7+ years of relevant technical experience• Motivated to address the impact of innovation technology in Financial Services• Beneficial is knowledge of FinTech ecosystem, inclusive of BlockChain, Digital Payments, Primer Services and Transaction Banking Enhancements, as well as other innovations in this spacePersonal Capabilities• Imaginative and creative approach to how we do work• Curiosity about new technologies, workflows, and products• Ability to see things from multiple perspectives, as well as ask the question \"why\" continuously• Tireless work ethic and enthusiasm to execute and get things done• Professional mannerisms  HOW TO APPLY: If you are a team player and would like to embark on this exciting challenge and most importantly, believe thatYOU CAN MAKE A DIFFERENCE, we would like to hear from you. Kindly submit your application by emailing a detailed copy of your updated Resume in MS Word Format toJonathan Ng (Reg. No.: R1332294) Email: ***********@cornerstoneglobalpartners.com Please indicate the below information in your resume: • Current & Expected Salary• Reason(s) for leaving• Notice Period / Availability to commence work We regret only short-listed candidate will be notified. All applications will be treated with the strictest confidence. By submitting any application or resume to us, you will be deemed to have read & agreed to the terms of ourPrivacy Policy, and consented to us collecting, using, retaining and disclosing your personal information toprospective employers for their consideration, and for our marketing EDMs which you may opt out byunsubscribing in the mailer. ",
            "infoSource": "Jobstreet SG",
            "postDate": "About 17 hours ago",
            "crawlerCreateDate": "1616683907274"
        },
        {
            "link": "https://sg.jobsdb.com/job/Senior-Developer-bfc385fa93fd4e989b28531b9613e037?from_url=https%3A%2F%2Fsg.jobsdb.com%2Fj%3Fa%3D24h%26jt%3D3%26l%3DSingapore%26q%3Dfront%2Bend%2Bdeveloper%26sp%3Dfacet_listed_date%26p%3D5&sfjt=3&sl=Singapore&sol_srt=bfe0615f-7dce-49eb-b47b-3d365df877ea&sp=serp&sponsored=false&sq=front+end+developer&sr=43&tk=iREBxpfxBa44CYGEhxc_-n_7gjYfOddPMSiA7PPZq",
            "title": "Senior Developer",
            "location": "Singapore",
            "company": "Standard Chartered Bank",
            "salary": "",
            "description": "About Standard Chartered  We are a leading international bank focused on helping people and companies prosper across Asia, Africa and the Middle East.   To us, good performance is about much more than turning a profit.  It's about showing how you embody our valued behaviours - do the right thing, better together and never settle - as well as our brand promise, Here for good.  We're committed to promoting equality in the workplace and creating an inclusive and flexible culture - one where everyone can realise their full potential and make a positive contribution to our organisation. This in turn helps us to provide better support to our broad client base. The Role Responsibilities    Responsible for designing and developing application and system solutions with good understanding Java/JSP/Struts/Spring/Spring Boot/Maven/Grale/Ant/JUINT/Hibernate and experienced inworking closely with Web and Mobile developers.   Ability to analyse CSL (backend) and UI based on CRs, from requirement gathering stage and ensure the impact analysis is documented in the JIRA  Work with Project team to ensure the required testing gets on time, with good communicating skills within team and with stake holders.  Knowledge in databases, data structures and collections and good understanding in environments, build, packaging and deployment.  Provide Support to Project team to address the non-productions issues which gets reported as an when the issue gets reported  Participate in Daily Scrum calls and update the project status to Stake Holders and Scrum Master  Preferably working knowledge in JSON, XML, HTML5, CSS3, JavaScript MVC frameworks and libraries.  Key Stakeholders  RPBWM Retail Digital Channels Retail Work Bench Team  RPBWM Retail Digital Channels Retail Work Bench Team - applicable internal technology stakeholders  RPBWM Retail Digital Channels Retail Work Bench Team - applicable internal business stakeholders and support functions (e.g. regional and country stakeholders, Audit & Compliance, etc)  Our Ideal Candidate  Multitasking ability.  Basic computer skills.  Great communication skills.  Understanding of Agile practices and experience using Agile/Kanban Tools such as JIRA  A track record of following through on commitments  Should have basic knowledge of mobile app development in IOS / Android.  Qualification Bachelor’s degree (or equivalent experience) 10+ years of relevant industry experience (Retail Banking & Channels) Strong communication skills to interact with many different personalities/ stakeholders and reach consensus when necessary Must have the ability to work in a dynamic, fast-paced environment Must have relevant experience in working with customer interaction management and client communication related applications related to retail banking domain Must have hands-on experience in building applications to manage client journey and experience Must have hands on knowledge in Spring boot, Spring JPA, Hibernate, Database Oracle, PostgreSQL, API interfaces, Unit testing, Open Shift, Docker, Maven, XML, json API and json Must have experience with agile frameworks (e.g. Scrum, Kanban, Lean, Extreme Programming, LeSS, SAFe) Apply now to join the Bank for those with big career ambitions.  To view information on our benefits including our flexible working please visit our career pages. We welcome conversations on flexible working.",
            "infoSource": "Standard Chartered Bank",
            "postDate": "About 7 hours ago",
            "crawlerCreateDate": "1616683907637"
        },
        {
            "link": "https://sg.jobsdb.com/job/Software-Developer-b09ee4016decf8179c4db794676a3c6a?from_url=https%3A%2F%2Fsg.jobsdb.com%2Fj%3Fa%3D24h%26jt%3D3%26l%3DSingapore%26q%3Dfront%2Bend%2Bdeveloper%26sp%3Dfacet_listed_date%26p%3D5&sfjt=3&sl=Singapore&sol_srt=bfe0615f-7dce-49eb-b47b-3d365df877ea&sp=serp&sponsored=false&sq=front+end+developer&sr=44&tk=iREBxpfxBa44CYGEhxc_-n_7gjYfOddPMSiA7PPZq",
            "title": "Snr/Software Developer Platform",
            "location": "Kallang",
            "company": "CONTINENTAL AUTOMOTIVE SINGAPORE PTE. LTD.",
            "salary": "$5,000 - $8,500 per month",
            "description": "Roles & Responsibilities• SW build and test automization for continuous integration, test and deployment purpose • Build and test environment setup and maintenance (Build and test machines, Server, …) • Jenkins pipeline implementation • Static Code Checking environment setup and maintenance • Unit Testing environment setup and maintenance • Integration test environment setup and maintenance • Build and test issue and failure analysis and solution • Automated integration and test status reporting setup and maintenance • Development team support • SW configuration and change management • Releasing and documentation of SW • Degree in Computer Science or other relevant disciplines • SW-development Embedded Systems (Automotive) • Embedded Linux or QNX or Android or Integrity knowledge • Experience with automotive HW and embedded SW • Continuous Integration and Test methodology knowledge • Methodologies for problem analysis • ASPICE knowledge • Jenkins automization knowledge • Yocto build system knowledge • Android build system knowledge • SW-change management with Github / Gerrit • Scripting languages Python, Groovy and Powershell • Programming language C/C++ • Reporting tools (SQL, Grafana) knowledge • Artifact management tools like Artifactory • Windows and Linux development environment knowledge • Ansible, Docker knowledge • Static Code-Checker (if possible: Klocwork) • Unit Testing tools like Google test • Requirements engineering knowledge (DOORS) • Recent fresh graduates may apply. Requirements",
            "infoSource": "Mycareersfuture SG",
            "postDate": "About 5 hours ago",
            "crawlerCreateDate": "1616683908027"
        },
        {
            "link": "https://sg.jobsdb.com/job/Dashboard-Software-Engineer-5bbd6ac22ebd148571bb80da597ffc93?from_url=https%3A%2F%2Fsg.jobsdb.com%2Fj%3Fa%3D24h%26jt%3D3%26l%3DSingapore%26q%3Dfront%2Bend%2Bdeveloper%26sp%3Dfacet_listed_date%26p%3D5&sfjt=3&sl=Singapore&sol_srt=bfe0615f-7dce-49eb-b47b-3d365df877ea&sp=serp&sponsored=false&sq=front+end+developer&sr=45&tk=iREBxpfxBa44CYGEhxc_-n_7gjYfOddPMSiA7PPZq",
            "title": "Dashboard Software Engineer | 5 Days Office hours | Contract | AMK",
            "location": "North East Singapore",
            "company": "Dynamic Human Capital Pte Ltd",
            "salary": "$3,300 - $3,300 per month",
            "description": " 5 days work week Office hours Establish company renewable contract  Primary Job Duties & Responsibilities   Develop reporting solutions in business intelligence tools (MicroStrategy, Tableau, SiSense & etc.), this includes: performing analysis, design, development, and configuration functions (includes defining technical requirements) with a high degree of accuracy and speed, operating as a technical lead.  Maintain and stabilize reporting environment, this includes: analysis, assessment and resolution for defects and incidents of advanced complexity and escalate appropriately.  Work independently to tackle well-scoped and loosely scoped problems in regard to both business intelligence tools, and data visualization artifacts (standard and ad hoc reports, queries, dashboards etc.).  Seek opportunities to expand technical knowledge and capabilities.  Provide technical guidance and mentorship to less experienced employees. In particular, mentor and train other developers in mastering business intelligence tools. Minimum Qualifications   Diploma or Bachelor's degree or its equivalent in work experience.  More than One year of programming experience.  Has a passion for data and data visualization.Education, Work Experience, & Knowledge  More than Two years of dashboard design/reporting/development experience.  Experience in MicroStrategy, Tableau & SiSense.  Familiarity with other BI technologies is plus.  In depth understanding of databases and data warehouse principles (including proficiency in SQL query/SQL server DB/Oracle DB etc.).  Data normalization, dimensional modeling and OLAP cube experiences.  Strong verbal communication skill is a must, resilient in fast-paced challenging and agile environment. Job Specific Technical Skills & Competencies   Delivery - delivery skills include the ability to estimate accurate timelines for tasks and deliver work at a steady, predictable pace to achieve commitments, contribute to the software design strategy and methodologies used to best meet the system requirements, consider and build for many different use cases, avoid over engineering, and ensure automation, deliver complete solutions but release them in small batches, and identify important tradeoffs and negotiate them.  Domain Expertise - Demonstrated track record of domain expertise including understanding technical concepts necessary to do the job effectively and aware of industry trends, demonstrate willingness, cooperation, and concern for business issues and priorities, and possess in depth knowledge of immediate systems worked on and some knowledge of adjacent systems.  Problem Solving - Strong problem solver who ensures solutions are built for the long term, is able to resolve new issues, recognizes mistakes using them as learning and teaching opportunities and consistently breaks down large problems into smaller, more manageable ones.  Communication - Strong communicator who possesses the ability to articulate information clearly and concisely with the business, document work in a clear, easy to follow manner, collaborate well with team members as both a mentor and mentee, take in vague requirements and ask the right questions to ensure clarification, offer feedback appropriately and effectively, seek out and receives constructive criticism well, listen when others are speaking and make space for colleagues to share their thoughts.  HOW TO APPLY: We would like to invite interested applicants to email detailed resume in MS Word format to:******@dhc.com.sgWe regret to inform that only shortlisted candidates will be notified. All applications will be treated with the strictest confidence. Eugene YeoRegistration number R1988092EA License: 12C6253 By submitting any application or résumé to us, you will be deemed to have agreed and consented to us disclosing your personal information to prospective employers for their consideration.Under the revised Employment Agencies Licence Condition 5(b), employment agencies (EAs) are required to collect the personal data (e.g., NRIC, FIN) of applicants referred to employers for permanent or contract job positions of at least 6 months with a fixed monthly salary of $3,300 and above. ",
            "infoSource": "Jobstreet SG",
            "postDate": "About 17 hours ago",
            "crawlerCreateDate": "1616683908423"
        },
        {
            "link": "https://sg.jobsdb.com/job/Experiencial-Designer-599b09cd36cc385771acbc897c09756c?from_url=https%3A%2F%2Fsg.jobsdb.com%2Fj%3Fa%3D24h%26jt%3D3%26l%3DSingapore%26q%3Dfront%2Bend%2Bdeveloper%26sp%3Dfacet_listed_date%26p%3D5&sfjt=3&sl=Singapore&sol_srt=bfe0615f-7dce-49eb-b47b-3d365df877ea&sp=serp&sponsored=false&sq=front+end+developer&sr=46&tk=iREBxpfxBa44CYGEhxc_-n_7gjYfOddPMSiA7PPZq",
            "title": "Experiencial Designer",
            "location": "Outram",
            "company": "Caerus Holding Pte Ltd",
            "salary": "",
            "description": "To generate creative ideas and solutions to support brand and marketing strategies.  Responsible for full project lifecycle, manage the end-to-end design process from concept to execution that includes creative support for social media channels and e-commerce platforms. Conceptualize, design and execute creative graphic artwork for marketing and communications related items in the web and digital media (Shopify, e-commerce images etc.), as well as offline such as product packaging, posters and other marketing materials.  Manage multiple creative projects involving banners, web pages and graphic content for social media, website and mobile app. Work closely with internal team to develop concepts for assigned projects and adhoc activities.  Good understanding of business/marketing directives and briefs with the ability to assist in brand developments.  Maintain brand consistency throughout all marketing initiatives, propose innovative ideas to produce effective brand communications for in-house digital online and offline campaigns projects. Good understanding of creative design, layout and typography with a keen eye for aesthetics and details.  Liaison with external vendors to ensure marketing materials are correctly produced and installed/utilized.  Any other related tasks/projects.  Requirements:  -         Diploma/Degree in relevant discipline with 2 years of relevant experience in UI, visual and Ads design  -         Proficient is Adobe design tools: Photoshop, Illustrator, InDesign, Creative Suite and image editing software  -         Understanding of basic front-end language: HTML, CSS and JavaScript would be advantage  -         Lifestyle F&B/ FMCG Industry experience preferred  -         Able to work across multiple brands  -         Able to work in a fast-paced environment with minimal supervision  -         Proactive, dynamic and able to work collaboratively in team setting or independently to meet tight deadlines  -         Good communication skills",
            "infoSource": "Jobstreet SG",
            "postDate": "About 17 hours ago",
            "crawlerCreateDate": "1616683908851"
        },
        {
            "link": "https://sg.jobsdb.com/job/Lead-Engineer-2b170436a3f0380d4822c508d1eba0b5?from_url=https%3A%2F%2Fsg.jobsdb.com%2Fj%3Fa%3D24h%26jt%3D3%26l%3DSingapore%26q%3Dfront%2Bend%2Bdeveloper%26sp%3Dfacet_listed_date%26p%3D5&sfjt=3&sl=Singapore&sol_srt=bfe0615f-7dce-49eb-b47b-3d365df877ea&sp=serp&sponsored=false&sq=front+end+developer&sr=47&tk=iREBxpfxBa44CYGEhxc_-n_7gjYfOddPMSiA7PPZq",
            "title": "Lead Engineer - Autumn Life - (2100006894)",
            "location": "Singapore",
            "company": "Standard Chartered Bank",
            "salary": "",
            "description": "SC Ventures (“SCV”) was established in March of 2018 with the purpose of “Rewiring the DNA in Banking” by bringing three distinct areas together: The eXellerator labs, enabling innovation at large in the Bank by supporting: Entrepreneurially-minded colleagues as “Intrapreneurs”, developing ideas to products, services or new business models. Collaboration with fintech companies, supported by the SC Ventures FintechBridge[1], Proof of Concept (“POC”) framework and POC funding.Client engagement on co-creation activities. The Innovation Investment Fund (“Fund”), USD100m allocated to acquire minority stakes in fintech companies (“fintechs”) whose technology has been successfully validated in the Group and is progressing to production (i.e., continuing use), subject to commercial due diligence. Venture building, exploring new business models (“ventures”), with the objective of providing ‘optionality’ for the Group in the way it engages existing and new customers and markets. These adopt a start-up model, operating independently of the Group’s existing businesses, funded in a venture capital fashion, and under a different governance and risk management framework. There are c.65 team members (excluding individual ventures), including dedicated colleagues from the Group’s support functions, based in Singapore, Hong Kong, Shanghai, Nairobi, London and San Francisco. Purpose:  Develop a new platform (greenfield project) from scratch Initial design, coding & functional testing of a mass market retail Mobile App  Responsibilities:  Experience with Backend Technologies viz. C#, .Net Core and Frontend Technologies viz. React Native, Typescript/Javascript is a must Experience in delivering innovative technological solutions/products is preferred Experience in ASPNET Zero is preferred Experience in Typescript, libraries, and bootstrap templates preferred Experience in designing Database with code-first approach Experience in writing complex SQL queries and Stored Procedures Hands-on coding, develop high quality code while meeting deadlines Design and occasional implementation of POCs Working in highly collaborative, fun loving team using Agile methodology Self starter having experience working in start-up environment preferred Experience in working with diverse and cross-cultural teams Creating attractive, responsive fast performing Mobile App from ground-up “Write code for others, not for yourself” –code will be reviewed by peer developers  Requirements:  Excellent knowledge and experience in C#, ASP.NET Core, LINQ Queries, Web APIs Hands-on React Native and/or Android/iOS Native mobile app development experience At least 5 years professional working experience in software development. Proficiency in mobile app technology stack eg. React Native, Typescript/Javascript Working familiarity and understanding of the back end, i.e. REST APIs, SQL/NoSQL Databases or similar experience with remote data via RESTful APIs and JSON. Implement CI/CD framework and automated testing Understanding distributed application environments Knowledge of software best practices, like Behaviour-Driven-Development (BDD), Test-Driven Development (TDD) Expected to be familiar with Cucumber, Karma, Protractor, Jasmine Knowledge of web servers and development environments Knowledge of Agile/Scrum/Kanban development methodologies is a plus Knowledge of asynchronous messaging middleware is a plus Knowledge of financial products and dashboards is a plus Cloud knowledge a big plus (AWS/GCP) – (Kubernetes/Docker) Be nice, respectful, able to work in a team  Apply now to join the Bank for those with big career ambitions.",
            "infoSource": "Jobstreet SG",
            "postDate": "About 17 hours ago",
            "crawlerCreateDate": "1616683909211"
        },
        {
            "link": "https://sg.jobsdb.com/job/Electrical-Engineer-8615a37fb99cc546e2de7a6a09faafc9?from_url=https%3A%2F%2Fsg.jobsdb.com%2Fj%3Fa%3D24h%26jt%3D3%26l%3DSingapore%26q%3Dfront%2Bend%2Bdeveloper%26sp%3Dfacet_listed_date%26p%3D5&sfjt=3&sl=Singapore&sol_srt=bfe0615f-7dce-49eb-b47b-3d365df877ea&sp=serp&sponsored=false&sq=front+end+developer&sr=48&tk=iREBxpfxBa44CYGEhxc_-n_7gjYfOddPMSiA7PPZq",
            "title": "Electrical Engineer (Basic up $2.5k/ Office hour/ Kaki bukit / 1-2 yr Exp) HA",
            "location": "Singapore",
            "company": "MCI Career Services Pte Ltd",
            "salary": "",
            "description": "Benefit:  Working days : Monday to Friday Working hours : 8.30 am - 5.30 pm Basic salary: $2000 - 2500 Location: kaki bukit  Responsibilities  Design and Development of LCD module and auxiliary boards with circuitry schematic and PCB design. Analyse product requirement of products above and generate specification documents for development. Study and Evaluate circuitry of new solution / new IC for future product development. Testing, debugging and troubleshooting of design. Evaluation, validation and certification of product functions. Documentation of design / development data.  Requirements  Min 1-2 years of working experience Prefer Electrical & Electronics Engineering background or has good understanding of electrical and electronic systems, audio / video consumer product related background will be advantageous Ability to design using Altium or equivalent  Applicants who possess relevant experience for the above responsibilities are mostwelcome to apply. If you do not possess the above experience, your application will still beconsidered on individual merits and you may be contacted for other opportunities.HOW TO APPLY:  Applicants who possess relevant experience for the above responsibilities are most welcome to apply. If you do not possess the above experience, your application will still be considered on individual merits and you may be contacted for other opportunities. Please submit your updated resume in MS format by using the APPLY NOW BUTTON or send resume to ******@mci.com.sg or whatsapp East EE to +65 82343615 Our dedicated and approachable MCI consultants will get back to you soon for a confidential discussion.Please include the following information in your resume:  Education background Work experiences in point forms Reason (s) for leaving Current and expected salary Date of availability / Notice period  By submitting your personal data and/or resume, you give consent to collection, use and disclosure of your personal data and/or resume by the company (or its agent) for the purpose of the processing and administration by company relating to this job application. **We regret to inform that only shortlisted candidates would be notified. **We wish you all the best in your career search. New Hong Aun (Gordon)Reg Number: R1984859MCI Career Services Pte LtdEA Licence No: 06C2859",
            "infoSource": "Jobstreet SG",
            "postDate": "About 17 hours ago",
            "crawlerCreateDate": "1616683909594"
        },
        {
            "link": "https://sg.jobsdb.com/job/Software-Engineer-2259760858a721d7a1ba37bf16dadbd0?from_url=https%3A%2F%2Fsg.jobsdb.com%2Fj%3Fa%3D24h%26jt%3D3%26l%3DSingapore%26q%3Dfront%2Bend%2Bdeveloper%26sp%3Dfacet_listed_date%26p%3D5&sfjt=3&sl=Singapore&sol_srt=bfe0615f-7dce-49eb-b47b-3d365df877ea&sp=serp&sponsored=false&sq=front+end+developer&sr=49&tk=iREBxpfxBa44CYGEhxc_-n_7gjYfOddPMSiA7PPZq",
            "title": "Software Engineer",
            "location": "Central Singapore",
            "company": "SUNRIGHT LIMITED",
            "salary": "",
            "description": "Responsibilities:   Application development, maintenance, enhancement, and implementation of software applications using Oracle Developer Suite and JAVA. Conduct user training and on-going user support. Review and document solutions after completion of projects.  Requirements:  Minimum Diploma/Bachelor's Degree in Computer Science / Information Technology Minimum 2 years in analysis, design and development of web-based applications in a manufacturing or distribution environment. Good knowledge of Financial Accounting, Inventory Management and Manufacturing Resource Planning software applications. Proficiency in Unix/Linux/Windows operating systems, and Cloud implementation Well versed in Oracle Database, Oracle Application Server, Oracle Developer Suite, PL/SQL, JAVA or J2EE. Knowledge in data warehouse or analytic solutions Experience in database triggers and stored procedures will be an added advantage. Ability to work with end users to propose IT solutions that meet their requirements. ",
            "infoSource": "Jobstreet SG",
            "postDate": "About 17 hours ago",
            "crawlerCreateDate": "1616683909970"
        },
        {
            "link": "https://sg.jobsdb.com/job/API-Java-Developer-e7a61b606a8bf743dfd418d39c200625?from_url=https%3A%2F%2Fsg.jobsdb.com%2Fj%3Fa%3D24h%26jt%3D3%26l%3DSingapore%26q%3Dfront%2Bend%2Bdeveloper%26sp%3Dfacet_listed_date%26p%3D5&sfjt=3&sl=Singapore&sol_srt=bfe0615f-7dce-49eb-b47b-3d365df877ea&sp=serp&sponsored=false&sq=front+end+developer&sr=50&tk=iREBxpfxBa44CYGEhxc_-n_7gjYfOddPMSiA7PPZq",
            "title": "Microservices/ API Java developer",
            "location": "Singapore",
            "company": "Beath Chapman",
            "salary": "",
            "description": "Our client is a large scale company with a sizeable tech team in Singapore. It is building up a edge cutting application to consolidate multiple app across the web, desktop, mobile application. You will be working on a green field projects and join this massive expansion to grow with the team and business. You will be a suitable candidate if you have experience in Java programming, Spring Boot, API, Microservices and etc.  Key Responsibilities: - Development of High Performance Java Service API and Business Systems - Using SpringBoot to build microsservices in Java - Writing deployment pipelines to deploy Java microservices in Kubernetes - Working with AWS Services to optimize your Java applications (SQS, SNS, SES, Lambda, S3, DynamoDB, RDS, and more) - Contributing to the Chapter java library and framework development - Write integration tests for API endpoints - Focus on Technical leadership - Ensure best practices are followed in the Chapter - Provides mentoring and guidance - Owns a large project or systemThe ideal candidate should have:  - BA in Computer Science or Computer Engineering - 3- 8 Years of experience in at least 3 technologies below: - Java 8 / Java lambda - SpringBoot - RESTFul Services - JSON API - HTTP Protocols / CORS / CSRF - Cache Control (Redis) - Microservice Architectures - Containerization - Maven - Junit - Mockito - Contract testing - Queueing Services (optional) - SQL Database (optional) - Consistency Model Understanding - Circuit Breakers - Rate Limiting - Caching Systems (Hazelcast, Redis, Aerospike) - RabbitMQ / Kafka / SQS - NoSQL Databases - Lambda (Serverless) Concepts - Deep understanding of Algorithmic Design - Deep understanding of Software Development Lifecycles - Can work in diverse large teams - Ability to communicate effectively - Ticking Systems - Documentation Systems - Testing MethodologiesEA Personnel No. R1872651BeathChapman Pte LtdEA Licence: 16S8112",
            "infoSource": "Jobstreet SG",
            "postDate": "About 17 hours ago",
            "crawlerCreateDate": "1616683910326"
        },
        {
            "link": "https://sg.jobsdb.com/job/rd/c94be771348ad00158169094d99d534c?sp=sserp_bottom&sponsored=true&sr=43&tk=iREBxpfxBa44CYGEhxc_-n_7gjYfOddPMSiA7PPZq",
            "title": "",
            "location": "",
            "company": "",
            "salary": "",
            "description": "",
            "infoSource": "",
            "postDate": "",
            "crawlerCreateDate": "1616683910992"
        },
        {
            "link": "https://sg.jobsdb.com/job/rd/16ae3579c1faac677d1a3bfb3835a31a?sp=sserp_bottom&sponsored=true&sr=44&tk=iREBxpfxBa44CYGEhxc_-n_7gjYfOddPMSiA7PPZq",
            "title": "",
            "location": "",
            "company": "",
            "salary": "",
            "description": "",
            "infoSource": "",
            "postDate": "",
            "crawlerCreateDate": "1616683911691"
        },
        {
            "link": "https://sg.jobsdb.com/job/rd/6980dfe612c7ae4d70417723f37e716a?sp=sserp_bottom&sponsored=true&sr=45&tk=iREBxpfxBa44CYGEhxc_-n_7gjYfOddPMSiA7PPZq",
            "title": "",
            "location": "",
            "company": "",
            "salary": "",
            "description": "",
            "infoSource": "",
            "postDate": "",
            "crawlerCreateDate": "1616683912449"
        },
        {
            "link": "https://sg.jobsdb.com/job/rd/e5e14e7cfcbd083c6607e330796b465c?sp=sserp_top&sponsored=true&sr=51&tk=7kxpyXfLDSYx0m9EBf8E-AtJRSnpVxcC52OczhI0Y",
            "title": "",
            "location": "",
            "company": "",
            "salary": "",
            "description": "",
            "infoSource": "",
            "postDate": "",
            "crawlerCreateDate": "1616683913137"
        },
        {
            "link": "https://sg.jobsdb.com/job/rd/39567179c5cdbfac6a24422ce2a1423c?sp=sserp_top&sponsored=true&sr=52&tk=7kxpyXfLDSYx0m9EBf8E-AtJRSnpVxcC52OczhI0Y",
            "title": "",
            "location": "",
            "company": "",
            "salary": "",
            "description": "",
            "infoSource": "",
            "postDate": "",
            "crawlerCreateDate": "1616683913928"
        },
        {
            "link": "https://sg.jobsdb.com/job/Senior-Software-Engineer-795d1a8967744a319aff8ab0b00dc158?from_url=https%3A%2F%2Fsg.jobsdb.com%2Fj%3Fa%3D24h%26jt%3D3%26l%3DSingapore%26q%3Dfront%2Bend%2Bdeveloper%26sp%3Dfacet_listed_date%26p%3D6&sfjt=3&sl=Singapore&sol_srt=e51108a6-a6b2-41c8-8f77-eb31b7763cc7&sp=serp&sponsored=false&sq=front+end+developer&sr=51&tk=7kxpyXfLDSYx0m9EBf8E-AtJRSnpVxcC52OczhI0Y",
            "title": "Senior Software Engineer (iOS)",
            "location": "Central Singapore",
            "company": "DINDINN CORPORATION PTE. LTD.",
            "salary": "$11,000 - $18,500 per month",
            "description": "Roles & ResponsibilitiesWe are inviting individuals who share our values of constantly doing things that make sense, willing to face challenges, making necessary sacrifices, and adapt to changes. Your primary focus will be to maintain existing iOS code base (written in Swift 2, Swift 3, Swift 4, Objective-C), develop iOS applications and integrate with backend services. You are expected to have strong knowledge of all iOS programming languages and to keep up with innovations and trends within iOS developer community. You are also expected to write Unit Test and UI Test. You will be working with a talented team to design and build the next generation of mobile applications. Therefore, a commitment to overcome difficult challenges, create sophisticated designs and produce quality products with precision are essential. Responsibilities:   Designing and building applications for the iOS platform using Swift.  Maintain existing applications written in Swift and Objective-C.  Collaborating with cross-functional teams to define, design and ship new features.  Help maintain code quality, organization and automation.  Unit-test code for robustness including edge cases and general reliability.  Develop end-to-end integration testing to guarantee application usability and reduce regression.  Identify and improve performance bottlenecks.  Troubleshoot and correct bugs.  Continuously discover, evaluate and implement new technologies to maximize development efficiency.  Requirements:   Proven working experience in software development.  Extensive working experience in iOS development.  Have published one or more iOS apps in the App Store.  Highly proficient with Objective-C and Swift.  Highly proficient with Git.  Extensive experience in iOS libraries such as Core Data, UIKit, CoreAnimation, AFNetworking, Alamofire, Realm and etc.  Extensive experience in offline storage, threading and performance tuning.  Extensive experience in RESTful APIs to connect iOS applications to backend services.  Extensive experience in cloud message APIs (FCM and APN) and push notifications.  Experience in TDD, Unit Testing and UI Testing.  Experience in performance and memory tuning with tools.  Understanding of different application architectures such as MVC, MVVM, VIPER.  Familiar with Apple design principles.  Familiar with C-based libraries is advisable.  Familiar with continuous integration.  Qualifications:   3 years+ work experience in mobile application, website related developments (showing project references from the past will be very helpful).  Have successfully designed, developed, tested, implemented, submitted and released mobile applications to Apple App Store.  Have successfully designed, developed, tested and implemented websites.  A self-motivated, detail-oriented individual who has critical analytical thinking.  Highly resourceful team player with the ability to also work independently.  Positive personality with a can-do attitude.  Requirements",
            "infoSource": "Mycareersfuture SG",
            "postDate": "About 5 hours ago",
            "crawlerCreateDate": "1616683914311"
        },
        {
            "link": "https://sg.jobsdb.com/job/Java-Software-Engineer-41eb4dd16c5d265c30d4794f6beda6d8?from_url=https%3A%2F%2Fsg.jobsdb.com%2Fj%3Fa%3D24h%26jt%3D3%26l%3DSingapore%26q%3Dfront%2Bend%2Bdeveloper%26sp%3Dfacet_listed_date%26p%3D6&sfjt=3&sl=Singapore&sol_srt=e51108a6-a6b2-41c8-8f77-eb31b7763cc7&sp=serp&sponsored=false&sq=front+end+developer&sr=52&tk=7kxpyXfLDSYx0m9EBf8E-AtJRSnpVxcC52OczhI0Y",
            "title": "Java Software Engineer",
            "location": "Central Singapore",
            "company": "RECRUIT EXPRESS PTE LTD",
            "salary": "",
            "description": "Job Title: Java Software Engineer  Location: CentralPay: $5000 - $7500 Working Hours: Office hours Responsibilities:  Identifying and analyzing user requirements Design, develop and deploy software applications Enhance and maintain existing applications Any other ad-hoc duties as instructed by your supervisor  Requirements:  Candidate must possess at least a Diploma in Computer Science/Information Technology or equivalent At least 2 years of expereince in software development is required Expertise in Java and Spring is required Experience in Oracle Db and Rest API is a plus  Interested applicants, please Email , and attention to: Justin Goh Kheng Zhong[email protected] recruitexpress. com. sgRecruit Express Pte LtdEA License No. 99C4599 CEI Registration No. R2196400 We regret that only shortlisted candidates will be contacted.",
            "infoSource": "Jobstreet SG",
            "postDate": "About 17 hours ago",
            "crawlerCreateDate": "1616683914674"
        },
        {
            "link": "https://sg.jobsdb.com/job/Software-Technical-Consultant-61818cddaa71fe03f46088bf282182a0?from_url=https%3A%2F%2Fsg.jobsdb.com%2Fj%3Fa%3D24h%26jt%3D3%26l%3DSingapore%26q%3Dfront%2Bend%2Bdeveloper%26sp%3Dfacet_listed_date%26p%3D6&sfjt=3&sl=Singapore&sol_srt=e51108a6-a6b2-41c8-8f77-eb31b7763cc7&sp=serp&sponsored=false&sq=front+end+developer&sr=53&tk=7kxpyXfLDSYx0m9EBf8E-AtJRSnpVxcC52OczhI0Y",
            "title": "Software Technical Consultant (SharePoint)",
            "location": "Central Singapore",
            "company": "COENS ENERGY PTE LTD",
            "salary": "",
            "description": "The specific responsibilities that relate to this role include but are not limited to:  Take the technical consultant role for maintenance projects, using Microsoft SharePoint technologies. Responsible for all kinds of inquiries, requests, tickets, incidents, bugs… from clients. Work closely with clients to gather and understand the requirements. Review requirement specs andThe specific responsibilities that relate to this role include but are not limited to: get confirmation from clients Work with offshore development team to come up with the proposed design/solution based on the system requirements. Work with offshore development team to come up with the proposed design/solution based on the requests/inquiries/bugs/incidents reported from clients. Conduct technical discussion with clients to present proposed design, and confirm detailed technical solution for the system. Develop and test key modules especially those related to interfaces between different systems. Review source code developed by team members, and provide comments / suggestions for correction & improvement where necessary. Review software packages released from the development team, and support deployment these packages to UAT/Staging/Prod environments. Perform SIT, UAT Troubleshoot and resolve issues occur during SIT, UAT, or on Production. Execute the performance test, penetration test. Execute data migration (if required) and verify.  General Experience:  Minimum of 3+ years of overall software development experience. Microsoft SharePoint technology/development experience; 2+ years (experience with SharePoint 2010 to 2016). 1+ years experiance working with maintenance projects Problem solving, issue troubleshooting.  Soft Skills:  Professional and consultative mindset with commitment for excellent customer service. Excellent interpersonal and English communication skills (both written and oral). Ability to come up with creative solutions for ambiguous problems and learn quickly.  Please note that due to the volume of applications we are receiving, only shortlisted candidates will be notified.",
            "infoSource": "Jobstreet SG",
            "postDate": "About 17 hours ago",
            "crawlerCreateDate": "1616683915047"
        },
        {
            "link": "https://sg.jobsdb.com/job/SEO-Engineer-979c083c522d3529e822a67bda719f60?from_url=https%3A%2F%2Fsg.jobsdb.com%2Fj%3Fa%3D24h%26jt%3D3%26l%3DSingapore%26q%3Dfront%2Bend%2Bdeveloper%26sp%3Dfacet_listed_date%26p%3D6&sfjt=3&sl=Singapore&sol_srt=e51108a6-a6b2-41c8-8f77-eb31b7763cc7&sp=serp&sponsored=false&sq=front+end+developer&sr=54&tk=7kxpyXfLDSYx0m9EBf8E-AtJRSnpVxcC52OczhI0Y",
            "title": "SEO Engineer",
            "location": "Paya Lebar",
            "company": "Nuffield Dental Holdings Pte Ltd",
            "salary": "",
            "description": "Roles & Responsibilities To fuel our customers’ growth in the digital arena, we are hunting for committed, SEO specialists to join our team. If you like working in a fast-paced and highly entrepreneurial environment, and have a “whatever-it-takes” attitude towards meeting company and team goals, we want you. Responsibilities ·        Develop, plan and implement effective SEO strategies for customers with the purpose of improving search engine organic traffic and search engine ranking. ·        Execute SEO strategies and SEO implementations. ·        Prepare SEO reports on a fortnightly and monthly basis to be shared with the client and identifying areas for improvement. ·        Use a variety of tools, competitive research and other methods to discover optimal keyword targets appropriate to the business needs of the client. ·        Oversee SEO campaigns which encompass technical auditing and onsite SEO implementation, link outreach and content development. ·        Work with a team of SEO specialists, content writers, campaign managers, designers, developers and sales team. ·        Format reports and provides top-line insights for on-going performance reviews. ·        Able to demonstrate an understanding of how duplicate content and page load speed affects SEO by advising clients on best practices for successful implementation and improvement. ·        Analyze backlinks to client and competitor sites to identify outdated links, 404s, incorrect redirects, or opportunities for competitive improvement. ·        Demonstrate a hunger to stay abreast of the latest industry developments, and factor these into your day to day work. ·        Understand metrics and KPIs and continually suggest optimisations to improve performance ·        Apply, and be able to explain, SEO best practices for site navigation, bread-crumbing, internal links (including anchor text optimisation), and HTML sitemaps to client websites. ·        Apply, and be able to explain, SEO best practices for domain, sub-domain and directory structure to client websites. ·        Monitor clients site regularly for crawling and indexing issues. Issues identified will be surfaced to the respective campaign manager, documented for client communication/follow-up. ·   Basic Criteria ·        Minimum of 3 years relevant, hands-on SEO experience. ·        Experience using SEO tools. ·        Solid knowledge of search engine spider, crawl and indexing process, while understanding the importance of XML sitemaps, robots.txt files, status code errors fix. ·        Able to produce high-quality work within a fast-paced, dynamic environment. ·        Excellent verbal and written communication skills. ·        Has a strong familiarity with the web development process, including the important points at which SEO must be considered. ·        Understanding of Google Analytics and Google Search Console metrics. ·        Developing knowledge of client’s business, competition and latest industry news and trends. ·        Effective time management skills with an ability to multitask and prioritise ·        Strong attention to detail ·        Ability to present and communicate ideas in a coherent and effective manner",
            "infoSource": "Jobstreet SG",
            "postDate": "About 17 hours ago",
            "crawlerCreateDate": "1616683915497"
        },
        {
            "link": "https://sg.jobsdb.com/job/Software-Developer-67fa4a1b662d1797b04e3692a038f6d8?from_url=https%3A%2F%2Fsg.jobsdb.com%2Fj%3Fa%3D24h%26jt%3D3%26l%3DSingapore%26q%3Dfront%2Bend%2Bdeveloper%26sp%3Dfacet_listed_date%26p%3D6&sfjt=3&sl=Singapore&sol_srt=e51108a6-a6b2-41c8-8f77-eb31b7763cc7&sp=serp&sponsored=false&sq=front+end+developer&sr=55&tk=7kxpyXfLDSYx0m9EBf8E-AtJRSnpVxcC52OczhI0Y",
            "title": "Software Developer (C# / VB.net / Asp.net)",
            "location": "Singapore",
            "company": "TRUST RECRUIT PTE. LTD.",
            "salary": "",
            "description": " Job Responsibilities: Deliver results on configured timelines; Work on Windows applications in VB.NET and SQL database Works with a team of developers. Design, Develop & Implement cloud-based product Report to technical lead  Requirements:  A Degree or Diploma qualification in Computer Science / Information Systems or related experience. At least 2 or 3 years of experience in software development and hands-on programming. Familiar with .NET Core Framework and MySQL Familiar with React JS will be an advantage Able to pick up new technology, programming language quickly. Must be independent and possesses good communication skills. Strong troubleshooting and analytical skills.   HOW TO APPLY: Interested applicants, kindly send your resume in MS WORD format to ****@trustrecruit.com.sg or please click on “Apply Now” and provide the below details in your resume.We regret only shortlisted candidates will be notified.Important Note: Trust Recruit Pte Ltd is committed to safeguarding your personal data in accordance with the Personal Data Protection Act (PDPA).Please read our privacy statement on our corporate website www.trustrecruit.com.sg.Trust Recruit Pte LtdEA License No: 19C9950EA Personnel: Tiew Hong Wei (Ronnie)EA Personnel Reg No: R1981870 ",
            "infoSource": "Jobstreet SG",
            "postDate": "About 17 hours ago",
            "crawlerCreateDate": "1616683915847"
        },
        {
            "link": "https://sg.jobsdb.com/job/Senior-Systems-Analyst-40363ba692df0489bc4615281abe914a?from_url=https%3A%2F%2Fsg.jobsdb.com%2Fj%3Fa%3D24h%26jt%3D3%26l%3DSingapore%26q%3Dfront%2Bend%2Bdeveloper%26sp%3Dfacet_listed_date%26p%3D6&sfjt=3&sl=Singapore&sol_srt=e51108a6-a6b2-41c8-8f77-eb31b7763cc7&sp=serp&sponsored=false&sq=front+end+developer&sr=56&tk=7kxpyXfLDSYx0m9EBf8E-AtJRSnpVxcC52OczhI0Y",
            "title": "Senior Systems Analyst (Java/J2ee)",
            "location": "West Singapore",
            "company": "People Profilers (Executive Search) Pte Ltd",
            "salary": "",
            "description": "Job Duties and Responsibilities: Assist in project management and co-ordinate with vendors to ensure smooth systems implementation. Conduct requirement studies, detailed systems analysis and design, and systems testing of new systems and system enhancements. Develop test specification and perform testing (Test Specialist Role). Perform application support lead role: Project or Tech Lead in change management and ensure changes to IT systems are delivered on schedule. Conduct impact analysis on application changes. Analyse and troubleshoot application problem. Implement system software changes.   Perform project manager role: To ensure project is successfully delivered to meet user requirements. Manage stakeholders for project success. Perform Business Analyst role to implement business process innovation and change.   Job Specifications Degree in computer science, computer engineering or information technology. At least 2 years of software development (Java technologies) environment. Knowledge of the following skillset is preferred: Front end UI / UX: JavaScript/HTML5/CSS3 Angular   Backend development: Java 8 Spring Framework/Spring Boot   Database:Oracle  Build Tools: Maven Ant   Agile/Scrum Development Methodology At least 1 year project management experience. Preferably experience in logistics or port operations industry. Highly resourceful individual who is proactive in asking and understanding the business needs. Possess strong analytical skills. An effective team player and able to work independently. Ability to communicate effectively in both spoken and written English.  We regret that only shortlisted candidates will be notifiedInterested applicants please send your updated resume to ********@peopleprofilers.com quoting Job ID: 8R7YXV Noga Lim Wei LoongRegistration Number: R1329872EA License Number: 10C3804People Profilers Pte Ltd, 11 Collyer Quay, The Arcade, #13-01, Singapore 049317http://www.peopleprofilers.com  ",
            "infoSource": "Jobstreet SG",
            "postDate": "About 17 hours ago",
            "crawlerCreateDate": "1616683916203"
        },
        {
            "link": "https://sg.jobsdb.com/job/Application-Developer-c92a5e840b9713c14d094a67d26f6334?from_url=https%3A%2F%2Fsg.jobsdb.com%2Fj%3Fa%3D24h%26jt%3D3%26l%3DSingapore%26q%3Dfront%2Bend%2Bdeveloper%26sp%3Dfacet_listed_date%26p%3D6&sfjt=3&sl=Singapore&sol_srt=e51108a6-a6b2-41c8-8f77-eb31b7763cc7&sp=serp&sponsored=false&sq=front+end+developer&sr=57&tk=7kxpyXfLDSYx0m9EBf8E-AtJRSnpVxcC52OczhI0Y",
            "title": "Application Developer (Hybrid Mobile App/ iOS/ Andriod/ Training Provided)",
            "location": "Singapore",
            "company": "TRUST RECRUIT PTE. LTD.",
            "salary": "",
            "description": "Responsibilities:  To develop hybrid mobile applications (both IOS & Android) using ionic and react native Participate in the full mobile application development life cycle including: technical design, development & implementation, testing, documentation and support Work in a team or independant on projects assigned Ensure all codes are in compliance to industry standards Test and optimise the user interface and functions of the all Apps  Requirements:  A degree/ diploma, preferably in Computer Science, Information Technology, Information Systems, Info-communications or Engineering Possess experience in developing iOS and/or Android mobile applications At least 1 - 2 years of relevant experience Experience in third party system integration such as payment gateway, google api, facebook api Experience in publishing mobile applications in Google Play and iTunes Experience in web development such as PHP/mySQL/Javacript/CSS/HTML preferred  HOW TO APPLY:Interested applicants, kindly send your resume in MS WORD format to ****@trustrecruit.com.sg or please click on “Apply Now” and provide the below details in your resume.1. Reasons for leaving ALL your employment2. Current and/or last drawn monthly salary (please provide breakdown)3. Expected monthly salary4. AvailabilityWe regret only shortlisted candidates will be notified.Important Note: Trust Recruit Pte Ltd is committed to safeguarding your personal data in accordance with the Personal Data Protection Act (PDPA).Please read our privacy statement on our corporate website www.trustrecruit.com.sg.Trust Recruit Pte LtdEA License No: 19C9950EA Personnel: Wang Chun JinEA Personnel Reg No: R1871708",
            "infoSource": "Jobstreet SG",
            "postDate": "About 17 hours ago",
            "crawlerCreateDate": "1616683916564"
        },
        {
            "link": "https://sg.jobsdb.com/job/Lead-Systems-Engineer-dfd6487e0c831a0a63aecf14c9aac997?from_url=https%3A%2F%2Fsg.jobsdb.com%2Fj%3Fa%3D24h%26jt%3D3%26l%3DSingapore%26q%3Dfront%2Bend%2Bdeveloper%26sp%3Dfacet_listed_date%26p%3D6&sfjt=3&sl=Singapore&sol_srt=e51108a6-a6b2-41c8-8f77-eb31b7763cc7&sp=serp&sponsored=false&sq=front+end+developer&sr=58&tk=7kxpyXfLDSYx0m9EBf8E-AtJRSnpVxcC52OczhI0Y",
            "title": "Lead Systems Engineer (Finance Start-Up)",
            "location": "Central Singapore",
            "company": "Bearing Search Pte. Ltd.",
            "salary": "",
            "description": "Our client is a Finance Start-Up - a joint venture between 3 major and established Financial Institutions in today's market.  This pioneer member will work collarborately with the IT teams of the partner companies to develop the platform and system for this start-up Experience with the technologies in Financial markets/exchange systems Proficient in Open source technologies, Databases and working with vendors in application development and implementation Attractive developmental and progression opportunities  Responsibilities   Responsible for the Planning; Project Support and Deployments; Systems Administration; and Operations Support to ensure that systems and applications performance meets expectations. Establish and improve the strategy for the governance of user requirements and adherence to design principles and standards. Involve in troubleshooting and implementation of solutions for issues identified. Identify business development opportunities by understanding the current and future requirements of the internal and external business users. Estimate resource requirements and evaluate prioritisation metrics for projects according to the Business priorities. Assist in preparation and execution of Tenders for external vendors. Provide training to internal and/or external users in area of applications; logic and processes; standards; and technology. Assist in projects supervision and report preparation to meet the expectations set by the Management Team. Hardware (firmware)/ Software Version upgrade, patch fixes, security updates feasibility study and recommendation (inclusive of testing, change management and rollout) Manage Systems Disaster Recovery Plan and Business Continuity Plan procedures Ensure that the Production/DR and UAT/Test environments are in sync in terms of setup, configuration, and data (where applicable) Identify the risks and provide/review risk mitigating measures associated with the technical solutions and the migration plan Identify the dependencies and interfaces between systems, networks, applications and databases to meet the applications and systems Service Level Agreements (SLA) Perform systems heath checks, maintain and up-keep monitoring systems to proactively identify potential issues Support periodic audit review exercises by providing the required information and to perform the remediation actions to close all audit findings  Ideal candidate  Experience in implementation and hands-on support of multi-tier data protection techniques for databases (eg Oracle data replication or AWS solutions) Familiarity with Open Source technologies (incl. for Red Hat Linux for Operating System and MariaDB for database), LifeRay, Angular for the front-end tech stack , Blockchain concepts and fabrics (e.g. Ethereum, Hyperledger) and usage of APIs would be a plus Minimum 3 years’ hands-on operations work in setting up databases with application interfaces Hands-on experience in implementing security setup and controls on mission-critical databases Working knowledge and ability to understand and write scripts E.g. JAVA, UNIX shell Working knowledge of enterprise OS (eg UNIX), DRP (disaster recovery plan); BCP (business continuity plan) Good understanding of the SDLC (System Development Life Cycle) concept and Agile Methodology ITIL certified  ** We regret to inform that only shortlisted candidates will be notified ",
            "infoSource": "Jobstreet SG",
            "postDate": "About 17 hours ago",
            "crawlerCreateDate": "1616683916971"
        },
        {
            "link": "https://sg.jobsdb.com/job/Data-Engineer-6c3bbd520eb291c3a69fa78739f9b14a?from_url=https%3A%2F%2Fsg.jobsdb.com%2Fj%3Fa%3D24h%26jt%3D3%26l%3DSingapore%26q%3Dfront%2Bend%2Bdeveloper%26sp%3Dfacet_listed_date%26p%3D6&sfjt=3&sl=Singapore&sol_srt=e51108a6-a6b2-41c8-8f77-eb31b7763cc7&sp=serp&sponsored=false&sq=front+end+developer&sr=59&tk=7kxpyXfLDSYx0m9EBf8E-AtJRSnpVxcC52OczhI0Y",
            "title": "Data Engineer (Data Analytics) - Contract",
            "location": "Bishan",
            "company": "SMRT Trains Ltd",
            "salary": "",
            "description": " Job Purpose: We are looking for an experienced data engineer to join our rapidly growing data team. You will be joining the team at an early stage of data warehouse development and your contributions will influence key design choices for the data warehouse. The role will require you to work with data owners to build data ingestion pipelines, construct data models for the warehouse and to maintain the operational stability of processes created. You will also work with data end users to expose data as required by decision support tools. Overall, you will strive for excellence by aligning the data systems created with business goals presented. Responsibilities:The duties and responsibilities are listed below. The list is not comprehensive and related duties and responsibilities may be assigned from time to time. Understand the data landscape to formulate and complete end-to-end data strategy that includes data gathering, data processing, analysis, ongoing scaled deliverables, and presentations to facilitate decision-making and forward planning. Identify opportunities for data acquisition, work with system owners to automate data connection. Analyse and organize raw data, combine raw information from different sources, build data systems and data pipelines, perform extract transform and load (ETL) to prepare data for prescriptive and predictive modeling. Build algorithms and prototypes, explore ways to enhance data quality and reliability; Develop analytical tools and programs Collaborate with data scientists and architects on several projects  Requirement:  Tertiary qualification with experience in data engineering or in a similar role Experience in enterprise scale data migration and/or integration Hands-on experience working with Azure Data Factory & SQL Server Integration Service with SAP, IBM or Microsoft SaaS and/or PaaS data sources Data engineering certification is a plus Experience in building a data system front-end is a plus   Technical skills include: Strong analytical skills with the ability to collect, clean, organise, analyse, and disseminate significant amounts of information with attention to detail and accuracy Ability to understand and explain complex data and effective working as a liaison between technical and non-technical groups Technical expertise with data models, data mining, and segmentation techniques Hands-on experience with SQL database design Advanced knowledge of SQL is required and familiarity with other languages (C#/.NET, Python, Java, JavaScript) is a plus Great numerical and analytical skills, experience with data visualisation tools such as Power BI, Tableau, Qliksense, etc. would be an advantage  Generic skills include:  Detail-oriented, with excellent organizational skills and experience Critical thinker and problem-solving skills Team player Good time-management skill Great interpersonal and communication skills   ",
            "infoSource": "Jobstreet SG",
            "postDate": "About 17 hours ago",
            "crawlerCreateDate": "1616683917345"
        },
        {
            "link": "https://sg.jobsdb.com/job/Software-Developer-3f678be2873a28fb53a1ad987adcd874?from_url=https%3A%2F%2Fsg.jobsdb.com%2Fj%3Fa%3D24h%26jt%3D3%26l%3DSingapore%26q%3Dfront%2Bend%2Bdeveloper%26sp%3Dfacet_listed_date%26p%3D6&sfjt=3&sl=Singapore&sol_srt=e51108a6-a6b2-41c8-8f77-eb31b7763cc7&sp=serp&sponsored=false&sq=front+end+developer&sr=60&tk=7kxpyXfLDSYx0m9EBf8E-AtJRSnpVxcC52OczhI0Y",
            "title": "Senior / Software Developer (Backend / Java)",
            "location": "West Singapore",
            "company": "TRUST RECRUIT PTE. LTD.",
            "salary": "",
            "description": "  Java Backend Banking / Finance Industry  Responsibilities:  Work with highly collaborative teams to build high quality code Contribute to all project phases: from design to deployment Design and develop software features requested by the product manager Religiously practice Agile methodologies and DevOps principles, to ensure all development have been properly tested in compliance to design and functional specifications  Requirements:  Candidate must possess at least a bachelor’s degree in Engineering, Computer Science/Information Technology, Mathematics or equivalent. At least possess 3 years of relevant working experience in software development of business application systems Minimum 3 years hands-on experience in software development using Java language Experience in web development using HTML, CSS, WebSocket and JavaScript Experience working under agile development model Strong development, analytical and problem-solving skill Experience working on AWS cloud platform is a plus Familiarity with one or more systems among Bitbucket, JIRA, Confluence, Nexus and SonarQube is a plus  HOW TO APPLY:Interested applicants, kindly send your resume in MS WORD format to ****@trustrecruit.com.sg or please click on “Apply Now”. We regret only shortlisted candidates will be notified. Important Note: Trust Recruit Pte Ltd is committed to safeguarding your personal data in accordance with the Personal Data Protection Act (PDPA).Please read our privacy statement on our corporate website www.trustrecruit.com.sg. Trust Recruit Pte LtdEA License No: 19C9950EA Personnel: Tiew Hong Wei (Ronnie)EA Personnel Reg No: R1981870 ",
            "infoSource": "Jobstreet SG",
            "postDate": "About 17 hours ago",
            "crawlerCreateDate": "1616683917710"
        },
        {
            "link": "https://sg.jobsdb.com/job/rd/b5fd7d49236daac10653d7fe47a9e7a1?sp=sserp_bottom&sponsored=true&sr=53&tk=7kxpyXfLDSYx0m9EBf8E-AtJRSnpVxcC52OczhI0Y",
            "title": "",
            "location": "",
            "company": "",
            "salary": "",
            "description": "",
            "infoSource": "",
            "postDate": "",
            "crawlerCreateDate": "1616683918507"
        },
        {
            "link": "https://sg.jobsdb.com/job/rd/25c508cecb4a7a7ce3d19d9f22d8178b?sp=sserp_bottom&sponsored=true&sr=54&tk=7kxpyXfLDSYx0m9EBf8E-AtJRSnpVxcC52OczhI0Y",
            "title": "",
            "location": "",
            "company": "",
            "salary": "",
            "description": "",
            "infoSource": "",
            "postDate": "",
            "crawlerCreateDate": "1616683919260"
        },
        {
            "link": "https://sg.jobsdb.com/job/rd/7e5d9cfe2a9b170a0f826d7559345742?sp=sserp_bottom&sponsored=true&sr=55&tk=7kxpyXfLDSYx0m9EBf8E-AtJRSnpVxcC52OczhI0Y",
            "title": "",
            "location": "",
            "company": "",
            "salary": "",
            "description": "",
            "infoSource": "",
            "postDate": "",
            "crawlerCreateDate": "1616683919939"
        },
        {
            "link": "https://sg.jobsdb.com/job/rd/4bbd021ad0755cee1af623c5af47f85f?sp=sserp_top&sponsored=true&sr=61&tk=XpMnRM8oUyRxi8WxJn7L-JtgKA_T28Wj3IutMm3KX",
            "title": "",
            "location": "",
            "company": "",
            "salary": "",
            "description": "",
            "infoSource": "",
            "postDate": "",
            "crawlerCreateDate": "1616683920508"
        },
        {
            "link": "https://sg.jobsdb.com/job/rd/1d6a9c4dcea17fc30f520e1750a1d16f?sp=sserp_top&sponsored=true&sr=62&tk=XpMnRM8oUyRxi8WxJn7L-JtgKA_T28Wj3IutMm3KX",
            "title": "",
            "location": "",
            "company": "",
            "salary": "",
            "description": "",
            "infoSource": "",
            "postDate": "",
            "crawlerCreateDate": "1616683921698"
        },
        {
            "link": "https://sg.jobsdb.com/job/Software-Developer-021bb1e407689ed214321ef682b8b693?from_url=https%3A%2F%2Fsg.jobsdb.com%2Fj%3Fa%3D24h%26jt%3D3%26l%3DSingapore%26q%3Dfront%2Bend%2Bdeveloper%26sp%3Dfacet_listed_date%26p%3D7&sfjt=3&sl=Singapore&sol_srt=1965a836-74a9-4620-a6b5-bc4cdb6d3a7b&sp=serp&sponsored=false&sq=front+end+developer&sr=61&tk=XpMnRM8oUyRxi8WxJn7L-JtgKA_T28Wj3IutMm3KX",
            "title": "Software Developer (iOS)",
            "location": "Central Singapore",
            "company": "DINDINN CORPORATION PTE. LTD.",
            "salary": "$3,500 - $6,000 per month",
            "description": "Roles & ResponsibilitiesWe are inviting individuals who share our values of constantly doing things that make sense, willing to face challenges, making necessary sacrifices, and adapt to changes. Your primary focus will be to maintain existing iOS code base (written in Swift 2, Swift 3, Swift 4, Objective-C), develop iOS applications and integrate with backend services. You are expected to have strong knowledge of all iOS programming languages and to keep up with innovations and trends within iOS developer community. You are also expected to write Unit Test and UI Test. You will be working with a talented team to design and build the next generation of mobile applications. Therefore, a commitment to overcome difficult challenges, create sophisticated designs and produce quality products with precision are essential. Responsibilities:   Designing and building applications for the iOS platform using Swift.  Maintain existing applications written in Swift and Objective-C.  Collaborating with cross-functional teams to define, design and ship new features.  Help maintain code quality, organization and automation.  Unit-test code for robustness including edge cases and general reliability.  Develop end-to-end integration testing to guarantee application usability and reduce regression.  Identify and improve performance bottlenecks.  Troubleshoot and correct bugs.  Continuously discover, evaluate and implement new technologies to maximize development efficiency.  Requirements:   Proven working experience in software development.  Extensive working experience in iOS development.  Have published one or more iOS apps in the App Store.  Highly proficient with Objective-C and Swift.  Highly proficient with Git.  Extensive experience in iOS libraries such as Core Data, UIKit, CoreAnimation, AFNetworking, Alamofire, Realm and etc.  Extensive experience in offline storage, threading and performance tuning.  Extensive experience in RESTful APIs to connect iOS applications to backend services.  Extensive experience in cloud message APIs (FCM and APN) and push notifications.  Experience in TDD, Unit Testing and UI Testing.  Experience in performance and memory tuning with tools.  Understanding of different application architectures such as MVC, MVVM, VIPER.  Familiar with Apple design principles.  Familiar with C-based libraries is advisable.  Familiar with continuous integration.  Qualifications:   3 years+ work experience in mobile application, website related developments (showing project references from the past will be very helpful).  Have successfully designed, developed, tested, implemented, submitted and released mobile applications to Apple App Store.  Have successfully designed, developed, tested and implemented websites.  A self-motivated, detail-oriented individual who has critical analytical thinking.  Highly resourceful team player with the ability to also work independently.  Positive personality with a can-do attitude.  Requirements",
            "infoSource": "Mycareersfuture SG",
            "postDate": "About 5 hours ago",
            "crawlerCreateDate": "1616683922159"
        },
        {
            "link": "https://sg.jobsdb.com/job/Business-Development-Sale-Executive-ad3bb42dc25208867a39be779b2d9e28?from_url=https%3A%2F%2Fsg.jobsdb.com%2Fj%3Fa%3D24h%26jt%3D3%26l%3DSingapore%26q%3Dfront%2Bend%2Bdeveloper%26sp%3Dfacet_listed_date%26p%3D7&sfjt=3&sl=Singapore&sol_srt=1965a836-74a9-4620-a6b5-bc4cdb6d3a7b&sp=serp&sponsored=false&sq=front+end+developer&sr=62&tk=XpMnRM8oUyRxi8WxJn7L-JtgKA_T28Wj3IutMm3KX",
            "title": "Business Development Sale Executive",
            "location": "Boon Lay",
            "company": "KMAC INTERNATIONAL PTE. LTD.",
            "salary": "$2,500 - $3,500 per month",
            "description": "Roles & ResponsibilitiesJob Scopes   Generate leads and follow-up for closure  On site appointment with customer  Follow-up on closure  Drafting of contract agreement  Finalizing the details with customer and proceed to inform relevant department on the start date  Manage company’s social media platform such as Facebook, Instagram, Website and additional channels that may deemed relevant.  Deliver results using various marketing channels via Display Ads, Facebook Ads, Google Ad Words, PPC and SEO/SEM.  Guide concept and design of visual collateral, e.g. EDMs, Facebook ads, display ads, websites, videos.  Organised and plan photoshoots for new product/service releases or ad campaigns.  Attend to customer’s enquiries on social media platform and maintain exposure for the company.  Monitor competitors’ activities and perform market research.  Ad hoc duties assigned  Job Requirements:   Proactive in generating sales and revenue for company  Able to work independently and together as a team  Respond to customer enquiry and manage situations  Drafting and sending contract to customer for signature  Creative eye for design  Meticulous & Independent problem-solving skills  Highly committed and have a proactive, ‘can-do’ attitude.  Strong communication and interpersonal skills  Candidate must possess at least Professional Certificate/NiTEC or Diploma/Advanced/Higher/Graduate Diploma in Marketing or equivalent  At least 2 Year(s) of working experience in the related field is required for this position.  Required language(s): Fluent in speaking and writing in English and Chinese (Good written and verbal communication skills in English and Chinese to attend to English and Chinese customer’s enquiries on social media platform and maintain exposure for the company.)  Knowledge in Google ads words and content writing, Wordpress web development and content management, Adobe Photoshop/ Illustrator, Video Editing.  Requirements",
            "infoSource": "Mycareersfuture SG",
            "postDate": "About 5 hours ago",
            "crawlerCreateDate": "1616683922544"
        },
        {
            "link": "https://sg.jobsdb.com/job/Senior-Network-Test-Engineer-3371b41a086ecfc28502b43be2d62c2a?from_url=https%3A%2F%2Fsg.jobsdb.com%2Fj%3Fa%3D24h%26jt%3D3%26l%3DSingapore%26q%3Dfront%2Bend%2Bdeveloper%26sp%3Dfacet_listed_date%26p%3D7&sfjt=3&sl=Singapore&sol_srt=1965a836-74a9-4620-a6b5-bc4cdb6d3a7b&sp=serp&sponsored=false&sq=front+end+developer&sr=63&tk=XpMnRM8oUyRxi8WxJn7L-JtgKA_T28Wj3IutMm3KX",
            "title": "Senior Network Test Engineer (1202)",
            "location": "Ang Mo Kio",
            "company": "ST ENGINEERING IDIRECT (APAC) PTE. LTD.",
            "salary": "$4,000 - $5,500 per month",
            "description": "Roles & ResponsibilitiesJob Description   Design, develop, and document test plans for iDirect products.  Coordinate and participate in use case testing activities including test planning, execution, and reporting, documentation of e.g. test results, test reports  Perform setup of network and test scenarios, both hardware and software components, and perform troubleshooting as needed.  Collaborate with software developers in scrum team to execute acceptance tests and write auto test units  Evaluate and recommend third-party test tools and other software/hardware products to aid in the system test effort.  Attend and participate in system-level design meetings in order to address testing issues early in the software development process.  Create testing tools and scripts as needed  Provide training, documentation and support as required to operations staff  Lab equipment, development servers and test beds management  Other duties as assigned.  Academic Level   Degree of Computer Science, Computer Engineering or electrical engineering  Technical Knowledge and Skills   IP-based networks with a CCNA certification or equivalent working experience with switch & router configuration and tooling  2+ year working knowledge of Linux and Bash  1+ year virtualization frameworks based in OpenStack like Windriver or VMware  Understanding of IP network architecture and planning  Be familiar with IP based networking and with protocols like IP, TCP, UDP, ICMP, ARP etc.  Experience with IP router performance testing and using tools such as Spirent etc.  Ability to independently setup, troubleshoot and debug networks  Experience developing and maintaining comprehensive system test plans  Experience in test automation, be able to write test scripts in robot framework  Background in RF/ Satellite communication concepts is a bonus  People Skills   Strong problem solving skills  Must have strong interpersonal skills and be self-motivated.  Must be able to complete tasks in a timely manner.  Possess the ability to proactively drive technical solutions in a collaborative environment  Strong documentation and writing skills  Requirements",
            "infoSource": "Mycareersfuture SG",
            "postDate": "About 5 hours ago",
            "crawlerCreateDate": "1616683922961"
        },
        {
            "link": "https://sg.jobsdb.com/job/Junior-Java-Developer-b5ab49447316fb4647b53fc90d496efc?from_url=https%3A%2F%2Fsg.jobsdb.com%2Fj%3Fa%3D24h%26jt%3D3%26l%3DSingapore%26q%3Dfront%2Bend%2Bdeveloper%26sp%3Dfacet_listed_date%26p%3D7&sfjt=3&sl=Singapore&sol_srt=1965a836-74a9-4620-a6b5-bc4cdb6d3a7b&sp=serp&sponsored=false&sq=front+end+developer&sr=64&tk=XpMnRM8oUyRxi8WxJn7L-JtgKA_T28Wj3IutMm3KX",
            "title": "Junior Java Developer",
            "location": "Singapore",
            "company": "VOLT",
            "salary": "",
            "description": "Junior Java Software Developer - Singapore This is a Java development role for junior to mid level candidates. This is a two year contract position that can be converted to a perm role. The salary range for this position is $3500 - $5800. A Brief Job Overview  You'll be primarily working on Java related projects for government agencies and clients Analyze, design, program, test, document and maintain IT systems or applications Provide maintenance support to customers (internal and/or external) by investigating and rectifying reported systems shortcomings. Perform and manage stages of the SDLC and participate in the systems review with Project Lead/Manager. Design and document system design, architecture and propose appropriate technologies and tools required to implement systems Deploy systems to production and provide post-implementation support  Ideal Qualifications  Experience with Java development Experience/knowledge of the following: Spring, Hibernate, or Angular  The Interview Process  Initial screening (expect a call within a day or two if you're the right fit) An online coding assessment Video interview with the hiring manager  What Makes This Exciting  This role is with a company that is well known and reputable in Singapore. They have won awards for their work culture, and they have a 4+ rating on Glassdoor Fast and no nonsense application process Very stable. No hiring freezes during circuit breaker, constant work and learning. A great place to start off or continue your career.  Please send your resume in WORD format by clicking the apply button below or contact Ronald Cheung on +65 6701 1521 for a confidential discussion. Please note that only short-listed candidates will be contacted.CEI Reg. Number R2090722 (Cheung Ronald).",
            "infoSource": "Jobstreet SG",
            "postDate": "About 17 hours ago",
            "crawlerCreateDate": "1616683923375"
        },
        {
            "link": "https://sg.jobsdb.com/job/Project-Executive-fbd449b7c923e15cc99ec30755208919?from_url=https%3A%2F%2Fsg.jobsdb.com%2Fj%3Fa%3D24h%26jt%3D3%26l%3DSingapore%26q%3Dfront%2Bend%2Bdeveloper%26sp%3Dfacet_listed_date%26p%3D7&sfjt=3&sl=Singapore&sol_srt=1965a836-74a9-4620-a6b5-bc4cdb6d3a7b&sp=serp&sponsored=false&sq=front+end+developer&sr=65&tk=XpMnRM8oUyRxi8WxJn7L-JtgKA_T28Wj3IutMm3KX",
            "title": "Project Executive",
            "location": "Central Singapore",
            "company": "ALPHAWAVE TECHNOLOGY (S) PTE LTD",
            "salary": "$2,000 - $4,500 per month",
            "description": "Roles & ResponsibilitiesJOB OVERVIEW We are looking for an individual who likes challenges, is detailed-oriented and gets satisfaction from taking ownership of his/her work. The Project Executive has ultimate responsibility for the project and ‘owns’ the Business Case throughout the life of the project. If that sounds like you, join us! DUTIES & RESPONSIBLITIES · Prepare resources for Projects and complete all reporting in accordance with the timeline and Project policy. · Responsible for implementation and tracking development schedules to ensure the project is delivered on time and within the budget. · Plan and utilize resources to maximize efficiency and effectiveness. · Working closely with Project Consultants to assist in every step of implementation. · Monitor short and long-term projects. · Design management standards for various business units and prepare training programs for project handovers. · Maintain all system protocols according to requirements. · Conduct sales meetings with potential clients and prepare proposals and presentations. · Understand clients’ needs and proactively look out for business opportunities. QUALIFICATIONS AND REQUIREMENTS · Candidates must possess a Degree in Computer Science/Information Technology or related field. · IT professionals with at least one (1) year experience in Software Implementation/Project Management preferred. · Experience in handling software application projects. · Familiar with Project Management methodologies. · Strong understanding of web development, UX/UI, cross-browser compatibility, general web functions and standards. · Knowledgeable in relation database systems and web application development. · Possess strong written, oral communication and problem-solving skills. Requirements",
            "infoSource": "Mycareersfuture SG",
            "postDate": "About 5 hours ago",
            "crawlerCreateDate": "1616683923827"
        },
        {
            "link": "https://sg.jobsdb.com/job/Manager-b7e7e5b3a1781de13df54bc7a5a0300c?from_url=https%3A%2F%2Fsg.jobsdb.com%2Fj%3Fa%3D24h%26jt%3D3%26l%3DSingapore%26q%3Dfront%2Bend%2Bdeveloper%26sp%3Dfacet_listed_date%26p%3D7&sfjt=3&sl=Singapore&sol_srt=1965a836-74a9-4620-a6b5-bc4cdb6d3a7b&sp=serp&sponsored=false&sq=front+end+developer&sr=66&tk=XpMnRM8oUyRxi8WxJn7L-JtgKA_T28Wj3IutMm3KX",
            "title": "Manager- Performance Marketing",
            "location": "Punggol",
            "company": "GLOBAL INDIAN INTERNATIONAL SCHOOL PTE. LTD.",
            "salary": "$6,000 - $8,000 per month",
            "description": "Roles & Responsibilities  Setup new campaigns from scratch, including tag management and landing page optimization  Conduct keywords, competitors, and industries research  Analyse revenue, campaign performance, click and conversion rates, ROI, anddaily ad spend  Be heavily involved in SEO implementation projects.  Optimise accounts on a daily basis to improve campaign performance to driveKPI success and account growth.  Monitor, analyse and report performance results on a daily, weekly, or monthlybasis (as determined by the Digital marketing team and stakeholdersrequirements). ●  Work with content, SEO and web developers to develop ideal paid search & paid social campaigns to achieve the KPIs.  Develop and implement test strategies, including but not limited to: bidding, copy, positioning etc.).  Write paid search ad copy, monitor competitors, and evaluate query traffic, keyword research, and day-to-day account maintenance.  Work closely with sub-teams within the marketing and communications department to develop fully integrated campaigns.  Engage key external partners (e.g. Google, Facebook, SEO consultant/account managers) regularly for feedback on account set-ups, best practices, explore betas, synchronise efforts.  Track and report budgets and expenditure.  Effectively manage day-to-day operations and stay abreast of new trends.  Qualifications: Possesses a recognised Bachelor’s degree, preferably in Marketing. Requirements:   At least 7 years’ of hands-on experience in using Google Adwords, Facebook Business Manager for small to large scale clients with expert knowledge of SEM and Paid social.  Education industry experience will be a plus.  Preferred skill set in: HubSpot CRM, Google Tag Manager, Programmatic MediaBuy , Baidu Media buy, Yahoo Media buy.  Key skills Working knowledge of Adobe Media Optimiser, Adobe Analytics, Search 360, and any/other Facebook Marketing Partner (FMP) is a plus.   Strong understanding and working knowledge of the digital landscape including but not limited to: programmatic buying, video, display, search, social, programmatic and marketing analytics.  Analytical individual with a clear technical mindset and experience working with various data sets.  Ability to review and analyse performance and identify and report deviations and suggest solutions.  Driven, proactive and detail-oriented individual with proven technical and analytical aptitude, with a curiosity for testing and innovation.  Proficient in Microsoft Excel  Copywriting and communication skills  You are a team-player.  Requirements",
            "infoSource": "Mycareersfuture SG",
            "postDate": "About 5 hours ago",
            "crawlerCreateDate": "1616683924244"
        },
        {
            "link": "https://sg.jobsdb.com/job/Senior-Executive-bd9d23ff1235d5d6982413528b5ba624?from_url=https%3A%2F%2Fsg.jobsdb.com%2Fj%3Fa%3D24h%26jt%3D3%26l%3DSingapore%26q%3Dfront%2Bend%2Bdeveloper%26sp%3Dfacet_listed_date%26p%3D7&sfjt=3&sl=Singapore&sol_srt=1965a836-74a9-4620-a6b5-bc4cdb6d3a7b&sp=serp&sponsored=false&sq=front+end+developer&sr=67&tk=XpMnRM8oUyRxi8WxJn7L-JtgKA_T28Wj3IutMm3KX",
            "title": "Senior Executive/ Assistant Manager-Performance Marketing",
            "location": "Punggol",
            "company": "GLOBAL INDIAN INTERNATIONAL SCHOOL PTE. LTD.",
            "salary": "$4,000 - $6,000 per month",
            "description": "Roles & ResponsibilitiesResponsibilities   Setup new campaigns from scratch, including tag management and landing page optimization  Conduct keywords, competitors, and industries research  Analyse revenue, campaign performance, click and conversion rates, ROI, and daily ad spend  Be heavily involved in SEO implementation projects.  Optimise accounts on a daily basis to improve campaign performance to drive KPI success and account growth.  Monitor, analyse and report performance results on a daily, weekly, or monthly basis (as determined by the Digital marketing team and stakeholders requirements).  · Contribute to design and develop new customers acquisition and engagement campaigns. · Work with content, SEO and web developers to develop ideal paid search & paid social campaigns to achieve the KPIs. · Develop and implement test strategies, including but not limited to: bidding, copy, positioning etc.). · Write paid search ad copy, monitor competitors, and evaluate query traffic, keyword research, and day-to-day account maintenance. · Work closely with sub-teams within marketing and communications department to develop fully integrated campaigns. · Engage key external partners (e.g. Google, Facebook, SEO consultant/account managers) regularly for feedback on account set-ups, best practices, explore betas, synchronise efforts. · Track and report budgets and expenditure. · Effectively manage day-to-day operations and stay abreast of new trends. Requirements: · Possesses a recognised Bachelor’s degree, preferably in Marketing. · At least 3 years’ of hands-on experience in using Google Adwords, Facebook Business Manager for small to large scale clients with expert knowledge of SEM and Paid social. · Education industry experience will be a plus. · Preferred skill set in: HubSpot CRM, Google Tag Manager, Programmatic Media Buy , Baidu Media buy, Yahoo Media buy. · Working knowledge of Adobe Media Optimiser, Adobe Analytics, Search 360, and any/other Facebook Marketing Partner (FMP) is a plus. · Strong understanding and working knowledge of the digital landscape including but not limited to: programmatic buying, video, display, search, social, programmatic and marketing analytics. · Analytical individual with a clear technical mindset and experience working with various data sets. · Ability to review and analyse performance and identify and report deviations and suggest solutions. · Driven, proactive and detail-oriented individual with proven technical and analytical aptitude, with a curiosity for testing and innovation. · Proficient in Microsoft Excel · Copywriting and communication skills · You are a team-player. Requirements",
            "infoSource": "Mycareersfuture SG",
            "postDate": "About 5 hours ago",
            "crawlerCreateDate": "1616683925268"
        },
        {
            "link": "https://sg.jobsdb.com/job/Digital-Marketing-Specialist-5d4259ea1939d69b0dc0136cc80dfb45?from_url=https%3A%2F%2Fsg.jobsdb.com%2Fj%3Fa%3D24h%26jt%3D3%26l%3DSingapore%26q%3Dfront%2Bend%2Bdeveloper%26sp%3Dfacet_listed_date%26p%3D7&sfjt=3&sl=Singapore&sol_srt=1965a836-74a9-4620-a6b5-bc4cdb6d3a7b&sp=serp&sponsored=false&sq=front+end+developer&sr=68&tk=XpMnRM8oUyRxi8WxJn7L-JtgKA_T28Wj3IutMm3KX",
            "title": "Digital Marketing Specialist",
            "location": "North Singapore",
            "company": "CatSmart Supply & Distribution Pte Ltd",
            "salary": "",
            "description": "We are looking for an experienced and knowledgeable Digital Marketing Specialist to join our Marketing team! Your roles and responsibilities are to develop and execute strong and innovative digital marketing strategies using PPC, SEO, SEM and other techniques to attract traffic to the company’s ecommerce sites to increase check out rate; and increasing awareness of company’s products and services in the digital space. Duties and Responsibilities: ·      Plan, develop and implement our SEO / SEM strategy ·      Research and implement search engine optimization recommendations to achieve SEO KPIs and maximize ROI ·      Audit on-page SEO issues affecting organic search results, recommend, and implement solutions ·      Work with marketing teams to drive SEO through content creation to improve SEO positions for target keywords. ·      Assume full ownership of paid search campaigns (SEM) to ensure the delivery of KPIs ·      Monitor redirects, click rate, bounce rate, and other KPIs ·      Prepare and present reports regularly ·      Identify problems and deficiency, and implement solutions in a timely manner ·      Analyse digital data to draw key recommendations around website optimization ·      Work with web developers and marketing teams to identify and implement improvements for process and productivity optimization ·      Stay up to date with the latest SEO / SEM and digital marketing latest trends and best practices ·      Manage the company’s ecommerce sites and mobile apps which also include optimizing content or the purpose of digital search ·      Manage marketplace accounts like Shopee, Lazada, Qoo10 etc, and maintain strong relationships with platform partners to leverage their promotion tools & campaign for sales. Requirements and Qualifications  At least 3 years of experience as Search Engine Marketing Specialist or similar role At least 3 years of experience with planning and implementing a successful SEO strategy Understanding and experience in Google Analytics, Content management systems, Google Search Console, Google My Business Knowledge in execution and optimisation of digital marketing channels such as Google Ads, Social Media Ads, e-mail marketing, affiliate marketing, etc Familiar with e-marketplaces backend dashboard Knowledge of HTML, CSS, JavaScript Ability to analyse data and provide evidence-based recommendations Sense of ownership and pride in your performance and its impact on company’s success Critical thinker and problem-solving skills Team player Good time-management skills Great interpersonal and communication skills. The candidate must to able to distil complex ideas and thoughts down into concepts that non-SEO people can understand and make decisions with. Degree in relevant fields. Google Analytics Certified Singaporeans preferred ",
            "infoSource": "Jobstreet SG",
            "postDate": "About 17 hours ago",
            "crawlerCreateDate": "1616683925778"
        },
        {
            "link": "https://sg.jobsdb.com/job/Business-Sales-Executive-32be1da36f94f78d86bd71ac388879d5?from_url=https%3A%2F%2Fsg.jobsdb.com%2Fj%3Fa%3D24h%26jt%3D3%26l%3DSingapore%26q%3Dfront%2Bend%2Bdeveloper%26sp%3Dfacet_listed_date%26p%3D7&sfjt=3&sl=Singapore&sol_srt=1965a836-74a9-4620-a6b5-bc4cdb6d3a7b&sp=serp&sponsored=false&sq=front+end+developer&sr=69&tk=XpMnRM8oUyRxi8WxJn7L-JtgKA_T28Wj3IutMm3KX",
            "title": "Business Sales Executive/Telesales Executive",
            "location": "Ang Mo Kio",
            "company": "J MAX SOLUTIONS",
            "salary": "$2,000 - $3,000 per month",
            "description": "Roles & ResponsibilitiesRequired Business Sales Executive/Telesales Executive. Company Description J Max Solutions, all multifunction devices, implement a total office solution to customer so as to have a go \" GREEN\" working environment with paperless and also to make your job much more efficiency and work more productivity. Retrieve your document at anywhere any location with the help of our mobility. J Max Solutions, being a professional website design & web development company based in Singapore, represent the modern & dynamic online society of the virtual era. We are specialize in corporate image branding, promising to give your company the superiority over your competitors. J Max Solutions had a strong, experienced service team which will attend to all customer needs & repair calls at all times. Job Description -Identifies revenue opportunities in targeted SME accounts, develop sales plans, and execute to close revenue. -Identifies product improvements or new products by remaining current on industry trends, market activities, and competitors -Prepare and manage sales quotations. -Plan and implement strategies to achieve sales target, network and build up customer base. -Be involved in all aspects of the sales cycle from identifying prospects, conducting product demonstrations and sales presentations, generating sales revenue for new and existing markets to achieve assigned sales targets. - Maintains relationships with existing clients by providing support, information, and guidance Job Requirements -Articulate, persuasive in communications skills -Responsive in handling clients with a service attitude -Independent, positive, driven, responsible & results oriented -Possess a strong commitment in work and assisting team members -With and without experience can apply as training will be provided -Able to speak English & Mandarin to liaise with Mandarin speaking clients. -Fresh ORD are most welcome -5 day work week Benefits -Your portfolio will be review every quarterly -Career advancement to management level -Increment of salary twice a year based on performance Interested candidates please email your resume to *******@jmaxsolutions.com, SMS to 93666100 (No calling please) or contact 67340177 Location:Singapore - Nationwide  Basic Salary + Transport + Commissions + Incentives + High Profit Sharing Requirements",
            "infoSource": "Mycareersfuture SG",
            "postDate": "About 16 hours ago",
            "crawlerCreateDate": "1616683926190"
        },
        {
            "link": "https://sg.jobsdb.com/job/C-Programmer-62f6988133a114c0614c4b369ee0286c?from_url=https%3A%2F%2Fsg.jobsdb.com%2Fj%3Fa%3D24h%26jt%3D3%26l%3DSingapore%26q%3Dfront%2Bend%2Bdeveloper%26sp%3Dfacet_listed_date%26p%3D7&sfjt=3&sl=Singapore&sol_srt=1965a836-74a9-4620-a6b5-bc4cdb6d3a7b&sp=serp&sponsored=false&sq=front+end+developer&sr=70&tk=XpMnRM8oUyRxi8WxJn7L-JtgKA_T28Wj3IutMm3KX",
            "title": "C Programmer",
            "location": "West Singapore",
            "company": "NEWBRIDGE ALLIANCE PTE. LTD.",
            "salary": "$5,000 - $9,000 per month",
            "description": "Roles & ResponsibilitiesWe are looking for an individual with a passion for embedded design, development, debug, and maintenance for our industry-leading mobile and stationary printer products.  This is an opportunity to work with state-of-the-art tools and methodologies and embedded, wireless, and wired technologies including 802.11a/b/g/n/ac, Bluetooth, Ethernet, and future standards! Successful candidates are self-starters that work well individually, as part of a high-performance team, and are driven to make a difference in what we deliver to our customers. Be a part of a dynamic, collaborative team utilizing and driving best practices and continuous improvement to deliver quality solutions to internal and external customers. In this role, the individual analyzes, develops, designs, programs, debugs and implements embedded systems for the organization's products and systems. Develops tests, testing and troubleshooting strategies, devices, and systems for firmware. Integrates firmware to maintain functionality, throughput and consistency. Develops user documentation. Responsible for the design and development of device firmware and software applications using C/C++ programming languages. Interfaces with hardware and software engineers, application developers, field engineers and customers and other functional groups. Individual is required to work individually and collaboratively other team members. May develop presentations, whitepapers, and training material to communicate functional usage, technologies, and processes. May participate in researching technologies to assist in developing hardware and software technology roadmaps. Attends requirements meetings for moderately complex firmware design projects. Completes all phases of moderately complex firmware design projects. Reviews firmware test results and root cause analysis. Resolves highly complex technical issues. If you are expert in C programming and would love to work with largest growing technology team, this is the job for you Requirements",
            "infoSource": "Mycareersfuture SG",
            "postDate": "About 5 hours ago",
            "crawlerCreateDate": "1616683926570"
        },
        {
            "link": "https://sg.jobsdb.com/job/rd/6a6529be7aa963f8fdff88982ed47197?sp=sserp_bottom&sponsored=true&sr=63&tk=XpMnRM8oUyRxi8WxJn7L-JtgKA_T28Wj3IutMm3KX",
            "title": "",
            "location": "",
            "company": "",
            "salary": "",
            "description": "",
            "infoSource": "",
            "postDate": "",
            "crawlerCreateDate": "1616683927443"
        },
        {
            "link": "https://sg.jobsdb.com/job/rd/ee9662e3593ae743b790536d795d31f0?sp=sserp_bottom&sponsored=true&sr=64&tk=XpMnRM8oUyRxi8WxJn7L-JtgKA_T28Wj3IutMm3KX",
            "title": "",
            "location": "",
            "company": "",
            "salary": "",
            "description": "",
            "infoSource": "",
            "postDate": "",
            "crawlerCreateDate": "1616683928377"
        },
        {
            "link": "https://sg.jobsdb.com/job/rd/28ffe6c3fad85f4c432ff4457e1ea3fc?sp=sserp_bottom&sponsored=true&sr=65&tk=XpMnRM8oUyRxi8WxJn7L-JtgKA_T28Wj3IutMm3KX",
            "title": "",
            "location": "",
            "company": "",
            "salary": "",
            "description": "",
            "infoSource": "",
            "postDate": "",
            "crawlerCreateDate": "1616683929050"
        },
        {
            "link": "https://sg.jobsdb.com/job/rd/a43d2a28cee6339fbbe502845ec2bf7b?sp=sserp_top&sponsored=true&sr=71&tk=Pe265SNQVwtwABXgIGVJ-CKFGXqBVTf_obJP9WQmC",
            "title": "",
            "location": "",
            "company": "",
            "salary": "",
            "description": "",
            "infoSource": "",
            "postDate": "",
            "crawlerCreateDate": "1616683929768"
        },
        {
            "link": "https://sg.jobsdb.com/job/rd/ef98a8c6684ff41bc2b7d2b6df7b7394?sp=sserp_top&sponsored=true&sr=72&tk=Pe265SNQVwtwABXgIGVJ-CKFGXqBVTf_obJP9WQmC",
            "title": "",
            "location": "",
            "company": "",
            "salary": "",
            "description": "",
            "infoSource": "",
            "postDate": "",
            "crawlerCreateDate": "1616683930528"
        },
        {
            "link": "https://sg.jobsdb.com/job/DevOps-Engineer-18a78cb4e036a89a07c6e25ee6aeff37?from_url=https%3A%2F%2Fsg.jobsdb.com%2Fj%3Fa%3D24h%26jt%3D3%26l%3DSingapore%26q%3Dfront%2Bend%2Bdeveloper%26sp%3Dfacet_listed_date%26p%3D8&sfjt=3&sl=Singapore&sol_srt=49b1eb59-c256-4b31-bd8c-30f78995cfac&sp=serp&sponsored=false&sq=front+end+developer&sr=71&tk=Pe265SNQVwtwABXgIGVJ-CKFGXqBVTf_obJP9WQmC",
            "title": "Cloud & DevOps Engineer (Banking/Contract/AWS/CI/CD)",
            "location": "Central Singapore",
            "company": "Tangspac Consulting Pte Ltd",
            "salary": "",
            "description": "· Position: Cloud & DevOps Engineer· Employment Type: 6 months contact (highly renewable) Responsibilities:  To support and grow the DevOps/SRE environment working closely with cross development/support teams like Development, Testing & Production Support teams across PBWM Funds Projects. Hands-on Automation DevOps engineer with experience in creating Infrastructure as Code, automating application deployments, and Release Management tasks Create tools and scripts that help automate deployments that align with agreed guiding principles, strategy, architecture, and standards Embed security controls, implementation, and testing into the DevOps/SRE practices Utilize agile practices to ensure consistent and transparent execution. Monitor standards/policy compliance by developing and executing governance processes and tools. Drive and ensure industry best practice is being adopted in terms of Infrastructure Architecture; Continuous Delivery and Integration; Deployment; Security; 3rd-level Support and Test automation. Take personal ownership of all infrastructure and development operations for the team and ensure that all work meets user and commercial objectives, is delivered on time, and to the quality standards agreed. Execute the agreed upon technology strategy. Responsible for defining the System Development Life Cycle methodology and associated cross-functional tools to ensure adoption and continuous improvement.  Qualifications  Min. Bachelor in computer science, information technology or related fields with preferrably with 8 years of experiences 8 or more years of leading similarly experienced DevOps teams delivering high performance; highly available and resilient applications and infrastructures. Extensive experience in Cloud Infrastructure and DevOps (CI/CD) technologies. Solid technical background, with hands-on experience in automated; agile environments delivering infrastructure; monitoring and tooling to high-traffic web applications. A track record of delivering infrastructure and supporting services in Java/JVM stacks. Strong agile development background and history of building teams to work in highly agile; cross-functional environments. Technical / Professional Skills Experience working within software development or Internet-related industries Ability to automate repeatable processes via scripts (e.g. via Terraform, bash, PowerShell, JS, Python, Groovy, etc.) Proficiency with building and setting up high velocity and reliable CI/CD pipeline using tools/platforms such as Jenkins, Gitlab, Nexus, Maven Familiarity with deployment of application performance monitoring (APM) Knowledge on Quality Tools and Management tools like Sonar and AppScan etc. Excellent experience with system administration (Ubuntu/Debian) Experience with load balancing setup for TCP/IP, HTTP, DNS, and routings Proficiency with systems that support Infrastructure-as-Code ideals, such as Ansible AWX/Tower, Chef, Terraform, Puppet, CloudFormation and so on Strong understanding of CloudOps, DevOps is a plus Experience of DevOps solutions on cloud computing platforms such as AWS/GCP/Azure (e.g. AWS: EC2, RDS, ELB, EFS, ELK, ElasticCache, S3, VPC, IAM, CloudWatch, KMS, MSK) is a Plus Good to have experience with micro-services (Docker or Kubernetes) AWS certification will be an added advantage   If keen, kindly forward your resume/application to ************@tangspac.com Do take note that only shortlisted candidates will be contacted. Company Name: Tangspac ConsultingEA licence no.: 07C3635EA personnel name: Olsem Stefanus EmmanuelEA personnel registration no.: R2094432 ",
            "infoSource": "Jobstreet SG",
            "postDate": "About 17 hours ago",
            "crawlerCreateDate": "1616683930911"
        },
        {
            "link": "https://sg.jobsdb.com/job/Senior-Product-Manager-869ab62f51e933c39edce46215266d18?from_url=https%3A%2F%2Fsg.jobsdb.com%2Fj%3Fa%3D24h%26jt%3D3%26l%3DSingapore%26q%3Dfront%2Bend%2Bdeveloper%26sp%3Dfacet_listed_date%26p%3D8&sfjt=3&sl=Singapore&sol_srt=49b1eb59-c256-4b31-bd8c-30f78995cfac&sp=serp&sponsored=false&sq=front+end+developer&sr=72&tk=Pe265SNQVwtwABXgIGVJ-CKFGXqBVTf_obJP9WQmC",
            "title": "Senior Product Manager",
            "location": "Singapore",
            "company": "XPLUS GROUP PTE. LTD.",
            "salary": "$2,500 - $8,000 per month",
            "description": "Roles & ResponsibilitiesWe are looking for an experienced Product Manager who is passionate about building products that customers love. You will join a dynamic and fast-paced environment and work with cross-functional teams to design, build and roll-out products that deliver the company’s vision and strategy. Requirements: · Minimum 3 years work experience as product manager in Internet company or finance company. · Proven ability to develop product and effectively communicate recommendations to executive management · Solid technical background with understanding and/or hands-on experience in software development and web technologies · Strong problem-solving skills and willingness to roll up one's sleeves to get the job · Skilled at working effectively with cross functional teams in a matrix organization · Excellent written and verbal communication skills · Ability to solve problems creatively and effectively · Good at prototype design tools, such as axure, sketch · (+) MS/BS degree in Computer Science, Engineering or equivalent preferred · (+) Experience working in an Agile development process Desired Traits: · We're looking for hard-working people who care about their work and want to push our product to be the best in the world. · We need self-motivated problem solvers who can effectively work and communicate in a fast moving, intense industry. If you're a goal-oriented person who can meet tight deadlines without sacrificing quality, we want you on our team! Desired Languages: We're a multilingual team and applicants need to speak at least one of the languages below: · English · Chinese Multi-lingual applicants are strongly desired! As an international exchange, being able to natively interact with more users is one of our core goals. Desired Education: · Bachelor's degree in a technical field or financial field · Bonus for degrees in: Computer Science, Computer Engineering, Financial, or Software Engineering Requirements",
            "infoSource": "Mycareersfuture SG",
            "postDate": "About 5 hours ago",
            "crawlerCreateDate": "1616683931323"
        },
        {
            "link": "https://sg.jobsdb.com/job/Product-Manager-e7ca21916aeadbc528652cef3ea01304?from_url=https%3A%2F%2Fsg.jobsdb.com%2Fj%3Fa%3D24h%26jt%3D3%26l%3DSingapore%26q%3Dfront%2Bend%2Bdeveloper%26sp%3Dfacet_listed_date%26p%3D8&sfjt=3&sl=Singapore&sol_srt=49b1eb59-c256-4b31-bd8c-30f78995cfac&sp=serp&sponsored=false&sq=front+end+developer&sr=73&tk=Pe265SNQVwtwABXgIGVJ-CKFGXqBVTf_obJP9WQmC",
            "title": "Product Manager",
            "location": "Central Singapore",
            "company": "CEDARWOODS CONSULTANCY PTE. LTD.",
            "salary": "$2,800 - $3,500 per month",
            "description": "Roles & ResponsibilitiesJOB DESCRIPTION Own and execute the product roadmap. Develop and maintain a prioritized the product backlog to achieve the product roadmap, and deliver great experiences for the users. Define product requirements and specifications by thinking creatively and rigorously about how to solve problems. Lead a cross-functional App team, and testers to deliver on the team’s objectives. Responsible for product further development. Manage project timelines and deliverables with external partners. RESPONSIBILITIES As Product Manager: Report to GM, lead a product development team. Own the product roadmap and execution for delivery SKILL SETS & TEMPERAMENT   Believe in the digital transformation, ability to communicate vision  Never take no for an answer  Understand drivers of customer loyalty, previous loyalty experience will be useful  Understand customer journey, some domain knowledge will be useful  Focus on hitting KPIs by thinking out of the box, analytical problem solving skills  Strong problem-solving skills and willingness to roll up one’s sleeves to get the job done  Understanding App development and web technologies  Knowledge in user experience (UX) design is a plus  Bilingual, well versed and written in Mandarin  Integrate technology into customer experience, interest in evolving technology  Work in a fast-paced, trail blazing environment  Able to work effectively with cross-functional teams  Good communication skills with colleagues and partners  If you are interest, pls send your resume to **@cedarwoods.sg Requirements",
            "infoSource": "Mycareersfuture SG",
            "postDate": "About 5 hours ago",
            "crawlerCreateDate": "1616683931703"
        },
        {
            "link": "https://sg.jobsdb.com/job/IT-Project-Manager-e625850fc3fd541b59aaf125d196d050?from_url=https%3A%2F%2Fsg.jobsdb.com%2Fj%3Fa%3D24h%26jt%3D3%26l%3DSingapore%26q%3Dfront%2Bend%2Bdeveloper%26sp%3Dfacet_listed_date%26p%3D8&sfjt=3&sl=Singapore&sol_srt=49b1eb59-c256-4b31-bd8c-30f78995cfac&sp=serp&sponsored=false&sq=front+end+developer&sr=74&tk=Pe265SNQVwtwABXgIGVJ-CKFGXqBVTf_obJP9WQmC",
            "title": "IT Project Manager (Fintech | up to $8000 | central | #fasthire) spvlp",
            "location": "Central Singapore",
            "company": "ScienTec Personnel",
            "salary": "$8,000 - $8,000 per month",
            "description": " Top Software Consultancy company - Fintech industry (mainly serve client from China market) Basic up to $8,000 + AWS + VB Permanent position Great career progression!  Working location: Tanjong Pagar (5 mins from mrt) Working hours: MON-FRI 9am to 6pm (alternate work from home!) Responsibilities:  Clearly articulates and documents business requirements Engages with knowledge workers to incorporate usability and user interface needs when designing systems Provide end-to-end project management and monitor progress Deliver projects on time ensuring quality standards are met Participate and contribute in project activities such as Requirement Gathering, User Acceptance Testing, Implementation Assesses the risks of various solutions and prioritizes competing business demands Creating a rapport with the clients and ensure project delivery is accurate as per requirements Reviewing and identifying business operational areas/ gaps that need improvements and propose appropriate action plans  Requirements:  Singaporean only Bachelor Degree in IT related studies Min 4 years of project management and proven records in delivering sizeable project end to end Working knowledge of JIRA software Good technical background, with understanding or hands-on experience in software development and web technologies  Interested please send your resume to Vivian:****@scientecpersonnel.com By submitting any application or resume to us, you will be deemed to have agreed & consented to us collecting, using, retaining & disclosing your personal information to prospective employers for their consideration. If you wish to withdraw your consent or correct any of your personal data, please drop us an email at ************@scientecconsulting.com to let us know.(Note: Any resumes of job applications sent to this mailbox will not be attended as it is solely for the purpose of personal data protection related matters.) We will contact you if your skills and experience are suitable for the role, or if there is a similar opportunity that is available presently or in the future. R2090138 liew chien hui (vivian)11C5781 ScienTec Consulting Pte Ltd ",
            "infoSource": "Jobstreet SG",
            "postDate": "About 17 hours ago",
            "crawlerCreateDate": "1616683932085"
        },
        {
            "link": "https://sg.jobsdb.com/job/Product-Manager-def654b2330f6ada2de0692f234a27b6?from_url=https%3A%2F%2Fsg.jobsdb.com%2Fj%3Fa%3D24h%26jt%3D3%26l%3DSingapore%26q%3Dfront%2Bend%2Bdeveloper%26sp%3Dfacet_listed_date%26p%3D8&sfjt=3&sl=Singapore&sol_srt=49b1eb59-c256-4b31-bd8c-30f78995cfac&sp=serp&sponsored=false&sq=front+end+developer&sr=75&tk=Pe265SNQVwtwABXgIGVJ-CKFGXqBVTf_obJP9WQmC",
            "title": "Product Manager",
            "location": "Singapore",
            "company": "YUANYII AGENCY PTE. LTD.",
            "salary": "$3,500 - $4,500 per month",
            "description": "Roles & ResponsibilitiesJob Description We are looking for a Product Executive/ Product Assistant Manager with a strong technical background as well as excellent communications and some management skills. You are expected to work closely with our Project Director and CEO on our Mobile App and Web App Product developments as well as supporting our IT development plans, with autonomy in shaping our future product plans Responsibilities  Work on Product development and Project management with in-house employees and external vendors.  Function as the key point of contact for working, liaising and coordinating with all relevant stakeholders  Manage our vendors, testing and debugging of our digital products under development to ensure quality deliverables, following defined processes of working  Drive project discipline to document scope changes, issues and risks that affect implementation and work closely with vendors and management to determine and resolve issues associated with project implementation  Develop metrics and reporting for features  Handle rollout for our product in the Japanese market  Analyze data to optimize business and operational procedures  Advise CEO and project team on technology and innovation  Create a technological masterplan for innovative transformation  Structure and plan company IT development strategies  Have an eye for detail while keeping the big picture in mind  Define key requirements and go deep into details as needed  Provide IT support to the rest of the team as and when needed Desired Qualities  Eye for detail  Analytical skills to understand & generate insights from user data  Self-driven and motivated, with a knack for strategic, technical and creative problem-solving  Strong work ethic and high level of initiative  Excellent troubleshooting and analytical skills  Value team success over individual accomplishment  Work hard, play hard  Strong prioritization skills, taking complete ownership of the product  Sound product and execution skills and ability to perform under tight deadlines Desired Skills  BS in Computer Science or related field  Minimum 3+ years of experience in end-end product development  Experience in project management and task delegation with good issue tracking skills  Familiarity in Agile and Scrum development processes  Experience in managing development teams  Experience in DevOps processes  Hands-on experience and strong understanding of the technical aspects of product development - experience with project management tools such as JIRA/Confluence, Azure DevOps, GitLab  Ability to balance priorities and multiple-tasks  Data analytics skills (Python, R, Excel, SQL)  Fluency in English Good to Have  Fluency in Japanese will be a plus but not necessary  Any Project Management certification like PMP or CSM  Experience in Mobile app development (iOS/Android) Requirements",
            "infoSource": "Mycareersfuture SG",
            "postDate": "About 5 hours ago",
            "crawlerCreateDate": "1616683932556"
        },
        {
            "link": "https://sg.jobsdb.com/job/Senior-System-Analyst-8e34d5035a94f91a7b4d08503bfd3e61?from_url=https%3A%2F%2Fsg.jobsdb.com%2Fj%3Fa%3D24h%26jt%3D3%26l%3DSingapore%26q%3Dfront%2Bend%2Bdeveloper%26sp%3Dfacet_listed_date%26p%3D8&sfjt=3&sl=Singapore&sol_srt=49b1eb59-c256-4b31-bd8c-30f78995cfac&sp=serp&sponsored=false&sq=front+end+developer&sr=76&tk=Pe265SNQVwtwABXgIGVJ-CKFGXqBVTf_obJP9WQmC",
            "title": "Senior System Analyst / Assistant Manager (West / MNC / 5 days)",
            "location": "West Singapore",
            "company": "People Profilers Pte Ltd",
            "salary": "",
            "description": " Senior System Analyst / Assistant ManagerIndustry: Marine / MNC Location: WestSalary: Up to $5500Job ID:  444R77 Job Responsibilities:  Work closely with stakeholders to gather business requirements and translate them into functional requirement specifications Manage and support the Software Development Life Cycle (“SDLC”) of assigned project(s) from initialization to closure Work closely with vendors to ensure successful software system delivery and technical feasibility Conduct System Integration Testing (SIT), User Acceptance Testing (UAT) and System Implementation and Deployment Ensure technical solution supports the business requirements Able to perform system troubleshooting; and Work in a team providing 24x7 system support     Job Requirements:  Degree in Computer Science, Information Technology, Information Systems or equivalent Minimum 1 year of relevant experience in software development and maintaining web or mobile applications Strong technical knowledge and hands-on experience in frameworks such as Angular, Spring Boot and in Unix/Linux based environment Proficiency in programming (Java, JavaScript, Angular, Unix Shell Scripting) and relational databases and related scripting (Oracle, SQL, mySQL) Proficiency in Agile Methodologies, Scrum knowledge of software best practices, such as Test-Driven Development (TDD) and Continuous Integration (CI) will be an advantage Strong analytical and problem-solving skills; and A conscientious attitude with an attention to detail and ability to multi-task. Fresh graduates are welcome to apply   Comfortable with Two years contract (Convertible to Permanent)  Please kindly send in your updated CV (please include your current salary package with full breakdown, reason of leaving and expected salary) via Apply Now or Email: ***********@peopleprofilers.com We regret only shortlisted candidates will be notified. Thank you. People Profilers Pte LtdOffice Number: +65 6950 973911 Collyer Quay, The Arcade, #13-01, Singapore 049317Donny Leong Chee Yoong,EA License Number: 02C4944,Registration Number: R1765127",
            "infoSource": "Jobstreet SG",
            "postDate": "About 17 hours ago",
            "crawlerCreateDate": "1616683932949"
        },
        {
            "link": "https://sg.jobsdb.com/job/Software-Engineer-10988534e3d4d0f2aeb8e4f89217937f?from_url=https%3A%2F%2Fsg.jobsdb.com%2Fj%3Fa%3D24h%26jt%3D3%26l%3DSingapore%26q%3Dfront%2Bend%2Bdeveloper%26sp%3Dfacet_listed_date%26p%3D8&sfjt=3&sl=Singapore&sol_srt=49b1eb59-c256-4b31-bd8c-30f78995cfac&sp=serp&sponsored=false&sq=front+end+developer&sr=77&tk=Pe265SNQVwtwABXgIGVJ-CKFGXqBVTf_obJP9WQmC",
            "title": "Software Engineer",
            "location": "Singapore",
            "company": "FIELD INTERNATIONAL TECHNOLOGIES PTE. LTD.",
            "salary": "$3,500 - $4,000 per month",
            "description": "Roles & ResponsibilitiesResponsibilities   Develop web solutions for intranet development  Support and develop in-house applications  Work with manager to develop innovation solutions to meet the requirements  Experience of using Dreamweaver, Flash, Photoshop and CMS in maintaining the website  Requirements   Degree in Computer Science or equivalent with at least 2 years’ working experience  Strong interest in programming with very good knowledge in web applications (PHP, ASP.net ColdFusion,MySql, CSS, JavaScript, Ajax ) are essential  Experience in managing website and system administration  Experience in C++ is added advantage  Strong technical competencies with good analytical and problems solving skills  Successful incumbant will be deployed at off-site location near Boon Lay MRT station  Interested applicants to apply online with detailed resume and expectations. Only shortlisted candidates will be notified. Requirements",
            "infoSource": "Mycareersfuture SG",
            "postDate": "About 5 hours ago",
            "crawlerCreateDate": "1616683933397"
        },
        {
            "link": "https://sg.jobsdb.com/job/Senior-Technical-Analyst-6fe88d4f812b3b0101443547e1b0a9ce?from_url=https%3A%2F%2Fsg.jobsdb.com%2Fj%3Fa%3D24h%26jt%3D3%26l%3DSingapore%26q%3Dfront%2Bend%2Bdeveloper%26sp%3Dfacet_listed_date%26p%3D8&sfjt=3&sl=Singapore&sol_srt=49b1eb59-c256-4b31-bd8c-30f78995cfac&sp=serp&sponsored=false&sq=front+end+developer&sr=78&tk=Pe265SNQVwtwABXgIGVJ-CKFGXqBVTf_obJP9WQmC",
            "title": "Tech lead / Senior Technical Analyst - L3 support",
            "location": "Singapore",
            "company": "OPTIMUM SOLUTIONS (SINGAPORE) PTE LTD",
            "salary": "$6,500 - $9,200 per month",
            "description": "Roles & ResponsibilitiesOptimum Solutions (Registration Number: 199700895N) is Singapore's leading Information Technology , Consulting and Professional Services company with Competence in Digital Transformation, Automation, Robotics, Cloud, Big Data, Analytics and Emerging technologies projects. Optimum has been successfully delivering IT projects since 1997 and has been a key IT service provider to clients delivering Software Design, Development, Engineering and IT Transformation Projects. Role : Tech lead / Senior Technical Analyst - L3 support Key Requirements:   Prior IT experience implementing large scale, highly available applications or other large program implementation.  Experience of banking projects implementation particularly in Open systems in Transaction banking ; knowledge of Trade and Supplier Financing domain desired  10 years of working experience as Technical Analyst and production support preferably in trade finance in the banking domain.  Solid foundation in service-oriented technologies to be able to understand service interdependencies and drive  towards technical solutions for multi-tiered systems  Detail oriented, yet able to look at a wide array of choices & identify what truly matters  Ability to work independently and excellent problem solving skills is a must  Proven results-oriented person with a focus on delivery  Experience communicating with technical and non-technical stakeholders across multiple business units  Coding experience and upto date understanding in technologies like JAVA/J2EE, JUnit, XML, RHEL, Oracle, SFTP, Unix, Maven, BitBucket, Jenkins, IBM HTTP / WAS / MQ / CD, Oracle PL/SQL, Unix scripting, Control-M and good knowledge in SWIFT and XML message formats.  Experience in managing, delivering and supporting file, batch. Knowledge and experience on encryption methods used in the industry.  Technology Stack: o N Tier Architecture deployed in a distributed VM farm o VMs o Platform: Sun Solaris 11 / RHEL 7.4 o App Server: DMZ – IBM HTTPS Server 8.5.5 or above o Web Server: IBM WebSphere ND8.5.5.14 or above o Messaging: IBM MQ (Online) Server & Client o TCP-IP/SFTP: ConnectDirect / NDM o Single Sign on: iSprint o Scheduling: Control-M o Transaction authentication: HSMG o SFTP o JAVA 1.8 o AS 400 o NAS Storage o Database: Oracle 12c ver 2 / above and tools  CI/CD & DevOps Tools o Defect tracking: JIRA o Versioning: BitBucket o Continuous Integration: Jenkins o Build tool: Maven o Code Security Scan: Vera Code o Code Analysis: SonarCube o Build repository: Artifactory o Code repository: Aldon o Change / Incident Management: Remedy, Aldon LME o Monitoring Tools: Wiley, BMC Patrol Key Responsibilities:   Be the Tech lead / senior developer to drive L3 support for a new application.  Knowledge of 3 Tier transaction banking applications, experience manage complex production support for Java and Oracle based systems.  Good understanding of Quality and DevOPS processes, demonstrated experience in tools and hands-on implementation of these processes in Development.  Good expertise in tools – Confluence, JENKIS, BIT-Bucket and ALDON for change mgmt.  Experience working with vendors and prioritize readiness and fixes to production  Responsible for aspects of production readiness for new systems, engagement with stakeholders and ensure strict process monitoring and controls.  Focus on right process and change management for production implementation needs  Hands on need to setup jobs for file transfer and monitoring – ensure hands on work with CONTROL-M, Connect Direct scripts and file transfer verification  Monitor and manage risks /issues related to system production implementation  Drive quality and productivity outcomes, ensure timeliness in task monitoring and completion  Manage overall production stability of the applications, focus on pro-active monitoring and issues resolution.  Involve and drive upgrade, enhance and maintain systems  Requirements",
            "infoSource": "Mycareersfuture SG",
            "postDate": "About 5 hours ago",
            "crawlerCreateDate": "1616683933812"
        },
        {
            "link": "https://sg.jobsdb.com/job/Chief-Technology-Officer-964919980bbc3363fe8670d5d79e20ed?from_url=https%3A%2F%2Fsg.jobsdb.com%2Fj%3Fa%3D24h%26jt%3D3%26l%3DSingapore%26q%3Dfront%2Bend%2Bdeveloper%26sp%3Dfacet_listed_date%26p%3D8&sfjt=3&sl=Singapore&sol_srt=49b1eb59-c256-4b31-bd8c-30f78995cfac&sp=serp&sponsored=false&sq=front+end+developer&sr=79&tk=Pe265SNQVwtwABXgIGVJ-CKFGXqBVTf_obJP9WQmC",
            "title": "Chief Technology Officer",
            "location": "East Singapore",
            "company": "HUSTLE & BUSTLE PTE. LTD.",
            "salary": "$4,500 - $6,000 per month",
            "description": "Roles & ResponsibilitiesThe ideal candidate is responsible for maintaining the strategic focus of the project and is in charge of turning a concept into reality, with a primary goal of managing a tech team and making business critical tech decisions, such as tech design planning, product architecture layout, and development platform selection. He/She is a visionary with a entrepreneurial mindset who thinks about the future, maps it, and then implements the step by step plan, while taking care of corporate commercial goals using technology resources. Being in a fast-growing and forward-thinking environment, he/she must be prepared to step up as a practical engineer that should be ready to build the digital product architecture without third-party help and remains the main specialist to implement it. Responsibilities   Oversees and executes tasks/ processes crucial to data security, QA management, product iteration and deployment  Oversees and executes security procedure development, algorithm development, as well as emergency audits  Oversees the growth and management of both in-house and outsourced technology resources and manpower  Plans ahead with a growth roadmap, while taking into consideration corporate goals and strategies  Is in charge of planning the next product version and tech updates while fulfilling budgeting roles regarding MVP rebuilding, studying of user feedback or relevant data and filling resource gaps  Details product development roadmap for all stakeholders to maintain accountability  Qualifications/ Soft Skills   Core proficiencies in HTML, CSS, JavaScript, React.js, Redux, Node.js  In-depth knowledge of web systems, architecture, design and development  Proficiencies in Interactive Technology and/or Mixed Reality Technology a plus  Bachelor's degree or equivalent qualification in relevant areas as stated above  At least 3 years of working experience in programming, software development or related role  Sense of leadership and mentorship  Strategic thinking with problem solving aptitude    Interested candidates are welcomed to submit a comprehensive resume, stating current and expected salary, and date of availability.  Remuneration and appointment will commensurate with qualifications and experience.  We regret that only shortlisted candidates will be notified.  Hired candidate will be eligible for product equity and Company's profit sharing programme.  #SGJobsUnited Requirements",
            "infoSource": "Mycareersfuture SG",
            "postDate": "About 5 hours ago",
            "crawlerCreateDate": "1616683934285"
        },
        {
            "link": "https://sg.jobsdb.com/job/Senior-Developer-cac33d85cdc5944509e4613ced8659be?from_url=https%3A%2F%2Fsg.jobsdb.com%2Fj%3Fa%3D24h%26jt%3D3%26l%3DSingapore%26q%3Dfront%2Bend%2Bdeveloper%26sp%3Dfacet_listed_date%26p%3D8&sfjt=3&sl=Singapore&sol_srt=49b1eb59-c256-4b31-bd8c-30f78995cfac&sp=serp&sponsored=false&sq=front+end+developer&sr=80&tk=Pe265SNQVwtwABXgIGVJ-CKFGXqBVTf_obJP9WQmC",
            "title": "Senior Developer Data Analytics",
            "location": "Central Singapore",
            "company": "John Foord (Asia) Pte Ltd",
            "salary": "",
            "description": "Role: The Senior Developer, Data Analytics is a key role in the development of a newly launched John Foord Analytics cloud (Amazon Web Services) based platform. This will involve working with internal and external stakeholders to improve the design and functionality of the platform to meet client needs. This is a hands-on technical role for someone looking for exposure to the development of an exciting product in a start-up style environment. _____________________________________________________________  Overall Outcomes of the PositionJohn Foord assesses the value of property, plant and equipment for insurance purposes globally using site inspections, modelling and analysis. Our clients include asset owners, insurers and advisors across over 100 countries.  John Foord has developed, and beta launched, a new platform called John Foord Analytics based on AWS architecture to provide clients with real-time access to accurate reinstatement costs by applying artificial intelligence and machine learning to millions of data points on similar assets. The role of Senior Developer, Data Analytics, is to enhance John Foord’s reputation as an industry leader through continuous development of this platform. You will work with a team of asset valuers, data analysts and third-party vendors to identify, collate, clean, filter, model and visualise varied data from John Foord historical records and third-party sources.  This is a fantastic role for an entrepreneurial confident individual capable of building the tools and team around them to deliver innovate data analysis solutions that add value to John Foord and our customers. Key Role ResponsibilitiesProject Development ·           Work with the business development team and senior management to assess client’s needs  ·           Match client requirements to the design, planning and delivery of future versions of the platform ·           Able to clearly and simply articulate platform structure and complex IT concepts to non-IT individuals ·           Able to identify inter-dependencies between the various stakeholder groups and ensure alignment  ·           Ensure that risks to the project are identified, mitigated and communicated ·           Experience with a ‘lean start up’ type environment, where rapid change is common, would be useful Project Management  ·           Demonstrate key project management skills, including scheduling, version control, milestone tracking verification and project reporting ·           Able to engage with and keep high level stakeholders informed during complex projects  ·           Working experience of budget management, commercial and customer experience ·           Excellent organization and communication skills.  ·             Key Role Responsibilities (Cont.)Database / Platform Design ·           Work with data analysts and valuers to improve or develop Machine Learning and AI models to determine the value for insurance purposes of clients’ fixed assets ·           Ensure that the current platform architecture is appropriate to current and future needs ·           Build solutions that can integrate, analyse and deliver data to clients through the platform ·           Identify weaknesses in data (volume/quality/structure) and develop solutions for resolution ·           Integrate internal and external data sets to expand knowledge of asset cost drivers ·           Develop and implement new models to project valuation scenarios and reflect value drivers Software Development ·           Skills/experience of the following would be an added advantage: ·      Coding of structured and unstructured data ·      Data processing and analysis ·      Database development and associated infrastructure design ·      Data visualisation ·      Web programming languages Skills and Knowledge ·           Minimum of 5 years in app or platform development ·           Minimum of 2 years working with AWS Cloud infrastructure ·           Proficiency and demonstratable hands-on experience with most or all of the following tools: o  EC2, Lambda, Lightsail, Sagemaker, AWS Security, S3, DynamoDB, RDS, Athena, Glue  o  Experience with programming Lambda and use of NoSQL based systems in an AWS environment would be particularly useful ·           Knowledge of data protection requirements and standards Specific Job Requirements ·           University/tertiary qualifications in computer science, data analytics, engineering or related field preferred ·           Excellent command of English ·           Excellent time management skills ·           Able to see the ‘big picture’ and stay focused on the desired outcomes ·           Ability to communicate professionally with internal and external stakeholders at all levels of business ·           Open to new ideas and seeking to learn continually ·           Attention to detail ·           Able to work efficiently with minimal supervision ·           A positive “can do” attitude",
            "infoSource": "Jobstreet SG",
            "postDate": "About 17 hours ago",
            "crawlerCreateDate": "1616683934725"
        },
        {
            "link": "https://sg.jobsdb.com/job/rd/1bdf2bb466321d4d600f0037efc91aa6?sp=sserp_bottom&sponsored=true&sr=73&tk=Pe265SNQVwtwABXgIGVJ-CKFGXqBVTf_obJP9WQmC",
            "title": "",
            "location": "",
            "company": "",
            "salary": "",
            "description": "",
            "infoSource": "",
            "postDate": "",
            "crawlerCreateDate": "1616683935801"
        },
        {
            "link": "https://sg.jobsdb.com/job/rd/99ddaef76cf82bf0f2848bf0dbcb164a?sp=sserp_bottom&sponsored=true&sr=74&tk=Pe265SNQVwtwABXgIGVJ-CKFGXqBVTf_obJP9WQmC",
            "title": "",
            "location": "",
            "company": "",
            "salary": "",
            "description": "",
            "infoSource": "",
            "postDate": "",
            "crawlerCreateDate": "1616683936529"
        },
        {
            "link": "https://sg.jobsdb.com/job/rd/150a98baaf1b732c29652183b4527e2a?sp=sserp_bottom&sponsored=true&sr=75&tk=Pe265SNQVwtwABXgIGVJ-CKFGXqBVTf_obJP9WQmC",
            "title": "",
            "location": "",
            "company": "",
            "salary": "",
            "description": "",
            "infoSource": "",
            "postDate": "",
            "crawlerCreateDate": "1616683937314"
        },
        {
            "link": "https://sg.jobsdb.com/job/rd/cb15ba5d100905cb9d517f9aeefd08e2?sp=sserp_top&sponsored=true&sr=81&tk=uBaD_ecaU9CzgB_06dL6-NbpAs9E3fMEEFJjkBuQW",
            "title": "",
            "location": "",
            "company": "",
            "salary": "",
            "description": "",
            "infoSource": "",
            "postDate": "",
            "crawlerCreateDate": "1616683938115"
        },
        {
            "link": "https://sg.jobsdb.com/job/rd/8a170fdb9060f08674049b0cfeafa7a1?sp=sserp_top&sponsored=true&sr=82&tk=uBaD_ecaU9CzgB_06dL6-NbpAs9E3fMEEFJjkBuQW",
            "title": "",
            "location": "",
            "company": "",
            "salary": "",
            "description": "",
            "infoSource": "",
            "postDate": "",
            "crawlerCreateDate": "1616683939339"
        },
        {
            "link": "https://sg.jobsdb.com/job/.net-Developer-f3370717933cf06f31887774c64f99f9?from_url=https%3A%2F%2Fsg.jobsdb.com%2Fj%3Fa%3D24h%26jt%3D3%26l%3DSingapore%26q%3Dfront%2Bend%2Bdeveloper%26sp%3Dfacet_listed_date%26p%3D9&sfjt=3&sl=Singapore&sol_srt=dd79ac54-12de-49f5-a3a9-8acca8439f09&sp=serp&sponsored=false&sq=front+end+developer&sr=81&tk=uBaD_ecaU9CzgB_06dL6-NbpAs9E3fMEEFJjkBuQW",
            "title": ".Net Developer ",
            "location": "Bulim",
            "company": "Y3 TECHNOLOGIES PTE LTD",
            "salary": "$3,000 - $5,000 per month",
            "description": "Roles & ResponsibilitiesWe are looking for an experienced .Net Developer to build and enhance existing software using languages and technologies of the .NET CORE Framework. You will create applications from scratch, configure and enhance existing systems and provide user support. In this role, you should be able to write functional code with a sharp eye for spotting defects which may occur in a normal or from a multi-threaded environment. You should be a team player and excellent communicator. If you are also passionate about the .NET CORE framework and software design/architecture and REST API based integrations with external system including Test Driven Design, we would like to meet you to a discussion. Your goal will be to work with internal teams to design, develop and maintain software. Responsibilities · Participate in requirements gathering and analysis · Collaborate with internal teams to produce robust software design and architecture · Write clean, scalable, bug free code using .NET CORE (C#.NET) for a multi-threaded environment · Write functional and integration tests and deploy applications and systems into Cloud based Infrastructure such as AWS · Revise, update, refactor, debug and test and review code · Improve existing software for performance and maintenance · Develop documentation throughout the software development life cycle (SDLC) · Serve as an expert on applications and integration and provide full technical support Requirements · Proven experience as a .NET CORE Developer · Excellent understanding of ASP.NET CORE framework, EF CORE, SQL Server, and design/architectural patterns (e.g. WEB API, MVC) · Exceptional knowledge of using C#, TSQL, JavaScript & Angular 1.x · Expertise in using testing framework such as XUnit or NUnit · Good experience with architecture styles/APIs (REST, RPC), cloud infrastructure (AWS), CI/CD pipeline using tools such as Azure DevOps · Must be well experienced in using REST API to integrate with external systems. · Understanding of Agile methodologies such as scrum · Excellent troubleshooting and communication skills · Attention to detail and good eye for troubleshooting . BSc/BA in Computer Science, Engineering, or a related field.  Requirements",
            "infoSource": "Mycareersfuture SG",
            "postDate": "About 5 hours ago",
            "crawlerCreateDate": "1616683939688"
        },
        {
            "link": "https://sg.jobsdb.com/job/Manager-1beb077f9c4bd6b319a0d6a3a7b78c78?from_url=https%3A%2F%2Fsg.jobsdb.com%2Fj%3Fa%3D24h%26jt%3D3%26l%3DSingapore%26q%3Dfront%2Bend%2Bdeveloper%26sp%3Dfacet_listed_date%26p%3D9&sfjt=3&sl=Singapore&sol_srt=dd79ac54-12de-49f5-a3a9-8acca8439f09&sp=serp&sponsored=false&sq=front+end+developer&sr=82&tk=uBaD_ecaU9CzgB_06dL6-NbpAs9E3fMEEFJjkBuQW",
            "title": "Manager/Senior Manager, Group CCO’s Office ",
            "location": "Singapore",
            "company": "GARENA ONLINE PRIVATE LIMITED",
            "salary": "$10,000 - $18,000 per month",
            "description": "Roles & ResponsibilitiesJob Description: - Work closely with Group Chief Corporate Officer on key corporate and strategic projects for Sea and its businesses, including Garena, Shopee and SeaMoney and collaborate with the other corporate functions under Group CCO. - Unique opportunity to work on a very broad range of projects in capital markets transactions, corporate investments and M&A, investor and public communications, public policy and other key group-level strategic initiatives, depending on a successful applicant’s existing skillsets and ability to develop new expertise on the job. Job Requirements: - Bachelor’s degree and above from a global leading institution (MBA a plus). - Banking, consulting or in-house corporate development and strategy experience in the consumer internet sector. - Background and strong interest in the e-commerce, esports and e-payments segments highly relevant. - Solid business and financial analysis, project management and communication skills (relevant language skills a plus). - Highly driven, intelligent and hard-working self-starter focused on delivering high quality results with efficiency and speed. - Team player, humble, pragmatic, organized and results driven. - Genuine passion for continual self-development in a fast growing company. Requirements",
            "infoSource": "Mycareersfuture SG",
            "postDate": "About 5 hours ago",
            "crawlerCreateDate": "1616683940076"
        },
        {
            "link": "https://sg.jobsdb.com/job/Marine-Insurance-Manager-df5acf4aa4092f42033707073c0d0ece?from_url=https%3A%2F%2Fsg.jobsdb.com%2Fj%3Fa%3D24h%26jt%3D3%26l%3DSingapore%26q%3Dfront%2Bend%2Bdeveloper%26sp%3Dfacet_listed_date%26p%3D9&sfjt=3&sl=Singapore&sol_srt=dd79ac54-12de-49f5-a3a9-8acca8439f09&sp=serp&sponsored=false&sq=front+end+developer&sr=83&tk=uBaD_ecaU9CzgB_06dL6-NbpAs9E3fMEEFJjkBuQW",
            "title": "Marine Insurance Manager / Director (Fast Growing)",
            "location": "Central Singapore",
            "company": "Marine Online (Singapore) Pte Ltd",
            "salary": "",
            "description": "  18 Days Annual Leave Good working environment, New office at Kallang Solaris 5 working days per week, 9am-5.30pm  RESPONSIBILITIES:  According to the existing and potential needs of the shipping insurance business, combine the Internet e-commerce, big data analysis, artificial intelligence, and other scientific means to plan and implement innovative Internet insurance products, and promote the sustainable development of the platform insurance business. Establish cooperative relationships with international mainstream shipping insurance companies to realize platform sales of existing insurance products or research and development of targeted insurance products, and improve the types and coverage of platform insurance products According to the actual needs of shipping insurance customers, develop targeted platform insurance product promotion and sales plans, organize online sales, and improve sales performance. Develop efficient claims and service specifications based on platform business characteristics to improve customer service quality and satisfaction Develop and cultivate self-service and intelligent shipping insurance products based on big data accumulation and analysis, and take advantage of “insurance technology” to form a platform with unique products and service systems to enhance competitiveness and threshold. Responsible for the cooperation, compliance, development, and promotion of the platform insurance business in the target country market. Responsible for the formation, training assessment, and daily management of the platform insurance team Responsible for development and cooperation with other platforms Responsible to ensure that all broking/placement activity is in compliance with MAS regulations and MOL Company Policy and Guidelines.  REQUIREMENTS:  More than 8-10 years of experience in the insurance industry, 5 years of experience in management positions; Familiar with marine insurances such as H&M insurance and cargo insurance; Recognize the e-commerce model, the development prospects and potential of insurance technology, and be willing to invest in the development of innovative businesses; Rich in insurance company resources or shipping customer resources; Positive and optimistic personality, strong communication skills and good leadership skills;  We regret that we will not be able to respond to all applications as only shortlisted candidates will be notified. ",
            "infoSource": "Jobstreet SG",
            "postDate": "About 17 hours ago",
            "crawlerCreateDate": "1616683940442"
        },
        {
            "link": "https://sg.jobsdb.com/job/Development-Engineer-7eb2b26a64615f8cf2be0c01125a4edd?from_url=https%3A%2F%2Fsg.jobsdb.com%2Fj%3Fa%3D24h%26jt%3D3%26l%3DSingapore%26q%3Dfront%2Bend%2Bdeveloper%26sp%3Dfacet_listed_date%26p%3D9&sfjt=3&sl=Singapore&sol_srt=dd79ac54-12de-49f5-a3a9-8acca8439f09&sp=serp&sponsored=false&sq=front+end+developer&sr=84&tk=uBaD_ecaU9CzgB_06dL6-NbpAs9E3fMEEFJjkBuQW",
            "title": "Development Engineer, ARTC",
            "location": "Singapore",
            "company": "Agency for Science, Technology and Research (A*STAR)",
            "salary": "",
            "description": "As a Development Engineer, you will part of a team developing next generation software robotics solutions, based on the open-source Robot Operating System (ROS) framework. Together, we have an opportunity to shape the future of robotics. The role includes:Develop, extend, support and apply robotics software to solve industrial problems. Ability to use the ROS programming framework and Gazebo simulator. Topics of interest include 3D modelling, communications middleware, developer and debugging tools, perception, motion planning, and software packaging and distribution. The ideal candidate is proficient in at least one of these topics, and capable of expanding into othe Responsibilities:  Create software architecture, design and evaluate technologies to use Design, analyze, troubleshooting and debugging systems and develop software solutions for industry members by translating business requirements into system requirements Software development in C++, Python, ROS tools and libraries Full life-cycle library and application development. Support, maintenance, and documentation of software functionality. Software testing and quality assurance. Integrate software with robotic hardware and mechanics to automate the adaptive robotic process Develop testing and validation strategies Manage state of the art machine vision technology and integration with robotic processes Technical project planning and execution on development projects for global industry members Technical write up and presentation  Job Requirements  Bachelor degree in Robotics Engineering, Software Engineering, Computer Engineering, Electrical Engineering or Computer Science 2-5 years of experience Experience in ROS, robotics, machine vision and image processing, machine learning and systems design is an added advantage  The above eligibility criteria are not exhaustive. A*STAR may include additional selection criteria based on its prevailing recruitment policies. These policies may be amended from time to time without notice. We regret that only shortlisted candidates will be notified.",
            "infoSource": "Jobstreet SG",
            "postDate": "About 17 hours ago",
            "crawlerCreateDate": "1616683940808"
        },
        {
            "link": "https://sg.jobsdb.com/job/Development-Scientist-d6efc4620997dd329f8a8c61c894ca79?from_url=https%3A%2F%2Fsg.jobsdb.com%2Fj%3Fa%3D24h%26jt%3D3%26l%3DSingapore%26q%3Dfront%2Bend%2Bdeveloper%26sp%3Dfacet_listed_date%26p%3D9&sfjt=3&sl=Singapore&sol_srt=dd79ac54-12de-49f5-a3a9-8acca8439f09&sp=serp&sponsored=false&sq=front+end+developer&sr=85&tk=uBaD_ecaU9CzgB_06dL6-NbpAs9E3fMEEFJjkBuQW",
            "title": "Development Scientist, ARTC",
            "location": "Singapore",
            "company": "Agency for Science, Technology and Research (A*STAR)",
            "salary": "",
            "description": "As a Development Scientist, you will be a key resource in a team developing next generation software robotics solutions, based on the open-source Robot Operating System (ROS) framework. Together, we have an opportunity to shape the future of robotics. The role includes: Research, develop, extend, support and apply robotics software to solve industrial problems. Ability to use the ROS programming framework and Gazebo simulator. Topics of interest include 3D modelling, communications middleware, developer and debugging tools, perception, motion planning and software packaging and distribution. The ideal candidate is proficient in several of the topics, and capable of expanding into others. Responsibilities:  Drive independent application oriented robotic research towards industrial automation using ROS Develop and implement new robotic capabilities in adaptive control, integrated sensory system & manipulation or navigation Create software architecture, design and evaluate technologies to use Software development in C++, Python, ROS tools and libraries Design, analyze, troubleshooting and debugging systems and develop software solutions for industry members by translating business requirements into system requirements Integrate software with robotic hardware and develop robotic applications for manufacturing process Develop testing and validation strategies with industry standards Manage state of the art machine vision technology and integration with robotic processes Technical project planning and execution on development projects for global industry members Technical write up and presentation  Job Requirements  PhD degree in Robotics Engineering, Software Engineering, Computer Engineering, Electrical Engineering or Computer Science 0-5 years Experience in ROS, robotics, machine vision and image processing, machine learning and systems design is an added advantage  The above eligibility criteria are not exhaustive. A*STAR may include additional selection criteria based on its prevailing recruitment policies. These policies may be amended from time to time without notice. We regret that only shortlisted candidates will be notified.",
            "infoSource": "Jobstreet SG",
            "postDate": "About 17 hours ago",
            "crawlerCreateDate": "1616683941227"
        },
        {
            "link": "https://sg.jobsdb.com/job/Product-Testing-Engineer-bc5456634c72f01fbd51e4e4c3c9816a?from_url=https%3A%2F%2Fsg.jobsdb.com%2Fj%3Fa%3D24h%26jt%3D3%26l%3DSingapore%26q%3Dfront%2Bend%2Bdeveloper%26sp%3Dfacet_listed_date%26p%3D9&sfjt=3&sl=Singapore&sol_srt=dd79ac54-12de-49f5-a3a9-8acca8439f09&sp=serp&sponsored=false&sq=front+end+developer&sr=86&tk=uBaD_ecaU9CzgB_06dL6-NbpAs9E3fMEEFJjkBuQW",
            "title": "Product Testing Engineer",
            "location": "Singapore",
            "company": "VSMART TECHNOLOGIES PTE. LTD.",
            "salary": "",
            "description": "We are inviting suitable qualified candidates to join our team as : Product Engineer Responsibilities :   Manage new cellular product launch in Singapore Main interface person for product RFI/RFP and technical related question between telecommunication carriers engineering team in Singapore (Singtel, StarHub and M1) and cellular product development team. Manage new cellular product technical issues, analyse and troubleshoot issues, and take responsibility owning and addressing product issues to product development functions to drive fixes for the issues Oversee Singapore Cellular Mobile Terminal regulatory requirements. Work with in-house product compliance team and stakeholders to drive implementation of new regulatory requirement on cellular mobile terminal product Maintain good and current understanding of Singapore IMDA Cellular Mobile Terminal regulatory requirements Managing and coordinating new cellular product in-country Local Type Approval Support IoT Business Development team by providing technical expertise in the Internet-of-Things (IoT) solutions Pioneer the NFC-enabled wearable payments device Proof-of-Concept (PoC) and run user trials for payments on public transport and retail in Singapore Skilled in developed project plan, schedule, execute, prioritize, track progress, drive fixes, deliver update of new cellular products certification and test activity Identified gaps between cellular product technology features versus telecommunication carrier network technology features roll-out plan, defined product specifications with development team. Effectively worked in diverse cross-functional teams, acted as key interface between internal stakeholders and external customers to drive software fixes and deliver software update, built rapport and maintained good relationships with internal stakeholders and external customers Clearly and effectively communicated project status, prioritize tasks, important results to senior management Fluent in English and Chinese, both verbal and written Pioneer the establishing of technical acceptance activity process to improve the handling of technical acceptance issues inflow, issues prioritization and shorten the lead time of addressing product issues to product development functions to fix issues Manage internal and external stakeholders on new Smartphone product technical acceptance test activity and product technical acceptance approvals for telecommunication carriers in Singapore. Work with product development functions in China on product technical issues, analyze and troubleshoot issues, and take responsibility owning and addressing product issues to ensure solution deliver for the issues. Negotiate technical acceptance and approval with customers including network operator Singtel, StarHub, M1. Responsible for radio access technology and content & application interoperability testing between operator’s network and in-house developed mobile devices. Work with network operators including SingTel, M1, StarHub on interoperability test and network optimization  Requirements :  Candidate must possess at least Diploma/Advanced/Higher/Graduate Diploma in any field. Have good time management skills and able to work on own. Good communication skills Highly proficient in spoken and written Mandarin and English to responds to Mandarin and English speaking customer/client inquiries, suggestions, complaints and other details, by phone, online video conferences and email. Proficient in Microsoft Word, Excel and Powerpoint. Desire to self learn and improve At least 3 Year(s) of working experience in the related field is required for this position. Preferably specialized in Sales - Account Management  Interested applicants are invited to apply online with a comprehensive resume, via the button of Apply Now.",
            "infoSource": "Jobstreet SG",
            "postDate": "About 17 hours ago",
            "crawlerCreateDate": "1616683941591"
        },
        {
            "link": "https://sg.jobsdb.com/job/Laboratory-Officer-1c0253443c94b7721305542c5de07a34?from_url=https%3A%2F%2Fsg.jobsdb.com%2Fj%3Fa%3D24h%26jt%3D3%26l%3DSingapore%26q%3Dfront%2Bend%2Bdeveloper%26sp%3Dfacet_listed_date%26p%3D9&sfjt=3&sl=Singapore&sol_srt=dd79ac54-12de-49f5-a3a9-8acca8439f09&sp=serp&sponsored=false&sq=front+end+developer&sr=87&tk=uBaD_ecaU9CzgB_06dL6-NbpAs9E3fMEEFJjkBuQW",
            "title": "[SgUnitedJobs] Laboratory Officer/ Research Officer/ Research Engineer, IHPC",
            "location": "Singapore",
            "company": "Agency for Science, Technology and Research",
            "salary": "",
            "description": "Overview of RI Established in August 1998, the Institute of High Performance Computing (IHPC) is a Research Institute under the Agency for Science, Technology and Research (A*STAR). Committed to advancing science and technology, IHPC seeks to promote and spearhead scientific advances and technological innovations through computational modelling, simulation and AI, and to develop impactful applications to further economic growth and improve lives.Our research foci are in computing science and AI; large scale complex systems modelling; social and cognitive computing; and computational engineering mechanics, fluidic dynamics, electronics and photonics, materials science and chemistry. These core capabilities enable us to tackle real-world challenges and create solutions for physical and human systems, such as manufacturing, energy, healthcare, transportation and urban systems and more.Job Description ???       Participate in research conceptualization and design???       Conduct experiments or tests in the laboratory ???       Participate in data collection and preparation, and support data analysis???       Prepare reports and documentation for research programs???       Resolves routine research or technical problems independently using accepted methods or techniques???       Assist in duties related to project management, documentation, and outreach of research results Job Requirements???       Tertiary level graduates in computer related disciplines. Programming skills in JavaScript, HTML, CSS. Experience in and/or strong willingness to learn UI/UX design, frontend development, software engineering. There is also opportunity to learn AI.???       No experience required; prior experience is a plus ???       Experience in a laboratory environment preferred ???       Independent problem solving skills, innovative strategic and technical thinker, team player???       Possess good interpersonal, presentation and communication skills",
            "infoSource": "Jobstreet SG",
            "postDate": "About 17 hours ago",
            "crawlerCreateDate": "1616683941956"
        },
        {
            "link": "https://sg.jobsdb.com/job/rd/8b1d7607485d0fcf91e017b6d7f56409?sp=sserp_bottom&sponsored=true&sr=83&tk=uBaD_ecaU9CzgB_06dL6-NbpAs9E3fMEEFJjkBuQW",
            "title": "",
            "location": "",
            "company": "",
            "salary": "",
            "description": "",
            "infoSource": "",
            "postDate": "",
            "crawlerCreateDate": "1616683942623"
        },
        {
            "link": "https://sg.jobsdb.com/job/rd/4f2f44577683d25c45a22283dc417ce4?sp=sserp_bottom&sponsored=true&sr=84&tk=uBaD_ecaU9CzgB_06dL6-NbpAs9E3fMEEFJjkBuQW",
            "title": "",
            "location": "",
            "company": "",
            "salary": "",
            "description": "",
            "infoSource": "",
            "postDate": "",
            "crawlerCreateDate": "1616683943570"
        },
        {
            "link": "https://sg.jobsdb.com/job/rd/b9adb9c0af10ee0ebb03a062188694b2?sp=sserp_bottom&sponsored=true&sr=85&tk=uBaD_ecaU9CzgB_06dL6-NbpAs9E3fMEEFJjkBuQW",
            "title": "",
            "location": "",
            "company": "",
            "salary": "",
            "description": "",
            "infoSource": "",
            "postDate": "",
            "crawlerCreateDate": "1616683944333"
        }
    ]
}